<?xml version="1.0"?>
<GCC_XML cvs_revision="1.134">

  <Function id="_975" name="__getdomainname_chk" returns="_103" context="_1" location="f3:362" file="f3" line="362" extern="1" attributes="__warn_unused_result__ __nonnull__()">
    <Argument name="__buf" type="_82" location="f3:362" file="f3" line="362"/>
    <Argument name="__buflen" type="_656" location="f3:362" file="f3" line="362"/>
    <Argument name="__nreal" type="_656" location="f3:362" file="f3" line="362"/>
  </Function>
  <Variable id="_976" name="_ZTIN9SourceMod14IPreparedQueryE" type="_1010c" context="_1" location="f15:331" file="f15" line="331" extern="1" artificial="1"/>
  <Typedef id="_977" name="__ino64_t" type="_913" context="_1" location="f18:138" file="f18" line="138"/>
  <Function id="_978" name="__builtin_sinf" returns="_1008" context="_1" mangled="sinf" location="f2:76" file="f2" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_1008" location="f2:76" file="f2" line="76"/>
  </Function>
  <Variable id="_979" name="_ZTIN9SourceMod15IClientListenerE" type="_1036c" context="_1" location="f25:245" file="f25" line="245" extern="1" artificial="1"/>
  <Function id="_980" name="__builtin_sinh" returns="_1007" context="_1" mangled="sinh" location="f2:77" file="f2" line="77" extern="1" attributes="nothrow">
    <Argument type="_1007" location="f2:77" file="f2" line="77"/>
  </Function>
  <Typedef id="_981" name="__io_read_fn" type="_502" context="_1" location="f17:364" file="f17" line="364"/>
  <Function id="_982" name="__builtin_sinl" returns="_1009" context="_1" mangled="sinl" location="f2:80" file="f2" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_1009" location="f2:80" file="f2" line="80"/>
  </Function>
  <Function id="_983" name="lockf64" returns="_103" context="_1" location="f4:1104" file="f4" line="1104" extern="1" attributes="__warn_unused_result__">
    <Argument name="__fd" type="_103" location="f4:1104" file="f4" line="1104"/>
    <Argument name="__cmd" type="_103" location="f4:1104" file="f4" line="1104"/>
    <Argument name="__len" type="_813" location="f4:1104" file="f4" line="1104"/>
  </Function>
  <Typedef id="_984" name="uint64_t" type="_23" context="_1" location="f10:59" file="f10" line="59"/>
  <Function id="_985" name="__builtin_csin" returns="_1063" context="_1" mangled="csin" location="f2:115" file="f2" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_1063" location="f2:115" file="f2" line="115"/>
  </Function>
  <Function id="_986" name="alphasort" returns="_103" throw="" context="_1" location="f23:287" file="f23" line="287" extern="1" attributes="__pure__ __nonnull__(,)">
    <Argument name="__e1" type="_1625" location="f23:287" file="f23" line="287"/>
    <Argument name="__e2" type="_1625" location="f23:287" file="f23" line="287"/>
  </Function>
  <Function id="_987" name="getpass" returns="_82" context="_1" location="f4:967" file="f4" line="967" extern="1" attributes="__nonnull__()">
    <Argument name="__prompt" type="_1006" location="f4:967" file="f4" line="967"/>
  </Function>
  <Function id="_988" name="_IO_vfscanf" returns="_103" context="_1" location="f17:491" file="f17" line="491" extern="1">
    <Argument type="_1038r" location="f17:491" file="f17" line="491"/>
    <Argument type="_1006r" location="f17:491" file="f17" line="491"/>
    <Argument type="_687" location="f17:491" file="f17" line="491"/>
    <Argument type="_1214r" location="f17:491" file="f17" line="491"/>
  </Function>
  <Variable id="_989" name="_ZTIN9SourceMod16IPluginsListenerE" type="_1036c" context="_1" location="f52:256" file="f52" line="256" extern="1" artificial="1"/>
  <Function id="_990" name="_IO_ftrylockfile" returns="_103" throw="" context="_1" location="f17:473" file="f17" line="473" extern="1">
    <Argument type="_1038" location="f17:473" file="f17" line="473"/>
  </Function>
  <Function id="_991" name="ftruncate" returns="_103" throw="" context="_1" location="f4:1029" file="f4" line="1029" extern="1" attributes="__warn_unused_result__">
    <Argument name="__fd" type="_103" location="f4:1029" file="f4" line="1029"/>
    <Argument name="__length" type="_606" location="f4:1029" file="f4" line="1029"/>
  </Function>
  <Function id="_992" name="strcoll_l" returns="_103" throw="" context="_1" location="f1:166" file="f1" line="166" extern="1" attributes="__pure__ __nonnull__(,,)">
    <Argument name="__s1" type="_1006" location="f1:166" file="f1" line="166"/>
    <Argument name="__s2" type="_1006" location="f1:166" file="f1" line="166"/>
    <Argument name="__l" type="_720" location="f1:166" file="f1" line="166"/>
  </Function>
  <Typedef id="_993" name="__int32_t" type="_103" context="_1" location="f18:41" file="f18" line="41"/>
  <Typedef id="_994" name="__io_write_fn" type="_245" context="_1" location="f17:373" file="f17" line="373"/>
  <Variable id="_995" name="_ZTIN9SourceMod15IPluginIteratorE" type="_1036c" context="_1" location="f52:223" file="f52" line="223" extern="1" artificial="1"/>
  <Struct id="_996" name="sp_pubvar_s" context="_1" mangled="11sp_pubvar_s" demangled="sp_pubvar_s" location="f24:139" file="f24" line="139" artificial="1" size="64" align="32" members="_1655 _1656 _1657 _1658 _1659 _1660 " bases=""/>
  <Typedef id="_997" name="sp_pubvar_t" type="_996" context="_1" location="f24:142" file="f24" line="142"/>
  <Function id="_998" name="readlinkat" returns="_640" throw="" context="_1" location="f3:174" file="f3" line="174" endline="174" inline="1" attributes="__gnu_inline__ __always_inline__ __warn_unused_result__ __nonnull__(,)">
    <Argument name="__fd" type="_103" location="f3:174" file="f3" line="174"/>
    <Argument name="__path" type="_1006r" location="f3:174" file="f3" line="174"/>
    <Argument name="__buf" type="_82r" location="f3:174" file="f3" line="174"/>
    <Argument name="__len" type="_656" location="f3:174" file="f3" line="174"/>
  </Function>
  <Typedef id="_999" name="__caddr_t" type="_82" context="_1" location="f18:186" file="f18" line="186"/>
  <Field id="_1000" name="it_interval" type="_446" offset="0" context="_3" access="public" location="f0:163" file="f0" line="163"/>
  <Field id="_1001" name="it_value" type="_446" offset="64" context="_3" access="public" location="f0:164" file="f0" line="164"/>
  <Destructor id="_1002" name="itimerspec" artificial="1" throw="" context="_3" access="public" mangled="_ZN10itimerspecD1Ev *INTERNAL* " demangled="itimerspec::~itimerspec()" location="f0:162" file="f0" line="162" endline="162" inline="1">
  </Destructor>
  <OperatorMethod id="_1003" name="=" returns="_1661" artificial="1" throw="" context="_3" access="public" mangled="_ZN10itimerspecaSERKS_" demangled="itimerspec::operator=(itimerspec const&amp;)" location="f0:162" file="f0" line="162" endline="162" inline="1">
    <Argument type="_1662" location="f0:162" file="f0" line="162"/>
  </OperatorMethod>
  <Constructor id="_1004" name="itimerspec" artificial="1" throw="" context="_3" access="public" mangled="_ZN10itimerspecC1ERKS_ *INTERNAL* " demangled="itimerspec::itimerspec(itimerspec const&amp;)" location="f0:162" file="f0" line="162" endline="162" inline="1">
    <Argument type="_1662" location="f0:162" file="f0" line="162"/>
  </Constructor>
  <Constructor id="_1005" name="itimerspec" artificial="1" throw="" context="_3" access="public" mangled="_ZN10itimerspecC1Ev *INTERNAL* " demangled="itimerspec::itimerspec()" location="f0:162" file="f0" line="162" inline="1"/>
  <PointerType id="_1006" type="_1062c" size="32" align="32"/>
  <FundamentalType id="_1007" name="double" size="64" align="64"/>
  <FundamentalType id="_1008" name="float" size="32" align="32"/>
  <FundamentalType id="_1009" name="long double" size="96" align="32"/>
  <Struct id="_1010" name="__si_class_type_info_pseudo" context="_1" mangled="27__si_class_type_info_pseudo" demangled="__si_class_type_info_pseudo" location="f55:0" file="f55" line="0" size="96" align="32" members=""/>
  <CvQualifiedType id="_1010c" type="_1010" const="1"/>
  <PointerType id="_1012" type="_849" size="32" align="32"/>
  <Field id="_1013" name="tm_sec" type="_103" offset="0" context="_16" access="public" location="f0:135" file="f0" line="135"/>
  <Field id="_1014" name="tm_min" type="_103" offset="32" context="_16" access="public" location="f0:136" file="f0" line="136"/>
  <Field id="_1015" name="tm_hour" type="_103" offset="64" context="_16" access="public" location="f0:137" file="f0" line="137"/>
  <Field id="_1016" name="tm_mday" type="_103" offset="96" context="_16" access="public" location="f0:138" file="f0" line="138"/>
  <Field id="_1017" name="tm_mon" type="_103" offset="128" context="_16" access="public" location="f0:139" file="f0" line="139"/>
  <Field id="_1018" name="tm_year" type="_103" offset="160" context="_16" access="public" location="f0:140" file="f0" line="140"/>
  <Field id="_1019" name="tm_wday" type="_103" offset="192" context="_16" access="public" location="f0:141" file="f0" line="141"/>
  <Field id="_1020" name="tm_yday" type="_103" offset="224" context="_16" access="public" location="f0:142" file="f0" line="142"/>
  <Field id="_1021" name="tm_isdst" type="_103" offset="256" context="_16" access="public" location="f0:143" file="f0" line="143"/>
  <Field id="_1022" name="tm_gmtoff" type="_21" offset="288" context="_16" access="public" location="f0:146" file="f0" line="146"/>
  <Field id="_1023" name="tm_zone" type="_1006" offset="320" context="_16" access="public" location="f0:147" file="f0" line="147"/>
  <Destructor id="_1024" name="tm" artificial="1" throw="" context="_16" access="public" mangled="_ZN2tmD1Ev *INTERNAL* " demangled="tm::~tm()" location="f0:134" file="f0" line="134" endline="134" inline="1">
  </Destructor>
  <OperatorMethod id="_1025" name="=" returns="_1664" artificial="1" throw="" context="_16" access="public" mangled="_ZN2tmaSERKS_" demangled="tm::operator=(tm const&amp;)" location="f0:134" file="f0" line="134" endline="134" inline="1">
    <Argument type="_1665" location="f0:134" file="f0" line="134"/>
  </OperatorMethod>
  <Constructor id="_1026" name="tm" artificial="1" throw="" context="_16" access="public" mangled="_ZN2tmC1ERKS_ *INTERNAL* " demangled="tm::tm(tm const&amp;)" location="f0:134" file="f0" line="134" endline="134" inline="1">
    <Argument type="_1665" location="f0:134" file="f0" line="134"/>
  </Constructor>
  <Constructor id="_1027" name="tm" artificial="1" throw="" context="_16" access="public" mangled="_ZN2tmC1Ev *INTERNAL* " demangled="tm::tm()" location="f0:134" file="f0" line="134" inline="1"/>
  <FundamentalType id="_1028" name="bool" size="8" align="8"/>
  <PointerType id="_1029" type="_571" size="32" align="32"/>
  <CvQualifiedType id="_1006r" type="_1006" restrict="1"/>
  <CvQualifiedType id="_82r" type="_82" restrict="1"/>
  <FundamentalType id="_1032" name="complex float" size="64" align="32"/>
  <FundamentalType id="_1033" name="complex long double" size="192" align="32"/>
  <PointerType id="_1034" type="_1304" size="32" align="32"/>
  <PointerType id="_1035" type="_82c" size="32" align="32"/>
  <Struct id="_1036" name="__class_type_info_pseudo" context="_1" mangled="24__class_type_info_pseudo" demangled="__class_type_info_pseudo" location="f55:0" file="f55" line="0" size="64" align="32" members=""/>
  <CvQualifiedType id="_1036c" type="_1036" const="1"/>
  <PointerType id="_1038" type="_121" size="32" align="32"/>
  <Field id="_1039" name="read" type="_1667" offset="0" context="_55" access="public" location="f17:397" file="f17" line="397"/>
  <Field id="_1040" name="write" type="_1668" offset="32" context="_55" access="public" location="f17:398" file="f17" line="398"/>
  <Field id="_1041" name="seek" type="_1669" offset="64" context="_55" access="public" location="f17:399" file="f17" line="399"/>
  <Field id="_1042" name="close" type="_1670" offset="96" context="_55" access="public" location="f17:400" file="f17" line="400"/>
  <Destructor id="_1043" name="._5" artificial="1" throw="" context="_55" access="public" mangled="_ZN25_IO_cookie_io_functions_tD1Ev *INTERNAL* " demangled="_IO_cookie_io_functions_t::~_IO_cookie_io_functions_t()" location="f17:401" file="f17" line="401" endline="401" inline="1">
  </Destructor>
  <OperatorMethod id="_1044" name="=" returns="_1671" artificial="1" throw="" context="_55" access="public" mangled="_ZN25_IO_cookie_io_functions_taSERKS_" demangled="_IO_cookie_io_functions_t::operator=(_IO_cookie_io_functions_t const&amp;)" location="f17:401" file="f17" line="401" endline="401" inline="1">
    <Argument type="_1672" location="f17:396" file="f17" line="396"/>
  </OperatorMethod>
  <Constructor id="_1045" name="._5" artificial="1" throw="" context="_55" access="public" mangled="_ZN25_IO_cookie_io_functions_tC1ERKS_ *INTERNAL* " demangled="_IO_cookie_io_functions_t::_IO_cookie_io_functions_t(_IO_cookie_io_functions_t const&amp;)" location="f17:401" file="f17" line="401" endline="401" inline="1">
    <Argument type="_1672" location="f17:396" file="f17" line="396"/>
  </Constructor>
  <Constructor id="_1046" name="._5" artificial="1" throw="" context="_55" access="public" mangled="_ZN25_IO_cookie_io_functions_tC1Ev *INTERNAL* " demangled="_IO_cookie_io_functions_t::_IO_cookie_io_functions_t()" location="f17:401" file="f17" line="401" inline="1"/>
  <PointerType id="_1047" type="_54" size="32" align="32"/>
  <CvQualifiedType id="_1047r" type="_1047" restrict="1"/>
  <Field id="_1049" name="dli_fname" type="_1006" offset="0" context="_71" access="public" location="f19:91" file="f19" line="91"/>
  <Field id="_1050" name="dli_fbase" type="_296" offset="32" context="_71" access="public" location="f19:92" file="f19" line="92"/>
  <Field id="_1051" name="dli_sname" type="_1006" offset="64" context="_71" access="public" location="f19:93" file="f19" line="93"/>
  <Field id="_1052" name="dli_saddr" type="_296" offset="96" context="_71" access="public" location="f19:94" file="f19" line="94"/>
  <Destructor id="_1053" name="._10" artificial="1" throw="" context="_71" access="public" mangled="_ZN7Dl_infoD1Ev *INTERNAL* " demangled="Dl_info::~Dl_info()" location="f19:95" file="f19" line="95" endline="95" inline="1">
  </Destructor>
  <OperatorMethod id="_1054" name="=" returns="_1673" artificial="1" throw="" context="_71" access="public" mangled="_ZN7Dl_infoaSERKS_" demangled="Dl_info::operator=(Dl_info const&amp;)" location="f19:95" file="f19" line="95" endline="95" inline="1">
    <Argument type="_1674" location="f19:90" file="f19" line="90"/>
  </OperatorMethod>
  <Constructor id="_1055" name="._10" artificial="1" throw="" context="_71" access="public" mangled="_ZN7Dl_infoC1ERKS_ *INTERNAL* " demangled="Dl_info::Dl_info(Dl_info const&amp;)" location="f19:95" file="f19" line="95" endline="95" inline="1">
    <Argument type="_1674" location="f19:90" file="f19" line="90"/>
  </Constructor>
  <Constructor id="_1056" name="._10" artificial="1" throw="" context="_71" access="public" mangled="_ZN7Dl_infoC1Ev *INTERNAL* " demangled="Dl_info::Dl_info()" location="f19:95" file="f19" line="95" inline="1"/>
  <CvQualifiedType id="_1029r" type="_1029" restrict="1"/>
  <PointerType id="_1058" type="_82" size="32" align="32"/>
  <CvQualifiedType id="_1058r" type="_1058" restrict="1"/>
  <CvQualifiedType id="_296r" type="_296" restrict="1"/>
  <PointerType id="_1061" type="_1263" size="32" align="32"/>
  <FundamentalType id="_1063" name="complex double" size="128" align="64"/>
  <PointerType id="_1064" type="_536" size="32" align="32"/>
  <PointerType id="_1066" type="_656" size="32" align="32"/>
  <CvQualifiedType id="_1066r" type="_1066" restrict="1"/>
  <Field id="_1068" name="_flags" type="_103" offset="0" context="_121" access="public" location="f17:272" file="f17" line="272"/>
  <Field id="_1069" name="_IO_read_ptr" type="_82" offset="32" context="_121" access="public" location="f17:277" file="f17" line="277"/>
  <Field id="_1070" name="_IO_read_end" type="_82" offset="64" context="_121" access="public" location="f17:278" file="f17" line="278"/>
  <Field id="_1071" name="_IO_read_base" type="_82" offset="96" context="_121" access="public" location="f17:279" file="f17" line="279"/>
  <Field id="_1072" name="_IO_write_base" type="_82" offset="128" context="_121" access="public" location="f17:280" file="f17" line="280"/>
  <Field id="_1073" name="_IO_write_ptr" type="_82" offset="160" context="_121" access="public" location="f17:281" file="f17" line="281"/>
  <Field id="_1074" name="_IO_write_end" type="_82" offset="192" context="_121" access="public" location="f17:282" file="f17" line="282"/>
  <Field id="_1075" name="_IO_buf_base" type="_82" offset="224" context="_121" access="public" location="f17:283" file="f17" line="283"/>
  <Field id="_1076" name="_IO_buf_end" type="_82" offset="256" context="_121" access="public" location="f17:284" file="f17" line="284"/>
  <Field id="_1077" name="_IO_save_base" type="_82" offset="288" context="_121" access="public" location="f17:286" file="f17" line="286"/>
  <Field id="_1078" name="_IO_backup_base" type="_82" offset="320" context="_121" access="public" location="f17:287" file="f17" line="287"/>
  <Field id="_1079" name="_IO_save_end" type="_82" offset="352" context="_121" access="public" location="f17:288" file="f17" line="288"/>
  <Field id="_1080" name="_markers" type="_1675" offset="384" context="_121" access="public" location="f17:290" file="f17" line="290"/>
  <Field id="_1081" name="_chain" type="_1038" offset="416" context="_121" access="public" location="f17:292" file="f17" line="292"/>
  <Field id="_1082" name="_fileno" type="_103" offset="448" context="_121" access="public" location="f17:294" file="f17" line="294"/>
  <Field id="_1083" name="_flags2" type="_103" offset="480" context="_121" access="public" location="f17:298" file="f17" line="298"/>
  <Field id="_1084" name="_old_offset" type="_606" offset="512" context="_121" access="public" location="f17:300" file="f17" line="300"/>
  <Field id="_1085" name="_cur_column" type="_210" offset="544" context="_121" access="public" location="f17:304" file="f17" line="304"/>
  <Field id="_1086" name="_vtable_offset" type="_184" offset="560" context="_121" access="public" location="f17:305" file="f17" line="305"/>
  <Field id="_1087" name="_shortbuf" type="_1676" offset="568" context="_121" access="public" location="f17:306" file="f17" line="306"/>
  <Field id="_1088" name="_lock" type="_1677" offset="576" context="_121" access="public" location="f17:310" file="f17" line="310"/>
  <Field id="_1089" name="_offset" type="_813" offset="608" context="_121" access="public" location="f17:319" file="f17" line="319"/>
  <Field id="_1090" name="__pad1" type="_296" offset="672" context="_121" access="public" location="f17:328" file="f17" line="328"/>
  <Field id="_1091" name="__pad2" type="_296" offset="704" context="_121" access="public" location="f17:329" file="f17" line="329"/>
  <Field id="_1092" name="__pad3" type="_296" offset="736" context="_121" access="public" location="f17:330" file="f17" line="330"/>
  <Field id="_1093" name="__pad4" type="_296" offset="768" context="_121" access="public" location="f17:331" file="f17" line="331"/>
  <Field id="_1094" name="__pad5" type="_656" offset="800" context="_121" access="public" location="f17:332" file="f17" line="332"/>
  <Field id="_1095" name="_mode" type="_103" offset="832" context="_121" access="public" location="f17:334" file="f17" line="334"/>
  <Field id="_1096" name="_unused2" type="_1678" offset="864" context="_121" access="public" location="f17:336" file="f17" line="336"/>
  <Destructor id="_1097" name="_IO_FILE" artificial="1" throw="" context="_121" access="public" mangled="_ZN8_IO_FILED1Ev *INTERNAL* " demangled="_IO_FILE::~_IO_FILE()" location="f17:271" file="f17" line="271" endline="271" inline="1">
  </Destructor>
  <OperatorMethod id="_1098" name="=" returns="_1679" artificial="1" throw="" context="_121" access="public" mangled="_ZN8_IO_FILEaSERKS_" demangled="_IO_FILE::operator=(_IO_FILE const&amp;)" location="f17:271" file="f17" line="271" endline="271" inline="1">
    <Argument type="_1680" location="f17:271" file="f17" line="271"/>
  </OperatorMethod>
  <Constructor id="_1099" name="_IO_FILE" artificial="1" throw="" context="_121" access="public" mangled="_ZN8_IO_FILEC1ERKS_ *INTERNAL* " demangled="_IO_FILE::_IO_FILE(_IO_FILE const&amp;)" location="f17:271" file="f17" line="271" endline="271" inline="1">
    <Argument type="_1680" location="f17:271" file="f17" line="271"/>
  </Constructor>
  <Constructor id="_1100" name="_IO_FILE" artificial="1" throw="" context="_121" access="public" mangled="_ZN8_IO_FILEC1Ev *INTERNAL* " demangled="_IO_FILE::_IO_FILE()" location="f17:271" file="f17" line="271" inline="1"/>
  <Destructor id="_1101" name="SDKExtension" artificial="1" throw="" context="_123" access="public" mangled="_ZN12SDKExtensionD1Ev *INTERNAL* " demangled="SDKExtension::~SDKExtension()" location="f13:114" file="f13" line="114" endline="114" inline="1">
  </Destructor>
  <OperatorMethod id="_1102" name="=" returns="_1681" artificial="1" throw="" context="_123" access="public" mangled="_ZN12SDKExtensionaSERKS_" demangled="SDKExtension::operator=(SDKExtension const&amp;)" location="f13:114" file="f13" line="114" endline="114" inline="1">
    <Argument type="_1682" location="f13:114" file="f13" line="114"/>
  </OperatorMethod>
  <Constructor id="_1103" name="SDKExtension" artificial="1" throw="" context="_123" access="public" mangled="_ZN12SDKExtensionC1ERKS_ *INTERNAL* " demangled="SDKExtension::SDKExtension(SDKExtension const&amp;)" location="f13:114" file="f13" line="114" endline="114" inline="1">
    <Argument type="_1682" location="f13:114" file="f13" line="114"/>
  </Constructor>
  <Constructor id="_1104" name="SDKExtension" explicit="1" context="_123" access="public" mangled="_ZN12SDKExtensionC1Ev *INTERNAL* " demangled="SDKExtension::SDKExtension()" location="f13:117" file="f13" line="117" extern="1"/>
  <Method id="_1105" name="SDK_OnLoad" returns="_1028" virtual="1" overrides="" context="_123" access="public" mangled="_ZN12SDKExtension10SDK_OnLoadEPcjb" demangled="SDKExtension::SDK_OnLoad(char*, unsigned int, bool)" location="f13:127" file="f13" line="127" extern="1">
    <Argument name="error" type="_82" location="f13:127" file="f13" line="127"/>
    <Argument name="maxlength" type="_656" location="f13:127" file="f13" line="127"/>
    <Argument name="late" type="_1028" location="f13:127" file="f13" line="127"/>
  </Method>
  <Method id="_1106" name="SDK_OnUnload" returns="_80" virtual="1" overrides="" context="_123" access="public" mangled="_ZN12SDKExtension12SDK_OnUnloadEv" demangled="SDKExtension::SDK_OnUnload()" location="f13:132" file="f13" line="132" extern="1"/>
  <Method id="_1107" name="SDK_OnAllLoaded" returns="_80" virtual="1" overrides="" context="_123" access="public" mangled="_ZN12SDKExtension15SDK_OnAllLoadedEv" demangled="SDKExtension::SDK_OnAllLoaded()" location="f13:137" file="f13" line="137" extern="1"/>
  <Method id="_1108" name="SDK_OnPauseChange" returns="_80" virtual="1" overrides="" context="_123" access="public" mangled="_ZN12SDKExtension17SDK_OnPauseChangeEb" demangled="SDKExtension::SDK_OnPauseChange(bool)" location="f13:142" file="f13" line="142" extern="1">
    <Argument name="paused" type="_1028" location="f13:142" file="f13" line="142"/>
  </Method>
  <Method id="_1109" name="OnExtensionLoad" returns="_1028" virtual="1" overrides="_1683 " context="_123" access="public" mangled="_ZN12SDKExtension15OnExtensionLoadEPN9SourceMod10IExtensionEPNS0_9IShareSysEPcjb" demangled="SDKExtension::OnExtensionLoad(SourceMod::IExtension*, SourceMod::IShareSys*, char*, unsigned int, bool)" location="f13:178" file="f13" line="178" extern="1">
    <Argument name="me" type="_1556" location="f13:178" file="f13" line="178"/>
    <Argument name="sys" type="_1472" location="f13:178" file="f13" line="178"/>
    <Argument name="error" type="_82" location="f13:178" file="f13" line="178"/>
    <Argument name="maxlength" type="_656" location="f13:178" file="f13" line="178"/>
    <Argument name="late" type="_1028" location="f13:178" file="f13" line="178"/>
  </Method>
  <Method id="_1110" name="OnExtensionUnload" returns="_80" virtual="1" overrides="_1684 " context="_123" access="public" mangled="_ZN12SDKExtension17OnExtensionUnloadEv" demangled="SDKExtension::OnExtensionUnload()" location="f13:179" file="f13" line="179" extern="1"/>
  <Method id="_1111" name="OnExtensionsAllLoaded" returns="_80" virtual="1" overrides="_1685 " context="_123" access="public" mangled="_ZN12SDKExtension21OnExtensionsAllLoadedEv" demangled="SDKExtension::OnExtensionsAllLoaded()" location="f13:180" file="f13" line="180" extern="1"/>
  <Method id="_1112" name="IsMetamodExtension" returns="_1028" virtual="1" overrides="_1686 " context="_123" access="public" mangled="_ZN12SDKExtension18IsMetamodExtensionEv" demangled="SDKExtension::IsMetamodExtension()" location="f13:183" file="f13" line="183" extern="1"/>
  <Method id="_1113" name="OnExtensionPauseChange" returns="_80" virtual="1" overrides="_1687 " context="_123" access="public" mangled="_ZN12SDKExtension22OnExtensionPauseChangeEb" demangled="SDKExtension::OnExtensionPauseChange(bool)" location="f13:190" file="f13" line="190" extern="1">
    <Argument name="state" type="_1028" location="f13:190" file="f13" line="190"/>
  </Method>
  <Method id="_1114" name="GetExtensionName" returns="_1006" virtual="1" overrides="_1688 " context="_123" access="public" mangled="_ZN12SDKExtension16GetExtensionNameEv" demangled="SDKExtension::GetExtensionName()" location="f13:193" file="f13" line="193" extern="1"/>
  <Method id="_1115" name="GetExtensionURL" returns="_1006" virtual="1" overrides="_1689 " context="_123" access="public" mangled="_ZN12SDKExtension15GetExtensionURLEv" demangled="SDKExtension::GetExtensionURL()" location="f13:195" file="f13" line="195" extern="1"/>
  <Method id="_1116" name="GetExtensionTag" returns="_1006" virtual="1" overrides="_1690 " context="_123" access="public" mangled="_ZN12SDKExtension15GetExtensionTagEv" demangled="SDKExtension::GetExtensionTag()" location="f13:197" file="f13" line="197" extern="1"/>
  <Method id="_1117" name="GetExtensionAuthor" returns="_1006" virtual="1" overrides="_1691 " context="_123" access="public" mangled="_ZN12SDKExtension18GetExtensionAuthorEv" demangled="SDKExtension::GetExtensionAuthor()" location="f13:199" file="f13" line="199" extern="1"/>
  <Method id="_1118" name="GetExtensionVerString" returns="_1006" virtual="1" overrides="_1692 " context="_123" access="public" mangled="_ZN12SDKExtension21GetExtensionVerStringEv" demangled="SDKExtension::GetExtensionVerString()" location="f13:201" file="f13" line="201" extern="1"/>
  <Method id="_1119" name="GetExtensionDescription" returns="_1006" virtual="1" overrides="_1693 " context="_123" access="public" mangled="_ZN12SDKExtension23GetExtensionDescriptionEv" demangled="SDKExtension::GetExtensionDescription()" location="f13:203" file="f13" line="203" extern="1"/>
  <Method id="_1120" name="GetExtensionDateString" returns="_1006" virtual="1" overrides="_1694 " context="_123" access="public" mangled="_ZN12SDKExtension22GetExtensionDateStringEv" demangled="SDKExtension::GetExtensionDateString()" location="f13:205" file="f13" line="205" extern="1"/>
  <Class id="_1121" name="IExtensionInterface" context="_375" abstract="1" mangled="N9SourceMod19IExtensionInterfaceE" demangled="SourceMod::IExtensionInterface" location="f35:142" file="f35" line="142" artificial="1" size="32" align="32" members="_1695 _1696 _1697 _1698 _1699 _1683 _1684 _1685 _1687 _1700 _1701 _1702 _1686 _1688 _1689 _1690 _1691 _1692 _1693 _1694 _1703 " bases=""/>
  <PointerType id="_1122" type="_80c" size="32" align="32"/>
  <PointerType id="_1123" type="_71" size="32" align="32"/>
  <PointerType id="_1124" type="_296" size="32" align="32"/>
  <PointerType id="_1125" type="_16" size="32" align="32"/>
  <PointerType id="_1126" type="_446c" size="32" align="32"/>
  <PointerType id="_1127" type="_1457" size="32" align="32"/>
  <CvQualifiedType id="_1127r" type="_1127" restrict="1"/>
  <PointerType id="_1129" type="_1706" size="32" align="32"/>
  <PointerType id="_1130" type="_1707" size="32" align="32"/>
  <PointerType id="_1131" type="_700" size="32" align="32"/>
  <ArrayType id="_1132" min="0" max="1u" type="_82" size="64" align="32"/>
  <PointerType id="_1133" type="_1273" size="32" align="32"/>
  <PointerType id="_1134" type="_962" size="32" align="32"/>
  <Field id="_1135" name="num_files" type="_399" offset="0" context="_200" access="public" location="f20:167" file="f20" line="167"/>
  <Field id="_1136" name="num_lines" type="_399" offset="32" context="_200" access="public" location="f20:168" file="f20" line="168"/>
  <Field id="_1137" name="num_syms" type="_399" offset="64" context="_200" access="public" location="f20:169" file="f20" line="169"/>
  <Field id="_1138" name="num_arrays" type="_399" offset="96" context="_200" access="public" location="f20:170" file="f20" line="170"/>
  <Destructor id="_1139" name="sp_fdbg_info_s" artificial="1" throw="" context="_200" access="public" mangled="_ZN14sp_fdbg_info_sD1Ev *INTERNAL* " demangled="sp_fdbg_info_s::~sp_fdbg_info_s()" location="f20:166" file="f20" line="166" endline="166" inline="1">
  </Destructor>
  <OperatorMethod id="_1140" name="=" returns="_1708" artificial="1" throw="" context="_200" access="public" mangled="_ZN14sp_fdbg_info_saSERKS_" demangled="sp_fdbg_info_s::operator=(sp_fdbg_info_s const&amp;)" location="f20:166" file="f20" line="166" endline="166" inline="1">
    <Argument type="_1709" location="f20:166" file="f20" line="166"/>
  </OperatorMethod>
  <Constructor id="_1141" name="sp_fdbg_info_s" artificial="1" throw="" context="_200" access="public" mangled="_ZN14sp_fdbg_info_sC1ERKS_ *INTERNAL* " demangled="sp_fdbg_info_s::sp_fdbg_info_s(sp_fdbg_info_s const&amp;)" location="f20:166" file="f20" line="166" endline="166" inline="1">
    <Argument type="_1709" location="f20:166" file="f20" line="166"/>
  </Constructor>
  <Constructor id="_1142" name="sp_fdbg_info_s" artificial="1" throw="" context="_200" access="public" mangled="_ZN14sp_fdbg_info_sC1Ev *INTERNAL* " demangled="sp_fdbg_info_s::sp_fdbg_info_s()" location="f20:166" file="f20" line="166" inline="1"/>
  <Field id="_1143" name="tagid" type="_504" offset="0" context="_202" access="public" location="f20:284" file="f20" line="284"/>
  <Field id="_1144" name="size" type="_399" offset="32" context="_202" access="public" location="f20:285" file="f20" line="285"/>
  <Destructor id="_1145" name="sp_u_fdbg_arraydim_s" artificial="1" throw="" context="_202" access="public" mangled="_ZN20sp_u_fdbg_arraydim_sD1Ev *INTERNAL* " demangled="sp_u_fdbg_arraydim_s::~sp_u_fdbg_arraydim_s()" location="f20:283" file="f20" line="283" endline="283" inline="1">
  </Destructor>
  <OperatorMethod id="_1146" name="=" returns="_1710" artificial="1" throw="" context="_202" access="public" mangled="_ZN20sp_u_fdbg_arraydim_saSERKS_" demangled="sp_u_fdbg_arraydim_s::operator=(sp_u_fdbg_arraydim_s const&amp;)" location="f20:283" file="f20" line="283" endline="283" inline="1">
    <Argument type="_1711" location="f20:283" file="f20" line="283"/>
  </OperatorMethod>
  <Constructor id="_1147" name="sp_u_fdbg_arraydim_s" artificial="1" throw="" context="_202" access="public" mangled="_ZN20sp_u_fdbg_arraydim_sC1ERKS_ *INTERNAL* " demangled="sp_u_fdbg_arraydim_s::sp_u_fdbg_arraydim_s(sp_u_fdbg_arraydim_s const&amp;)" location="f20:283" file="f20" line="283" endline="283" inline="1">
    <Argument type="_1711" location="f20:283" file="f20" line="283"/>
  </Constructor>
  <Constructor id="_1148" name="sp_u_fdbg_arraydim_s" artificial="1" throw="" context="_202" access="public" mangled="_ZN20sp_u_fdbg_arraydim_sC1Ev *INTERNAL* " demangled="sp_u_fdbg_arraydim_s::sp_u_fdbg_arraydim_s()" location="f20:283" file="f20" line="283" inline="1"/>
  <Field id="_1149" name="magic" type="_399" offset="0" context="_207" access="public" location="f20:89" file="f20" line="89"/>
  <Field id="_1150" name="version" type="_758" offset="32" context="_207" access="public" location="f20:90" file="f20" line="90"/>
  <Field id="_1151" name="compression" type="_795" offset="48" context="_207" access="public" location="f20:91" file="f20" line="91"/>
  <Field id="_1152" name="disksize" type="_399" offset="56" context="_207" access="public" location="f20:92" file="f20" line="92"/>
  <Field id="_1153" name="imagesize" type="_399" offset="88" context="_207" access="public" location="f20:93" file="f20" line="93"/>
  <Field id="_1154" name="sections" type="_795" offset="120" context="_207" access="public" location="f20:94" file="f20" line="94"/>
  <Field id="_1155" name="stringtab" type="_399" offset="128" context="_207" access="public" location="f20:95" file="f20" line="95"/>
  <Field id="_1156" name="dataoffs" type="_399" offset="160" context="_207" access="public" location="f20:96" file="f20" line="96"/>
  <Destructor id="_1157" name="sp_file_hdr_s" artificial="1" throw="" context="_207" access="public" mangled="_ZN13sp_file_hdr_sD1Ev *INTERNAL* " demangled="sp_file_hdr_s::~sp_file_hdr_s()" location="f20:88" file="f20" line="88" endline="88" inline="1">
  </Destructor>
  <OperatorMethod id="_1158" name="=" returns="_1712" artificial="1" throw="" context="_207" access="public" mangled="_ZN13sp_file_hdr_saSERKS_" demangled="sp_file_hdr_s::operator=(sp_file_hdr_s const&amp;)" location="f20:88" file="f20" line="88" endline="88" inline="1">
    <Argument type="_1713" location="f20:88" file="f20" line="88"/>
  </OperatorMethod>
  <Constructor id="_1159" name="sp_file_hdr_s" artificial="1" throw="" context="_207" access="public" mangled="_ZN13sp_file_hdr_sC1ERKS_ *INTERNAL* " demangled="sp_file_hdr_s::sp_file_hdr_s(sp_file_hdr_s const&amp;)" location="f20:88" file="f20" line="88" endline="88" inline="1">
    <Argument type="_1713" location="f20:88" file="f20" line="88"/>
  </Constructor>
  <Constructor id="_1160" name="sp_file_hdr_s" artificial="1" throw="" context="_207" access="public" mangled="_ZN13sp_file_hdr_sC1Ev *INTERNAL* " demangled="sp_file_hdr_s::sp_file_hdr_s()" location="f20:88" file="f20" line="88" inline="1"/>
  <Field id="_1161" name="codesize" type="_399" offset="0" context="_213" access="public" location="f20:109" file="f20" line="109"/>
  <Field id="_1162" name="cellsize" type="_795" offset="32" context="_213" access="public" location="f20:110" file="f20" line="110"/>
  <Field id="_1163" name="codeversion" type="_795" offset="40" context="_213" access="public" location="f20:111" file="f20" line="111"/>
  <Field id="_1164" name="flags" type="_758" offset="48" context="_213" access="public" location="f20:112" file="f20" line="112"/>
  <Field id="_1165" name="main" type="_399" offset="64" context="_213" access="public" location="f20:113" file="f20" line="113"/>
  <Field id="_1166" name="code" type="_399" offset="96" context="_213" access="public" location="f20:114" file="f20" line="114"/>
  <Destructor id="_1167" name="sp_file_code_s" artificial="1" throw="" context="_213" access="public" mangled="_ZN14sp_file_code_sD1Ev *INTERNAL* " demangled="sp_file_code_s::~sp_file_code_s()" location="f20:108" file="f20" line="108" endline="108" inline="1">
  </Destructor>
  <OperatorMethod id="_1168" name="=" returns="_1714" artificial="1" throw="" context="_213" access="public" mangled="_ZN14sp_file_code_saSERKS_" demangled="sp_file_code_s::operator=(sp_file_code_s const&amp;)" location="f20:108" file="f20" line="108" endline="108" inline="1">
    <Argument type="_1715" location="f20:108" file="f20" line="108"/>
  </OperatorMethod>
  <Constructor id="_1169" name="sp_file_code_s" artificial="1" throw="" context="_213" access="public" mangled="_ZN14sp_file_code_sC1ERKS_ *INTERNAL* " demangled="sp_file_code_s::sp_file_code_s(sp_file_code_s const&amp;)" location="f20:108" file="f20" line="108" endline="108" inline="1">
    <Argument type="_1715" location="f20:108" file="f20" line="108"/>
  </Constructor>
  <Constructor id="_1170" name="sp_file_code_s" artificial="1" throw="" context="_213" access="public" mangled="_ZN14sp_file_code_sC1Ev *INTERNAL* " demangled="sp_file_code_s::sp_file_code_s()" location="f20:108" file="f20" line="108" inline="1"/>
  <PointerType id="_1171" type="_99c" size="32" align="32"/>
  <PointerType id="_1172" type="_1332" size="32" align="32"/>
  <PointerType id="_1173" type="_1369" size="32" align="32"/>
  <Field id="_1174" name="__locales" type="_1717" offset="0" context="_233" access="public" location="f34:31" file="f34" line="31"/>
  <Field id="_1175" name="__ctype_b" type="_1718" offset="416" context="_233" access="public" location="f34:34" file="f34" line="34"/>
  <Field id="_1176" name="__ctype_tolower" type="_1719" offset="448" context="_233" access="public" location="f34:35" file="f34" line="35"/>
  <Field id="_1177" name="__ctype_toupper" type="_1719" offset="480" context="_233" access="public" location="f34:36" file="f34" line="36"/>
  <Field id="_1178" name="__names" type="_1720" offset="512" context="_233" access="public" location="f34:39" file="f34" line="39"/>
  <Destructor id="_1179" name="__locale_struct" artificial="1" throw="" context="_233" access="public" mangled="_ZN15__locale_structD1Ev *INTERNAL* " demangled="__locale_struct::~__locale_struct()" location="f34:29" file="f34" line="29" endline="29" inline="1">
  </Destructor>
  <OperatorMethod id="_1180" name="=" returns="_1721" artificial="1" throw="" context="_233" access="public" mangled="_ZN15__locale_structaSERKS_" demangled="__locale_struct::operator=(__locale_struct const&amp;)" location="f34:29" file="f34" line="29" endline="29" inline="1">
    <Argument type="_1722" location="f34:29" file="f34" line="29"/>
  </OperatorMethod>
  <Constructor id="_1181" name="__locale_struct" artificial="1" throw="" context="_233" access="public" mangled="_ZN15__locale_structC1ERKS_ *INTERNAL* " demangled="__locale_struct::__locale_struct(__locale_struct const&amp;)" location="f34:29" file="f34" line="29" endline="29" inline="1">
    <Argument type="_1722" location="f34:29" file="f34" line="29"/>
  </Constructor>
  <Constructor id="_1182" name="__locale_struct" artificial="1" throw="" context="_233" access="public" mangled="_ZN15__locale_structC1Ev *INTERNAL* " demangled="__locale_struct::__locale_struct()" location="f34:29" file="f34" line="29" inline="1"/>
  <CvQualifiedType id="_1122r" type="_1122" restrict="1"/>
  <Field id="_1184" name="pfn" type="_394" offset="0" context="_241" access="public" location="f24:154" file="f24" line="154"/>
  <Field id="_1185" name="name" type="_1006" offset="32" context="_241" access="public" location="f24:155" file="f24" line="155"/>
  <Field id="_1186" name="status" type="_399" offset="64" context="_241" access="public" location="f24:156" file="f24" line="156"/>
  <Field id="_1187" name="flags" type="_399" offset="96" context="_241" access="public" location="f24:157" file="f24" line="157"/>
  <Field id="_1188" name="user" type="_296" offset="128" context="_241" access="public" location="f24:158" file="f24" line="158"/>
  <Destructor id="_1189" name="sp_native_s" artificial="1" throw="" context="_241" access="public" mangled="_ZN11sp_native_sD1Ev *INTERNAL* " demangled="sp_native_s::~sp_native_s()" location="f24:153" file="f24" line="153" endline="153" inline="1">
  </Destructor>
  <OperatorMethod id="_1190" name="=" returns="_1723" artificial="1" throw="" context="_241" access="public" mangled="_ZN11sp_native_saSERKS_" demangled="sp_native_s::operator=(sp_native_s const&amp;)" location="f24:153" file="f24" line="153" endline="153" inline="1">
    <Argument type="_1724" location="f24:153" file="f24" line="153"/>
  </OperatorMethod>
  <Constructor id="_1191" name="sp_native_s" artificial="1" throw="" context="_241" access="public" mangled="_ZN11sp_native_sC1ERKS_ *INTERNAL* " demangled="sp_native_s::sp_native_s(sp_native_s const&amp;)" location="f24:153" file="f24" line="153" endline="153" inline="1">
    <Argument type="_1724" location="f24:153" file="f24" line="153"/>
  </Constructor>
  <Constructor id="_1192" name="sp_native_s" artificial="1" throw="" context="_241" access="public" mangled="_ZN11sp_native_sC1Ev *INTERNAL* " demangled="sp_native_s::sp_native_s()" location="f24:153" file="f24" line="153" inline="1"/>
  <PointerType id="_1193" type="_1362" size="32" align="32"/>
  <CvQualifiedType id="_1125r" type="_1125" restrict="1"/>
  <PointerType id="_1195" type="_446" size="32" align="32"/>
  <Field id="_1196" name="tag_id" type="_399" offset="0" context="_259" access="public" location="f20:158" file="f20" line="158"/>
  <Field id="_1197" name="name" type="_399" offset="32" context="_259" access="public" location="f20:159" file="f20" line="159"/>
  <Destructor id="_1198" name="sp_file_tag_s" artificial="1" throw="" context="_259" access="public" mangled="_ZN13sp_file_tag_sD1Ev *INTERNAL* " demangled="sp_file_tag_s::~sp_file_tag_s()" location="f20:157" file="f20" line="157" endline="157" inline="1">
  </Destructor>
  <OperatorMethod id="_1199" name="=" returns="_1725" artificial="1" throw="" context="_259" access="public" mangled="_ZN13sp_file_tag_saSERKS_" demangled="sp_file_tag_s::operator=(sp_file_tag_s const&amp;)" location="f20:157" file="f20" line="157" endline="157" inline="1">
    <Argument type="_1726" location="f20:157" file="f20" line="157"/>
  </OperatorMethod>
  <Constructor id="_1200" name="sp_file_tag_s" artificial="1" throw="" context="_259" access="public" mangled="_ZN13sp_file_tag_sC1ERKS_ *INTERNAL* " demangled="sp_file_tag_s::sp_file_tag_s(sp_file_tag_s const&amp;)" location="f20:157" file="f20" line="157" endline="157" inline="1">
    <Argument type="_1726" location="f20:157" file="f20" line="157"/>
  </Constructor>
  <Constructor id="_1201" name="sp_file_tag_s" artificial="1" throw="" context="_259" access="public" mangled="_ZN13sp_file_tag_sC1Ev *INTERNAL* " demangled="sp_file_tag_s::sp_file_tag_s()" location="f20:157" file="f20" line="157" inline="1"/>
  <CvQualifiedType id="_1171r" type="_1171" restrict="1"/>
  <Field id="_1203" name="__pos" type="_606" offset="0" context="_289" access="public" location="f27:24" file="f27" line="24"/>
  <Field id="_1204" name="__state" type="_454" offset="32" context="_289" access="public" location="f27:25" file="f27" line="25"/>
  <Destructor id="_1205" name="._3" artificial="1" throw="" context="_289" access="public" mangled="_ZN9_G_fpos_tD1Ev *INTERNAL* " demangled="_G_fpos_t::~_G_fpos_t()" location="f27:26" file="f27" line="26" endline="26" inline="1">
  </Destructor>
  <OperatorMethod id="_1206" name="=" returns="_1727" artificial="1" throw="" context="_289" access="public" mangled="_ZN9_G_fpos_taSERKS_" demangled="_G_fpos_t::operator=(_G_fpos_t const&amp;)" location="f27:26" file="f27" line="26" endline="26" inline="1">
    <Argument type="_1728" location="f27:23" file="f27" line="23"/>
  </OperatorMethod>
  <Constructor id="_1207" name="._3" artificial="1" throw="" context="_289" access="public" mangled="_ZN9_G_fpos_tC1ERKS_ *INTERNAL* " demangled="_G_fpos_t::_G_fpos_t(_G_fpos_t const&amp;)" location="f27:26" file="f27" line="26" endline="26" inline="1">
    <Argument type="_1728" location="f27:23" file="f27" line="23"/>
  </Constructor>
  <Constructor id="_1208" name="._3" artificial="1" throw="" context="_289" access="public" mangled="_ZN9_G_fpos_tC1Ev *INTERNAL* " demangled="_G_fpos_t::_G_fpos_t()" location="f27:26" file="f27" line="26" inline="1"/>
  <PointerType id="_1209" type="_16c" size="32" align="32"/>
  <PointerType id="_1210" type="_210" size="32" align="32"/>
  <PointerType id="_1211" type="_1276" size="32" align="32"/>
  <PointerType id="_1212" type="_1318" size="32" align="32"/>
  <PointerType id="_1213" type="_494" size="32" align="32"/>
  <PointerType id="_1214" type="_103" size="32" align="32"/>
  <Field id="_1215" name="address" type="_399" offset="0" context="_318" access="public" location="f20:149" file="f20" line="149"/>
  <Field id="_1216" name="name" type="_399" offset="32" context="_318" access="public" location="f20:150" file="f20" line="150"/>
  <Destructor id="_1217" name="sp_file_pubvars_s" artificial="1" throw="" context="_318" access="public" mangled="_ZN17sp_file_pubvars_sD1Ev *INTERNAL* " demangled="sp_file_pubvars_s::~sp_file_pubvars_s()" location="f20:148" file="f20" line="148" endline="148" inline="1">
  </Destructor>
  <OperatorMethod id="_1218" name="=" returns="_1730" artificial="1" throw="" context="_318" access="public" mangled="_ZN17sp_file_pubvars_saSERKS_" demangled="sp_file_pubvars_s::operator=(sp_file_pubvars_s const&amp;)" location="f20:148" file="f20" line="148" endline="148" inline="1">
    <Argument type="_1731" location="f20:148" file="f20" line="148"/>
  </OperatorMethod>
  <Constructor id="_1219" name="sp_file_pubvars_s" artificial="1" throw="" context="_318" access="public" mangled="_ZN17sp_file_pubvars_sC1ERKS_ *INTERNAL* " demangled="sp_file_pubvars_s::sp_file_pubvars_s(sp_file_pubvars_s const&amp;)" location="f20:148" file="f20" line="148" endline="148" inline="1">
    <Argument type="_1731" location="f20:148" file="f20" line="148"/>
  </Constructor>
  <Constructor id="_1220" name="sp_file_pubvars_s" artificial="1" throw="" context="_318" access="public" mangled="_ZN17sp_file_pubvars_sC1Ev *INTERNAL* " demangled="sp_file_pubvars_s::sp_file_pubvars_s()" location="f20:148" file="f20" line="148" inline="1"/>
  <PointerType id="_1221" type="_1732" size="32" align="32"/>
  <PointerType id="_1222" type="_813" size="32" align="32"/>
  <CvQualifiedType id="_1222r" type="_1222" restrict="1"/>
  <ArrayType id="_1224" min="0" max="" type="_1006" align="32"/>
  <CvQualifiedType id="_1224c" type="_1224" const="1"/>
  <Field id="_1226" name="num_entries" type="_399" offset="0" context="_338" access="public" location="f20:232" file="f20" line="232"/>
  <Destructor id="_1227" name="sp_fdbg_ntvtab_s" artificial="1" throw="" context="_338" access="public" mangled="_ZN16sp_fdbg_ntvtab_sD1Ev *INTERNAL* " demangled="sp_fdbg_ntvtab_s::~sp_fdbg_ntvtab_s()" location="f20:231" file="f20" line="231" endline="231" inline="1">
  </Destructor>
  <OperatorMethod id="_1228" name="=" returns="_1733" artificial="1" throw="" context="_338" access="public" mangled="_ZN16sp_fdbg_ntvtab_saSERKS_" demangled="sp_fdbg_ntvtab_s::operator=(sp_fdbg_ntvtab_s const&amp;)" location="f20:231" file="f20" line="231" endline="231" inline="1">
    <Argument type="_1734" location="f20:231" file="f20" line="231"/>
  </OperatorMethod>
  <Constructor id="_1229" name="sp_fdbg_ntvtab_s" artificial="1" throw="" context="_338" access="public" mangled="_ZN16sp_fdbg_ntvtab_sC1ERKS_ *INTERNAL* " demangled="sp_fdbg_ntvtab_s::sp_fdbg_ntvtab_s(sp_fdbg_ntvtab_s const&amp;)" location="f20:231" file="f20" line="231" endline="231" inline="1">
    <Argument type="_1734" location="f20:231" file="f20" line="231"/>
  </Constructor>
  <Constructor id="_1230" name="sp_fdbg_ntvtab_s" artificial="1" throw="" context="_338" access="public" mangled="_ZN16sp_fdbg_ntvtab_sC1Ev *INTERNAL* " demangled="sp_fdbg_ntvtab_s::sp_fdbg_ntvtab_s()" location="f20:231" file="f20" line="231" inline="1"/>
  <PointerType id="_1231" type="_781" size="32" align="32"/>
  <CvQualifiedType id="_1231r" type="_1231" restrict="1"/>
  <Field id="_1233" name="addr" type="_399" offset="0" context="_358" access="public" location="f24:175" file="f24" line="175"/>
  <Field id="_1234" name="name" type="_1006" offset="32" context="_358" access="public" location="f24:176" file="f24" line="176"/>
  <Destructor id="_1235" name="sp_debug_file_s" artificial="1" throw="" context="_358" access="public" mangled="_ZN15sp_debug_file_sD1Ev *INTERNAL* " demangled="sp_debug_file_s::~sp_debug_file_s()" location="f24:174" file="f24" line="174" endline="174" inline="1">
  </Destructor>
  <OperatorMethod id="_1236" name="=" returns="_1735" artificial="1" throw="" context="_358" access="public" mangled="_ZN15sp_debug_file_saSERKS_" demangled="sp_debug_file_s::operator=(sp_debug_file_s const&amp;)" location="f24:174" file="f24" line="174" endline="174" inline="1">
    <Argument type="_1736" location="f24:174" file="f24" line="174"/>
  </OperatorMethod>
  <Constructor id="_1237" name="sp_debug_file_s" artificial="1" throw="" context="_358" access="public" mangled="_ZN15sp_debug_file_sC1ERKS_ *INTERNAL* " demangled="sp_debug_file_s::sp_debug_file_s(sp_debug_file_s const&amp;)" location="f24:174" file="f24" line="174" endline="174" inline="1">
    <Argument type="_1736" location="f24:174" file="f24" line="174"/>
  </Constructor>
  <Constructor id="_1238" name="sp_debug_file_s" artificial="1" throw="" context="_358" access="public" mangled="_ZN15sp_debug_file_sC1Ev *INTERNAL* " demangled="sp_debug_file_s::sp_debug_file_s()" location="f24:174" file="f24" line="174" inline="1"/>
  <Field id="_1239" name="tagid" type="_504" offset="0" context="_361" access="public" location="f20:218" file="f20" line="218"/>
  <Field id="_1240" name="size" type="_399" offset="16" context="_361" access="public" location="f20:219" file="f20" line="219"/>
  <Destructor id="_1241" name="sp_fdbg_arraydim_s" artificial="1" throw="" context="_361" access="public" mangled="_ZN18sp_fdbg_arraydim_sD1Ev *INTERNAL* " demangled="sp_fdbg_arraydim_s::~sp_fdbg_arraydim_s()" location="f20:217" file="f20" line="217" endline="217" inline="1">
  </Destructor>
  <OperatorMethod id="_1242" name="=" returns="_1737" artificial="1" throw="" context="_361" access="public" mangled="_ZN18sp_fdbg_arraydim_saSERKS_" demangled="sp_fdbg_arraydim_s::operator=(sp_fdbg_arraydim_s const&amp;)" location="f20:217" file="f20" line="217" endline="217" inline="1">
    <Argument type="_1738" location="f20:217" file="f20" line="217"/>
  </OperatorMethod>
  <Constructor id="_1243" name="sp_fdbg_arraydim_s" artificial="1" throw="" context="_361" access="public" mangled="_ZN18sp_fdbg_arraydim_sC1ERKS_ *INTERNAL* " demangled="sp_fdbg_arraydim_s::sp_fdbg_arraydim_s(sp_fdbg_arraydim_s const&amp;)" location="f20:217" file="f20" line="217" endline="217" inline="1">
    <Argument type="_1738" location="f20:217" file="f20" line="217"/>
  </Constructor>
  <Constructor id="_1244" name="sp_fdbg_arraydim_s" artificial="1" throw="" context="_361" access="public" mangled="_ZN18sp_fdbg_arraydim_sC1Ev *INTERNAL* " demangled="sp_fdbg_arraydim_s::sp_fdbg_arraydim_s()" location="f20:217" file="f20" line="217" inline="1"/>
  <Field id="_1245" name="__pos" type="_813" offset="0" context="_363" access="public" location="f27:29" file="f27" line="29"/>
  <Field id="_1246" name="__state" type="_454" offset="64" context="_363" access="public" location="f27:30" file="f27" line="30"/>
  <Destructor id="_1247" name="._4" artificial="1" throw="" context="_363" access="public" mangled="_ZN11_G_fpos64_tD1Ev *INTERNAL* " demangled="_G_fpos64_t::~_G_fpos64_t()" location="f27:31" file="f27" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_1248" name="=" returns="_1739" artificial="1" throw="" context="_363" access="public" mangled="_ZN11_G_fpos64_taSERKS_" demangled="_G_fpos64_t::operator=(_G_fpos64_t const&amp;)" location="f27:31" file="f27" line="31" endline="31" inline="1">
    <Argument type="_1740" location="f27:28" file="f27" line="28"/>
  </OperatorMethod>
  <Constructor id="_1249" name="._4" artificial="1" throw="" context="_363" access="public" mangled="_ZN11_G_fpos64_tC1ERKS_ *INTERNAL* " demangled="_G_fpos64_t::_G_fpos64_t(_G_fpos64_t const&amp;)" location="f27:31" file="f27" line="31" endline="31" inline="1">
    <Argument type="_1740" location="f27:28" file="f27" line="28"/>
  </Constructor>
  <Constructor id="_1250" name="._4" artificial="1" throw="" context="_363" access="public" mangled="_ZN11_G_fpos64_tC1Ev *INTERNAL* " demangled="_G_fpos64_t::_G_fpos64_t()" location="f27:31" file="f27" line="31" inline="1"/>
  <PointerType id="_1251" type="_1741" size="32" align="32"/>
  <Typedef id="_1252" name="GAME_FRAME_HOOK" type="_1251" context="_375" location="f50:71" file="f50" line="71"/>
  <Enumeration id="_1253" name="HandleError" context="_375" location="f38:93" file="f38" line="93" artificial="1" size="32" align="32">
    <EnumValue name="HandleError_None" init="0"/>
    <EnumValue name="HandleError_Changed" init="1"/>
    <EnumValue name="HandleError_Type" init="2"/>
    <EnumValue name="HandleError_Freed" init="3"/>
    <EnumValue name="HandleError_Index" init="4"/>
    <EnumValue name="HandleError_Access" init="5"/>
    <EnumValue name="HandleError_Limit" init="6"/>
    <EnumValue name="HandleError_Identity" init="7"/>
    <EnumValue name="HandleError_Owner" init="8"/>
    <EnumValue name="HandleError_Version" init="9"/>
    <EnumValue name="HandleError_Parameter" init="10"/>
    <EnumValue name="HandleError_NoInherit" init="11"/>
  </Enumeration>
  <Class id="_1254" name="ITranslator" context="_375" abstract="1" mangled="N9SourceMod11ITranslatorE" demangled="SourceMod::ITranslator" location="f22:230" file="f22" line="230" artificial="1" size="32" align="32" members="_1742 _1743 _1744 _1745 _1746 _1747 _1748 _1749 _1750 _1751 _1752 _1753 _1754 _1755 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Enumeration id="_1255" name="AccessMode" context="_375" location="f53:147" file="f53" line="147" artificial="1" size="32" align="32">
    <EnumValue name="Access_Real" init="0"/>
    <EnumValue name="Access_Effective" init="1"/>
  </Enumeration>
  <Struct id="_1256" name="HandleAccess" context="_375" mangled="N9SourceMod12HandleAccessE" demangled="SourceMod::HandleAccess" location="f38:158" file="f38" line="158" artificial="1" size="128" align="32" members="_1756 _1757 _1758 _1759 _1760 _1761 " bases=""/>
  <Class id="_1257" name="IPluginIterator" context="_375" abstract="1" mangled="N9SourceMod15IPluginIteratorE" demangled="SourceMod::IPluginIterator" location="f52:223" file="f52" line="223" artificial="1" size="32" align="32" members="_1762 _1763 _1764 _1765 _1766 _1767 _1768 _1769 " bases=""/>
  <Class id="_1258" name="IThreadHandle" context="_375" abstract="1" mangled="N9SourceMod13IThreadHandleE" demangled="SourceMod::IThreadHandle" location="f33:109" file="f33" line="109" artificial="1" size="32" align="32" members="_1770 _1771 _1772 _1773 _1774 _1775 _1776 _1777 _1778 _1779 _1780 _1781 " bases=""/>
  <Struct id="_1259" name="IForwardFilter" context="_375" incomplete="1" mangled="N9SourceMod14IForwardFilterE" demangled="SourceMod::IForwardFilter" location="f26:86" file="f26" line="86" artificial="1" align="8"/>
  <Enumeration id="_1260" name="ResultType" context="_375" location="f26:65" file="f26" line="65" artificial="1" size="32" align="32">
    <EnumValue name="Pl_Continue" init="0"/>
    <EnumValue name="Pl_Changed" init="1"/>
    <EnumValue name="Pl_Handled" init="3"/>
    <EnumValue name="Pl_Stop" init="4"/>
  </Enumeration>
  <Class id="_1261" name="IClientListener" context="_375" mangled="N9SourceMod15IClientListenerE" demangled="SourceMod::IClientListener" location="f25:245" file="f25" line="245" artificial="1" size="32" align="32" members="_1782 _1783 _1784 _1785 _1786 _1787 _1788 _1789 _1790 _1791 _1792 _1793 _1794 _1795 _1796 _1797 " bases=""/>
  <Class id="_1262" name="IHandleTypeDispatch" context="_375" abstract="1" mangled="N9SourceMod19IHandleTypeDispatchE" demangled="SourceMod::IHandleTypeDispatch" location="f38:188" file="f38" line="188" artificial="1" size="32" align="32" members="_1798 _1799 _1800 _1801 _1802 _1803 _1804 " bases=""/>
  <Class id="_1263" name="IPlayerManager" context="_375" abstract="1" mangled="N9SourceMod14IPlayerManagerE" demangled="SourceMod::IPlayerManager" location="f25:432" file="f25" line="432" artificial="1" size="32" align="32" members="_1805 _1806 _1807 _1808 _1809 _1810 _1811 _1812 _1813 _1814 _1815 _1816 _1817 _1818 _1819 _1820 _1821 _1822 _1823 _1824 _1825 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Class id="_1264" name="ITextParsers" context="_375" abstract="1" mangled="N9SourceMod12ITextParsersE" demangled="SourceMod::ITextParsers" location="f16:319" file="f16" line="319" artificial="1" size="32" align="32" members="_1826 _1827 _1828 _1829 _1830 _1831 _1832 _1833 _1834 _1835 _1836 _1837 _1838 _1839 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Struct id="_1265" name="Translation" context="_375" mangled="N9SourceMod11TranslationE" demangled="SourceMod::Translation" location="f22:79" file="f22" line="79" artificial="1" size="96" align="32" members="_1840 _1841 _1842 _1843 _1844 _1845 _1846 " bases=""/>
  <Struct id="_1266" name="IdentityToken_t" context="_375" incomplete="1" mangled="N9SourceMod15IdentityToken_tE" demangled="SourceMod::IdentityToken_t" location="f42:46" file="f42" line="46" artificial="1" align="8"/>
  <Class id="_1267" name="IMapTimer" context="_375" abstract="1" mangled="N9SourceMod9IMapTimerE" demangled="SourceMod::IMapTimer" location="f46:55" file="f46" line="55" artificial="1" size="32" align="32" members="_1847 _1848 _1849 _1850 _1851 _1852 _1853 " bases=""/>
  <Enumeration id="_1268" name="ExecType" context="_375" location="f26:76" file="f26" line="76" artificial="1" size="32" align="32">
    <EnumValue name="ET_Ignore" init="0"/>
    <EnumValue name="ET_Single" init="1"/>
    <EnumValue name="ET_Event" init="2"/>
    <EnumValue name="ET_Hook" init="3"/>
    <EnumValue name="ET_LowEvent" init="4"/>
  </Enumeration>
  <Class id="_1269" name="IPhraseCollection" context="_375" abstract="1" mangled="N9SourceMod17IPhraseCollectionE" demangled="SourceMod::IPhraseCollection" location="f22:122" file="f22" line="122" artificial="1" size="32" align="32" members="_1854 _1855 _1856 _1857 _1858 _1859 _1860 _1861 _1862 _1863 " bases=""/>
  <Typedef id="_1270" name="Handle_t" type="_92" context="_375" location="f38:74" file="f38" line="74"/>
  <Enumeration id="_1271" name="MenuOption" context="_375" location="f28:188" file="f28" line="188" artificial="1" size="32" align="32">
    <EnumValue name="MenuOption_IntroMessage" init="0"/>
    <EnumValue name="MenuOption_IntroColor" init="1"/>
    <EnumValue name="MenuOption_Priority" init="2"/>
  </Enumeration>
  <Class id="_1272" name="IShareSys" context="_375" abstract="1" mangled="N9SourceMod9IShareSysE" demangled="SourceMod::IShareSys" location="f42:127" file="f42" line="127" artificial="1" size="32" align="32" members="_1864 _1865 _1866 _1867 _1868 _1869 _1870 _1871 _1872 _1873 _1874 _1875 _1876 _1877 _1878 _1879 _1880 " bases=""/>
  <Class id="_1273" name="IHandleSys" context="_375" abstract="1" mangled="N9SourceMod10IHandleSysE" demangled="SourceMod::IHandleSys" location="f38:223" file="f38" line="223" artificial="1" size="32" align="32" members="_1881 _1882 _1883 _1884 _1885 _1886 _1887 _1888 _1889 _1890 _1891 _1892 _1893 _1894 _1895 _1896 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Enumeration id="_1274" name="PrioQueueLevel" context="_375" location="f15:703" file="f15" line="703" artificial="1" size="32" align="32">
    <EnumValue name="PrioQueue_High" init="0"/>
    <EnumValue name="PrioQueue_Normal" init="1"/>
    <EnumValue name="PrioQueue_Low" init="2"/>
  </Enumeration>
  <Class id="_1275" name="IPlugin" context="_375" abstract="1" mangled="N9SourceMod7IPluginE" demangled="SourceMod::IPlugin" location="f52:102" file="f52" line="102" artificial="1" size="32" align="32" members="_1897 _1898 _1899 _1900 _1901 _1902 _1903 _1904 _1905 _1906 _1907 _1908 _1909 _1910 _1911 _1912 _1913 _1914 _1915 _1916 " bases=""/>
  <Class id="_1276" name="IAdminSystem" context="_375" abstract="1" mangled="N9SourceMod12IAdminSystemE" demangled="SourceMod::IAdminSystem" location="f53:221" file="f53" line="221" artificial="1" size="32" align="32" members="_1917 _1918 _1919 _1920 _1921 _1922 _1923 _1924 _1925 _1926 _1927 _1928 _1929 _1930 _1931 _1932 _1933 _1934 _1935 _1936 _1937 _1938 _1939 _1940 _1941 _1942 _1943 _1944 _1945 _1946 _1947 _1948 _1949 _1950 _1951 _1952 _1953 _1954 _1955 _1956 _1957 _1958 _1959 _1960 _1961 _1962 _1963 _1964 _1965 _1966 _1967 _1968 _1969 _1970 _1971 _1972 _1973 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Enumeration id="_1277" name="SMCError" context="_375" location="f16:208" file="f16" line="208" artificial="1" size="32" align="32">
    <EnumValue name="SMCError_Okay" init="0"/>
    <EnumValue name="SMCError_StreamOpen" init="1"/>
    <EnumValue name="SMCError_StreamError" init="2"/>
    <EnumValue name="SMCError_Custom" init="3"/>
    <EnumValue name="SMCError_InvalidSection1" init="4"/>
    <EnumValue name="SMCError_InvalidSection2" init="5"/>
    <EnumValue name="SMCError_InvalidSection3" init="6"/>
    <EnumValue name="SMCError_InvalidSection4" init="7"/>
    <EnumValue name="SMCError_InvalidSection5" init="8"/>
    <EnumValue name="SMCError_InvalidTokens" init="9"/>
    <EnumValue name="SMCError_TokenOverflow" init="10"/>
    <EnumValue name="SMCError_InvalidProperty1" init="11"/>
  </Enumeration>
  <Struct id="_1278" name="ITimer" context="_375" incomplete="1" mangled="N9SourceMod6ITimerE" demangled="SourceMod::ITimer" location="f46:49" file="f46" line="49" artificial="1" align="8"/>
  <Enumeration id="_1279" name="MenuEndReason" context="_375" location="f28:156" file="f28" line="156" artificial="1" size="32" align="32">
    <EnumValue name="MenuEnd_Selected" init="0"/>
    <EnumValue name="MenuEnd_VotingDone" init="-1"/>
    <EnumValue name="MenuEnd_VotingCancelled" init="-2"/>
    <EnumValue name="MenuEnd_Cancelled" init="-3"/>
    <EnumValue name="MenuEnd_Exit" init="-4"/>
    <EnumValue name="MenuEnd_ExitBack" init="-5"/>
  </Enumeration>
  <Enumeration id="_1280" name="TransError" context="_375" location="f22:66" file="f22" line="66" artificial="1" size="32" align="32">
    <EnumValue name="Trans_Okay" init="0"/>
    <EnumValue name="Trans_BadLanguage" init="1"/>
    <EnumValue name="Trans_BadPhrase" init="2"/>
    <EnumValue name="Trans_BadPhraseLanguage" init="3"/>
    <EnumValue name="Trans_BadPhraseFile" init="4"/>
  </Enumeration>
  <Class id="_1281" name="IDBManager" context="_375" abstract="1" mangled="N9SourceMod10IDBManagerE" demangled="SourceMod::IDBManager" location="f15:775" file="f15" line="775" artificial="1" size="32" align="32" members="_1974 _1975 _1976 _1977 _1978 _1979 _1980 _1981 _1982 _1983 _1984 _1985 _1986 _1987 _1988 _1989 _1990 _1991 _1992 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Struct id="_1282" name="HandleSecurity" context="_375" mangled="N9SourceMod14HandleSecurityE" demangled="SourceMod::HandleSecurity" location="f38:172" file="f38" line="172" artificial="1" size="64" align="32" members="_1993 _1994 _1995 _1996 _1997 _1998 _1999 " bases=""/>
  <Class id="_1283" name="IMenuStyle" context="_375" abstract="1" mangled="N9SourceMod10IMenuStyleE" demangled="SourceMod::IMenuStyle" location="f28:343" file="f28" line="343" artificial="1" size="32" align="32" members="_2000 _2001 _2002 _2003 _2004 _2005 _2006 _2007 _2008 _2009 _2010 _2011 _2012 " bases=""/>
  <Class id="_1284" name="IForwardManager" context="_375" abstract="1" mangled="N9SourceMod15IForwardManagerE" demangled="SourceMod::IForwardManager" location="f26:228" file="f26" line="228" artificial="1" size="32" align="32" members="_2013 _2014 _2015 _2016 _2017 _2018 _2019 _2020 _2021 _2022 _2023 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Class id="_1285" name="ILibrary" context="_375" abstract="1" mangled="N9SourceMod8ILibraryE" demangled="SourceMod::ILibrary" location="f39:56" file="f39" line="56" artificial="1" size="32" align="32" members="_2024 _2025 _2026 _2027 _2028 _2029 " bases=""/>
  <Enumeration id="_1286" name="VoteCancelReason" context="_375" location="f28:169" file="f28" line="169" artificial="1" size="32" align="32">
    <EnumValue name="VoteCancel_Generic" init="-1"/>
    <EnumValue name="VoteCancel_NoVotes" init="-2"/>
  </Enumeration>
  <Enumeration id="_1287" name="OverrideType" context="_375" location="f53:120" file="f53" line="120" artificial="1" size="32" align="32">
    <EnumValue name="Override_Command" init="1"/>
    <EnumValue name="Override_CommandGroup" init="2"/>
  </Enumeration>
  <Enumeration id="_1288" name="AdminFlag" context="_375" location="f53:68" file="f53" line="68" artificial="1" size="32" align="32">
    <EnumValue name="Admin_Reservation" init="0"/>
    <EnumValue name="Admin_Generic" init="1"/>
    <EnumValue name="Admin_Kick" init="2"/>
    <EnumValue name="Admin_Ban" init="3"/>
    <EnumValue name="Admin_Unban" init="4"/>
    <EnumValue name="Admin_Slay" init="5"/>
    <EnumValue name="Admin_Changemap" init="6"/>
    <EnumValue name="Admin_Convars" init="7"/>
    <EnumValue name="Admin_Config" init="8"/>
    <EnumValue name="Admin_Chat" init="9"/>
    <EnumValue name="Admin_Vote" init="10"/>
    <EnumValue name="Admin_Password" init="11"/>
    <EnumValue name="Admin_RCON" init="12"/>
    <EnumValue name="Admin_Cheats" init="13"/>
    <EnumValue name="Admin_Root" init="14"/>
    <EnumValue name="Admin_Custom1" init="15"/>
    <EnumValue name="Admin_Custom2" init="16"/>
    <EnumValue name="Admin_Custom3" init="17"/>
    <EnumValue name="Admin_Custom4" init="18"/>
    <EnumValue name="Admin_Custom5" init="19"/>
    <EnumValue name="Admin_Custom6" init="20"/>
    <EnumValue name="AdminFlags_TOTAL" init="21"/>
  </Enumeration>
  <Class id="_1289" name="IBaseMenu" context="_375" abstract="1" mangled="N9SourceMod9IBaseMenuE" demangled="SourceMod::IBaseMenu" location="f28:432" file="f28" line="432" artificial="1" size="32" align="32" members="_2030 _2031 _2032 _2033 _2034 _2035 _2036 _2037 _2038 _2039 _2040 _2041 _2042 _2043 _2044 _2045 _2046 _2047 _2048 _2049 _2050 _2051 _2052 _2053 _2054 _2055 " bases=""/>
  <Struct id="_1290" name="TypeAccess" context="_375" mangled="N9SourceMod10TypeAccessE" demangled="SourceMod::TypeAccess" location="f38:143" file="f38" line="143" artificial="1" size="96" align="32" members="_2056 _2057 _2058 _2059 _2060 _2061 _2062 " bases=""/>
  <Struct id="_1291" name="DatabaseInfo" context="_375" mangled="N9SourceMod12DatabaseInfoE" demangled="SourceMod::DatabaseInfo" location="f15:609" file="f15" line="609" artificial="1" size="256" align="32" members="_2063 _2064 _2065 _2066 _2067 _2068 _2069 _2070 _2071 _2072 _2073 _2074 " bases=""/>
  <Enumeration id="_1292" name="SMCResult" context="_375" location="f16:198" file="f16" line="198" artificial="1" size="32" align="32">
    <EnumValue name="SMCResult_Continue" init="0"/>
    <EnumValue name="SMCResult_Halt" init="1"/>
    <EnumValue name="SMCResult_HaltFail" init="2"/>
  </Enumeration>
  <Class id="_1293" name="IDirectory" context="_375" abstract="1" mangled="N9SourceMod10IDirectoryE" demangled="SourceMod::IDirectory" location="f39:81" file="f39" line="81" artificial="1" size="32" align="32" members="_2075 _2076 _2077 _2078 _2079 _2080 _2081 _2082 _2083 _2084 " bases=""/>
  <Enumeration id="_1294" name="ThreadState" context="_375" location="f33:81" file="f33" line="81" artificial="1" size="32" align="32">
    <EnumValue name="Thread_Running" init="0"/>
    <EnumValue name="Thread_Paused" init="1"/>
    <EnumValue name="Thread_Done" init="2"/>
  </Enumeration>
  <Class id="_1295" name="IDatabase" context="_375" abstract="1" mangled="N9SourceMod9IDatabaseE" demangled="SourceMod::IDatabase" location="f15:426" file="f15" line="426" artificial="1" size="32" align="32" members="_2085 _2086 _2087 _2088 _2089 _2090 _2091 _2092 _2093 _2094 _2095 _2096 _2097 _2098 _2099 _2100 _2101 _2102 _2103 _2104 " bases=""/>
  <Class id="_1296" name="IDBThreadOperation" context="_375" abstract="1" mangled="N9SourceMod18IDBThreadOperationE" demangled="SourceMod::IDBThreadOperation" location="f15:714" file="f15" line="714" artificial="1" size="32" align="32" members="_2105 _2106 _2107 _2108 _2109 _2110 _2111 _2112 _2113 _2114 " bases=""/>
  <Enumeration id="_1297" name="ParamType" context="_375" location="f26:212" file="f26" line="212" artificial="1" size="32" align="32">
    <EnumValue name="Param_Any" init="0"/>
    <EnumValue name="Param_Cell" init="2"/>
    <EnumValue name="Param_Float" init="4"/>
    <EnumValue name="Param_String" init="7"/>
    <EnumValue name="Param_Array" init="9"/>
    <EnumValue name="Param_VarArgs" init="10"/>
    <EnumValue name="Param_CellByRef" init="3"/>
    <EnumValue name="Param_FloatByRef" init="5"/>
  </Enumeration>
  <Enumeration id="_1298" name="MenuSource" context="_375" location="f28:202" file="f28" line="202" artificial="1" size="32" align="32">
    <EnumValue name="MenuSource_None" init="0"/>
    <EnumValue name="MenuSource_External" init="1"/>
    <EnumValue name="MenuSource_BaseMenu" init="2"/>
    <EnumValue name="MenuSource_Display" init="3"/>
  </Enumeration>
  <Class id="_1299" name="IMenuHandler" context="_375" mangled="N9SourceMod12IMenuHandlerE" demangled="SourceMod::IMenuHandler" location="f28:630" file="f28" line="630" artificial="1" size="32" align="32" members="_2115 _2116 _2117 _2118 _2119 _2120 _2121 _2122 _2123 _2124 _2125 _2126 _2127 _2128 _2129 _2130 _2131 _2132 " bases=""/>
  <Enumeration id="_1300" name="MenuCancelReason" context="_375" location="f28:143" file="f28" line="143" artificial="1" size="32" align="32">
    <EnumValue name="MenuCancel_Disconnected" init="-1"/>
    <EnumValue name="MenuCancel_Interrupted" init="-2"/>
    <EnumValue name="MenuCancel_Exit" init="-3"/>
    <EnumValue name="MenuCancel_NoDisplay" init="-4"/>
    <EnumValue name="MenuCancel_Timeout" init="-5"/>
    <EnumValue name="MenuCancel_ExitBack" init="-6"/>
  </Enumeration>
  <Class id="_1301" name="IDBDriver" context="_375" abstract="1" mangled="N9SourceMod9IDBDriverE" demangled="SourceMod::IDBDriver" location="f15:630" file="f15" line="630" artificial="1" size="32" align="32" members="_2133 _2134 _2135 _2136 _2137 _2138 _2139 _2140 _2141 _2142 _2143 _2144 _2145 " bases=""/>
  <Class id="_1302" name="IGameConfig" context="_375" abstract="1" mangled="N9SourceMod11IGameConfigE" demangled="SourceMod::IGameConfig" location="f49:55" file="f49" line="55" artificial="1" size="32" align="32" members="_2146 _2147 _2148 _2149 _2150 _2151 _2152 _2153 _2154 " bases=""/>
  <Enumeration id="_1303" name="PluginType" context="_375" location="f52:88" file="f52" line="88" artificial="1" size="32" align="32">
    <EnumValue name="PluginType_Private" init="0"/>
    <EnumValue name="PluginType_MapUpdated" init="1"/>
    <EnumValue name="PluginType_MapOnly" init="2"/>
    <EnumValue name="PluginType_Global" init="3"/>
  </Enumeration>
  <Class id="_1304" name="IMemoryUtils" context="_375" abstract="1" mangled="N9SourceMod12IMemoryUtilsE" demangled="SourceMod::IMemoryUtils" location="f36:46" file="f36" line="46" artificial="1" size="32" align="32" members="_2155 _2156 _2157 _2158 _2159 _2160 _2161 _2162 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Class id="_1305" name="IPhraseFile" context="_375" abstract="1" mangled="N9SourceMod11IPhraseFileE" demangled="SourceMod::IPhraseFile" location="f22:93" file="f22" line="93" artificial="1" size="32" align="32" members="_2163 _2164 _2165 _2166 _2167 _2168 " bases=""/>
  <Class id="_1306" name="IGamePlayer" context="_375" abstract="1" mangled="N9SourceMod11IGamePlayerE" demangled="SourceMod::IGamePlayer" location="f25:58" file="f25" line="58" artificial="1" size="32" align="32" members="_2169 _2170 _2171 _2172 _2173 _2174 _2175 _2176 _2177 _2178 _2179 _2180 _2181 _2182 _2183 _2184 _2185 _2186 _2187 _2188 _2189 _2190 _2191 _2192 _2193 _2194 " bases=""/>
  <Class id="_1307" name="ITimedEvent" context="_375" abstract="1" mangled="N9SourceMod11ITimedEventE" demangled="SourceMod::ITimedEvent" location="f46:88" file="f46" line="88" artificial="1" size="32" align="32" members="_2195 _2196 _2197 _2198 _2199 _2200 " bases=""/>
  <Enumeration id="_1308" name="OverrideRule" context="_375" location="f53:129" file="f53" line="129" artificial="1" size="32" align="32">
    <EnumValue name="Command_Deny" init="0"/>
    <EnumValue name="Command_Allow" init="1"/>
  </Enumeration>
  <Class id="_1309" name="IDataReader" context="_375" abstract="1" mangled="N9SourceMod11IDataReaderE" demangled="SourceMod::IDataReader" location="f5:49" file="f5" line="49" artificial="1" size="32" align="32" members="_2201 _2202 _2203 _2204 _2205 _2206 _2207 _2208 _2209 _2210 _2211 _2212 _2213 " bases=""/>
  <Class id="_1310" name="IADTFactory" context="_375" abstract="1" mangled="N9SourceMod11IADTFactoryE" demangled="SourceMod::IADTFactory" location="f31:102" file="f31" line="102" artificial="1" size="32" align="32" members="_2214 _2215 _2216 _2217 _2218 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Class id="_1311" name="IExtension" context="_375" abstract="1" mangled="N9SourceMod10IExtensionE" demangled="SourceMod::IExtension" location="f35:54" file="f35" line="54" artificial="1" size="32" align="32" members="_2219 _2220 _2221 _2222 _2223 _2224 _2225 _2226 _2227 _2228 _2229 _2230 _2231 " bases=""/>
  <Class id="_1312" name="IRootConsole" context="_375" abstract="1" mangled="N9SourceMod12IRootConsoleE" demangled="SourceMod::IRootConsole" location="f29:98" file="f29" line="98" artificial="1" size="32" align="32" members="_2232 _2233 _2234 _2235 _2236 _2237 _2238 _2239 _2240 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Struct id="_1313" name="sm_plugininfo_s" context="_375" mangled="N9SourceMod15sm_plugininfo_sE" demangled="SourceMod::sm_plugininfo_s" location="f52:58" file="f52" line="58" artificial="1" size="160" align="32" members="_2241 _2242 _2243 _2244 _2245 _2246 _2247 _2248 _2249 " bases=""/>
  <Typedef id="_1314" name="sm_plugininfo_t" type="_1313" context="_375" location="f52:64" file="f52" line="64"/>
  <Class id="_1315" name="IRootConsoleCommand" context="_375" mangled="N9SourceMod19IRootConsoleCommandE" demangled="SourceMod::IRootConsoleCommand" location="f29:83" file="f29" line="83" artificial="1" size="32" align="32" members="_2250 _2251 _2252 _2253 _2254 _2255 " bases=""/>
  <Enumeration id="_1316" name="ThreadPriority" context="_375" location="f33:69" file="f33" line="69" artificial="1" size="32" align="32">
    <EnumValue name="ThreadPrio_Minimum" init="-8"/>
    <EnumValue name="ThreadPrio_Low" init="-3"/>
    <EnumValue name="ThreadPrio_Normal" init="0"/>
    <EnumValue name="ThreadPrio_High" init="3"/>
    <EnumValue name="ThreadPrio_Maximum" init="8"/>
  </Enumeration>
  <Struct id="_1317" name="ItemDrawInfo" context="_375" mangled="N9SourceMod12ItemDrawInfoE" demangled="SourceMod::ItemDrawInfo" location="f28:109" file="f28" line="109" artificial="1" size="64" align="32" members="_2256 _2257 _2258 _2259 _2260 _2261 " bases=""/>
  <Class id="_1318" name="ISourceMod" context="_375" abstract="1" mangled="N9SourceMod10ISourceModE" demangled="SourceMod::ISourceMod" location="f50:84" file="f50" line="84" artificial="1" size="32" align="32" members="_2262 _2263 _2264 _2265 _2266 _2267 _2268 _2269 _2270 _2271 _2272 _2273 _2274 _2275 _2276 _2277 _2278 _2279 _2280 _2281 _2282 _2283 _2284 _2285 _2286 _2287 _2288 _2289 _2290 _2291 _2292 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Enumeration id="_1319" name="AdminCachePart" context="_375" location="f53:176" file="f53" line="176" artificial="1" size="32" align="32">
    <EnumValue name="AdminCache_Overrides" init="0"/>
    <EnumValue name="AdminCache_Groups" init="1"/>
    <EnumValue name="AdminCache_Admins" init="2"/>
  </Enumeration>
  <Class id="_1320" name="ILibrarySys" context="_375" abstract="1" mangled="N9SourceMod11ILibrarySysE" demangled="SourceMod::ILibrarySys" location="f39:124" file="f39" line="124" artificial="1" size="32" align="32" members="_2293 _2294 _2295 _2296 _2297 _2298 _2299 _2300 _2301 _2302 _2303 _2304 _2305 _2306 _2307 _2308 _2309 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Class id="_1321" name="IQuery" context="_375" abstract="1" mangled="N9SourceMod6IQueryE" demangled="SourceMod::IQuery" location="f15:287" file="f15" line="287" artificial="1" size="32" align="32" members="_2310 _2311 _2312 _2313 _2314 _2315 _2316 " bases=""/>
  <Class id="_1322" name="IResultSet" context="_375" abstract="1" mangled="N9SourceMod10IResultSetE" demangled="SourceMod::IResultSet" location="f15:196" file="f15" line="196" artificial="1" size="32" align="32" members="_2317 _2318 _2319 _2320 _2321 _2322 _2323 _2324 _2325 _2326 _2327 _2328 _2329 _2330 " bases=""/>
  <Typedef id="_1323" name="FlagBits" type="_92" context="_375" location="f53:215" file="f53" line="215"/>
  <Enumeration id="_1324" name="HTypeAccessRight" context="_375" location="f38:112" file="f38" line="112" artificial="1" size="32" align="32">
    <EnumValue name="HTypeAccess_Create" init="0"/>
    <EnumValue name="HTypeAccess_Inherit" init="1"/>
    <EnumValue name="HTypeAccess_TOTAL" init="2"/>
  </Enumeration>
  <Enumeration id="_1325" name="WorkerState" context="_375" location="f33:301" file="f33" line="301" artificial="1" size="32" align="32">
    <EnumValue name="Worker_Invalid" init="-3"/>
    <EnumValue name="Worker_Stopped" init="-2"/>
    <EnumValue name="Worker_Paused" init="-1"/>
    <EnumValue name="Worker_Running" init="0"/>
  </Enumeration>
  <Class id="_1326" name="ICommandArgs" context="_375" abstract="1" mangled="N9SourceMod12ICommandArgsE" demangled="SourceMod::ICommandArgs" location="f29:54" file="f29" line="54" artificial="1" size="32" align="32" members="_2331 _2332 _2333 _2334 _2335 _2336 _2337 " bases=""/>
  <Class id="_1327" name="IEventSignal" context="_375" abstract="1" mangled="N9SourceMod12IEventSignalE" demangled="SourceMod::IEventSignal" location="f33:277" file="f33" line="277" artificial="1" size="32" align="32" members="_2338 _2339 _2340 _2341 _2342 _2343 _2344 " bases=""/>
  <Class id="_1328" name="IChangeableForward" context="_375" abstract="1" mangled="N9SourceMod18IChangeableForwardE" demangled="SourceMod::IChangeableForward" location="f26:149" file="f26" line="149" artificial="1" size="32" align="32" members="_2345 _2346 _2347 _2348 _2349 _2350 _2351 _2352 _2353 " bases="_1344 ">
    <Base type="_1344" access="public" virtual="0" offset="0"/>
  </Class>
  <Class id="_1329" name="ICommandTargetProcessor" context="_375" abstract="1" mangled="N9SourceMod23ICommandTargetProcessorE" demangled="SourceMod::ICommandTargetProcessor" location="f25:418" file="f25" line="418" artificial="1" size="32" align="32" members="_2354 _2355 _2356 _2357 _2358 " bases=""/>
  <Class id="_1330" name="IThreadCreator" context="_375" abstract="1" mangled="N9SourceMod14IThreadCreatorE" demangled="SourceMod::IThreadCreator" location="f33:201" file="f33" line="201" artificial="1" size="32" align="32" members="_2359 _2360 _2361 _2362 _2363 _2364 _2365 _2366 " bases=""/>
  <Typedef id="_1331" name="GroupId" type="_103" context="_375" location="f53:156" file="f53" line="156"/>
  <Class id="_1332" name="IGameHelpers" context="_375" abstract="1" mangled="N9SourceMod12IGameHelpersE" demangled="SourceMod::IGameHelpers" location="f12:70" file="f12" line="70" artificial="1" size="32" align="32" members="_2367 _2368 _2369 _2370 _2371 _2372 _2373 _2374 _2375 _2376 _2377 _2378 _2379 _2380 _2381 _2382 _2383 _2384 _2385 _2386 _2387 _2388 _2389 _2390 _2391 _2392 _2393 _2394 _2395 _2396 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Typedef id="_1333" name="AdminId" type="_103" context="_375" location="f53:161" file="f53" line="161"/>
  <Struct id="_1334" name="ThreadParams" context="_375" mangled="N9SourceMod12ThreadParamsE" demangled="SourceMod::ThreadParams" location="f33:92" file="f33" line="92" artificial="1" size="64" align="32" members="_2397 _2398 _2399 _2400 _2401 _2402 " bases=""/>
  <Class id="_1335" name="ITextListener_SMC" context="_375" mangled="N9SourceMod17ITextListener_SMCE" demangled="SourceMod::ITextListener_SMC" location="f16:237" file="f16" line="237" artificial="1" size="32" align="32" members="_2403 _2404 _2405 _2406 _2407 _2408 _2409 _2410 _2411 _2412 _2413 " bases=""/>
  <Class id="_1336" name="IPluginManager" context="_375" abstract="1" mangled="N9SourceMod14IPluginManagerE" demangled="SourceMod::IPluginManager" location="f52:300" file="f52" line="300" artificial="1" size="32" align="32" members="_2414 _2415 _2416 _2417 _2418 _2419 _2420 _2421 _2422 _2423 _2424 _2425 _2426 _2427 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Class id="_1337" name="IMenuPanel" context="_375" abstract="1" mangled="N9SourceMod10IMenuPanelE" demangled="SourceMod::IMenuPanel" location="f28:216" file="f28" line="216" artificial="1" size="32" align="32" members="_2428 _2429 _2430 _2431 _2432 _2433 _2434 _2435 _2436 _2437 _2438 _2439 _2440 _2441 _2442 _2443 _2444 _2445 " bases=""/>
  <Class id="_1338" name="IThread" context="_375" abstract="1" mangled="N9SourceMod7IThreadE" demangled="SourceMod::IThread" location="f33:175" file="f33" line="175" artificial="1" size="32" align="32" members="_2446 _2447 _2448 _2449 _2450 _2451 " bases=""/>
  <Enumeration id="_1339" name="DBHandleType" context="_375" location="f15:765" file="f15" line="765" artificial="1" size="32" align="32">
    <EnumValue name="DBHandle_Driver" init="0"/>
    <EnumValue name="DBHandle_Database" init="1"/>
  </Enumeration>
  <Enumeration id="_1340" name="PluginStatus" context="_375" location="f52:70" file="f52" line="70" artificial="1" size="32" align="32">
    <EnumValue name="Plugin_Running" init="0"/>
    <EnumValue name="Plugin_Paused" init="1"/>
    <EnumValue name="Plugin_Error" init="2"/>
    <EnumValue name="Plugin_Loaded" init="3"/>
    <EnumValue name="Plugin_Failed" init="4"/>
    <EnumValue name="Plugin_Created" init="5"/>
    <EnumValue name="Plugin_Uncompiled" init="6"/>
    <EnumValue name="Plugin_BadLoad" init="7"/>
  </Enumeration>
  <Struct id="_1341" name="cmd_target_info_t" context="_375" mangled="N9SourceMod17cmd_target_info_tE" demangled="SourceMod::cmd_target_info_t" location="f25:401" file="f25" line="401" artificial="1" size="320" align="32" members="_2452 _2453 _2454 _2455 _2456 _2457 _2458 _2459 _2460 _2461 _2462 _2463 _2464 _2465 " bases=""/>
  <Struct id="_1342" name="menu_states_t" context="_375" mangled="N9SourceMod13menu_states_tE" demangled="SourceMod::menu_states_t" location="f28:87" file="f28" line="87" artificial="1" size="896" align="32" members="_2466 _2467 _2468 _2469 _2470 _2471 _2472 _2473 _2474 _2475 _2476 " bases=""/>
  <Class id="_1343" name="ITextListener_INI" context="_375" mangled="N9SourceMod17ITextListener_INIE" demangled="SourceMod::ITextListener_INI" location="f16:91" file="f16" line="91" artificial="1" size="32" align="32" members="_2477 _2478 _2479 _2480 _2481 _2482 _2483 _2484 " bases=""/>
  <Class id="_1344" name="IForward" context="_375" abstract="1" mangled="N9SourceMod8IForwardE" demangled="SourceMod::IForward" location="f26:96" file="f26" line="96" artificial="1" size="32" align="32" members="_2485 _2486 _2487 _2488 _2489 _2490 _2491 _2492 _2493 " bases="_1573 ">
    <Base type="_1573" access="public" virtual="0" offset="0"/>
  </Class>
  <Class id="_1345" name="IExtensionManager" context="_375" abstract="1" mangled="N9SourceMod17IExtensionManagerE" demangled="SourceMod::IExtensionManager" location="f35:341" file="f35" line="341" artificial="1" size="32" align="32" members="_2494 _2495 _2496 _2497 _2498 _2499 _2500 _2501 _2502 _2503 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Enumeration id="_1346" name="FileTimeType" context="_375" location="f39:48" file="f39" line="48" artificial="1" size="32" align="32">
    <EnumValue name="FileTime_LastAccess" init="0"/>
    <EnumValue name="FileTime_Created" init="1"/>
    <EnumValue name="FileTime_LastChange" init="2"/>
  </Enumeration>
  <Class id="_1347" name="IThreader" context="_375" abstract="1" mangled="N9SourceMod9IThreaderE" demangled="SourceMod::IThreader" location="f33:396" file="f33" line="396" artificial="1" size="64" align="32" members="_2504 _2505 _2506 _2507 _2508 _2509 _2510 _2511 _2512 _2513 _2514 _2515 " bases="_1364 _1330 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
    <Base type="_1330" access="public" virtual="0" offset="4"/>
  </Class>
  <Typedef id="_1348" name="IdentityType_t" type="_1354" context="_375" location="f42:52" file="f42" line="52"/>
  <Class id="_1349" name="IThreadWorker" context="_375" abstract="1" mangled="N9SourceMod13IThreadWorkerE" demangled="SourceMod::IThreadWorker" location="f33:314" file="f33" line="314" artificial="1" size="32" align="32" members="_2516 _2517 _2518 _2519 _2520 _2521 _2522 _2523 _2524 _2525 " bases="_1330 ">
    <Base type="_1330" access="public" virtual="0" offset="0"/>
  </Class>
  <Enumeration id="_1350" name="HandleAccessRight" context="_375" location="f38:125" file="f38" line="125" artificial="1" size="32" align="32">
    <EnumValue name="HandleAccess_Read" init="0"/>
    <EnumValue name="HandleAccess_Delete" init="1"/>
    <EnumValue name="HandleAccess_Clone" init="2"/>
    <EnumValue name="HandleAccess_TOTAL" init="3"/>
  </Enumeration>
  <Function id="_1351" name="_GetUTF8CharBytes" returns="_92" context="_375" mangled="_ZN9SourceMod17_GetUTF8CharBytesEPKc" demangled="SourceMod::_GetUTF8CharBytes(char const*)" location="f16:429" file="f16" line="429" endline="444" inline="1">
    <Argument name="stream" type="_1006" location="f16:429" file="f16" line="429"/>
  </Function>
  <Class id="_1352" name="IAdminListener" context="_375" abstract="1" mangled="N9SourceMod14IAdminListenerE" demangled="SourceMod::IAdminListener" location="f53:187" file="f53" line="187" artificial="1" size="32" align="32" members="_2526 _2527 _2528 _2529 _2530 _2531 _2532 _2533 " bases=""/>
  <Class id="_1353" name="IPluginsListener" context="_375" mangled="N9SourceMod16IPluginsListenerE" demangled="SourceMod::IPluginsListener" location="f52:256" file="f52" line="256" artificial="1" size="32" align="32" members="_2534 _2535 _2536 _2537 _2538 _2539 _2540 _2541 _2542 " bases=""/>
  <Typedef id="_1354" name="HandleType_t" type="_92" context="_375" location="f38:69" file="f38" line="69"/>
  <Struct id="_1355" name="sm_sendprop_info_t" context="_375" mangled="N9SourceMod18sm_sendprop_info_tE" demangled="SourceMod::sm_sendprop_info_t" location="f12:64" file="f12" line="64" artificial="1" size="64" align="32" members="_2543 _2544 _2545 _2546 _2547 _2548 " bases=""/>
  <Class id="_1356" name="IBasicTrie" context="_375" abstract="1" mangled="N9SourceMod10IBasicTrieE" demangled="SourceMod::IBasicTrie" location="f31:51" file="f31" line="51" artificial="1" size="32" align="32" members="_2549 _2550 _2551 _2552 _2553 _2554 _2555 _2556 _2557 _2558 " bases=""/>
  <Class id="_1357" name="INativeInvoker" context="_375" abstract="1" mangled="N9SourceMod14INativeInvokerE" demangled="SourceMod::INativeInvoker" location="f44:51" file="f44" line="51" artificial="1" size="32" align="32" members="_2559 _2560 _2561 _2562 _2563 _2564 " bases="_1573 ">
    <Base type="_1573" access="public" virtual="0" offset="0"/>
  </Class>
  <PointerType id="_1358" type="_2565" size="32" align="32"/>
  <Typedef id="_1359" name="FRAMEACTION" type="_1358" context="_375" location="f50:78" file="f50" line="78"/>
  <Enumeration id="_1360" name="ImmunityType" context="_375" location="f53:138" file="f53" line="138" artificial="1" size="32" align="32">
    <EnumValue name="Immunity_Default" init="1"/>
    <EnumValue name="Immunity_Global" init="2"/>
  </Enumeration>
  <Class id="_1361" name="IDataPack" context="_375" abstract="1" mangled="N9SourceMod9IDataPackE" demangled="SourceMod::IDataPack" location="f5:122" file="f5" line="122" artificial="1" size="32" align="32" members="_2566 _2567 _2568 _2569 _2570 _2571 _2572 _2573 _2574 " bases="_1309 ">
    <Base type="_1309" access="public" virtual="0" offset="0"/>
  </Class>
  <Class id="_1362" name="IMenuManager" context="_375" abstract="1" mangled="N9SourceMod12IMenuManagerE" demangled="SourceMod::IMenuManager" location="f28:809" file="f28" line="809" artificial="1" size="32" align="32" members="_2575 _2576 _2577 _2578 _2579 _2580 _2581 _2582 _2583 _2584 _2585 _2586 _2587 _2588 _2589 _2590 _2591 _2592 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Enumeration id="_1363" name="DBResult" context="_375" location="f15:52" file="f15" line="52" artificial="1" size="32" align="32">
    <EnumValue name="DBVal_Error" init="0"/>
    <EnumValue name="DBVal_TypeMismatch" init="1"/>
    <EnumValue name="DBVal_Null" init="2"/>
    <EnumValue name="DBVal_Data" init="3"/>
  </Enumeration>
  <Class id="_1364" name="SMInterface" context="_375" abstract="1" mangled="N9SourceMod11SMInterfaceE" demangled="SourceMod::SMInterface" location="f42:93" file="f42" line="93" artificial="1" size="32" align="32" members="_2593 _2594 _2595 _2596 _2597 _2598 _2599 " bases=""/>
  <Enumeration id="_1365" name="FeatureStatus" context="_375" location="f42:66" file="f42" line="66" artificial="1" size="32" align="32">
    <EnumValue name="FeatureStatus_Available" init="0"/>
    <EnumValue name="FeatureStatus_Unavailable" init="1"/>
    <EnumValue name="FeatureStatus_Unknown" init="2"/>
  </Enumeration>
  <Typedef id="_1366" name="ITERATOR" type="_296" context="_375" location="f35:48" file="f35" line="48"/>
  <Class id="_1367" name="ITimerSystem" context="_375" abstract="1" mangled="N9SourceMod12ITimerSystemE" demangled="SourceMod::ITimerSystem" location="f46:112" file="f46" line="112" artificial="1" size="32" align="32" members="_2600 _2601 _2602 _2603 _2604 _2605 _2606 _2607 _2608 _2609 _2610 _2611 _2612 _2613 _2614 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Enumeration id="_1368" name="DBType" context="_375" location="f15:63" file="f15" line="63" artificial="1" size="32" align="32">
    <EnumValue name="DBType_Unknown" init="0"/>
    <EnumValue name="DBType_String" init="1"/>
    <EnumValue name="DBType_Blob" init="2"/>
    <EnumValue name="DBType_Integer" init="3"/>
    <EnumValue name="DBType_Float" init="4"/>
    <EnumValue name="DBType_NULL" init="5"/>
    <EnumValue name="DBTypes_TOTAL" init="6"/>
  </Enumeration>
  <Class id="_1369" name="INativeInterface" context="_375" abstract="1" mangled="N9SourceMod16INativeInterfaceE" demangled="SourceMod::INativeInterface" location="f44:85" file="f44" line="85" artificial="1" size="32" align="32" members="_2615 _2616 _2617 _2618 _2619 _2620 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Struct id="_1370" name="SMCStates" context="_375" mangled="N9SourceMod9SMCStatesE" demangled="SourceMod::SMCStates" location="f16:228" file="f16" line="228" artificial="1" size="64" align="32" members="_2621 _2622 _2623 _2624 _2625 _2626 " bases=""/>
  <Struct id="_1371" name="menu_slots_t" context="_375" mangled="N9SourceMod12menu_slots_tE" demangled="SourceMod::menu_slots_t" location="f28:74" file="f28" line="74" artificial="1" size="64" align="32" members="_2627 _2628 _2629 _2630 _2631 _2632 " bases=""/>
  <Class id="_1372" name="IThreadWorkerCallbacks" context="_375" mangled="N9SourceMod22IThreadWorkerCallbacksE" demangled="SourceMod::IThreadWorkerCallbacks" location="f33:371" file="f33" line="371" artificial="1" size="32" align="32" members="_2633 _2634 _2635 _2636 _2637 _2638 " bases=""/>
  <Enumeration id="_1373" name="ItemSelection" context="_375" location="f28:51" file="f28" line="51" artificial="1" size="32" align="32">
    <EnumValue name="ItemSel_None" init="0"/>
    <EnumValue name="ItemSel_Back" init="1"/>
    <EnumValue name="ItemSel_Next" init="2"/>
    <EnumValue name="ItemSel_Exit" init="3"/>
    <EnumValue name="ItemSel_Item" init="4"/>
    <EnumValue name="ItemSel_ExitBack" init="5"/>
  </Enumeration>
  <Class id="_1374" name="IGameConfigManager" context="_375" abstract="1" mangled="N9SourceMod18IGameConfigManagerE" demangled="SourceMod::IGameConfigManager" location="f49:107" file="f49" line="107" artificial="1" size="32" align="32" members="_2639 _2640 _2641 _2642 _2643 _2644 _2645 _2646 _2647 _2648 _2649 _2650 _2651 " bases="_1364 ">
    <Base type="_1364" access="public" virtual="0" offset="0"/>
  </Class>
  <Enumeration id="_1375" name="ItemOrder" context="_375" location="f28:64" file="f28" line="64" artificial="1" size="32" align="32">
    <EnumValue name="ItemOrder_Ascending" init="0"/>
    <EnumValue name="ItemOrder_Descending" init="1"/>
  </Enumeration>
  <Enumeration id="_1376" name="FeatureType" context="_375" location="f42:57" file="f42" line="57" artificial="1" size="32" align="32">
    <EnumValue name="FeatureType_Native" init="0"/>
    <EnumValue name="FeatureType_Capability" init="1"/>
  </Enumeration>
  <Class id="_1377" name="IMutex" context="_375" abstract="1" mangled="N9SourceMod6IMutexE" demangled="SourceMod::IMutex" location="f33:245" file="f33" line="245" artificial="1" size="32" align="32" members="_2652 _2653 _2654 _2655 _2656 _2657 _2658 _2659 " bases=""/>
  <Class id="_1378" name="IResultRow" context="_375" abstract="1" mangled="N9SourceMod10IResultRowE" demangled="SourceMod::IResultRow" location="f15:86" file="f15" line="86" artificial="1" size="32" align="32" members="_2660 _2661 _2662 _2663 _2664 _2665 _2666 _2667 _2668 _2669 _2670 _2671 " bases=""/>
  <Class id="_1379" name="IPreparedQuery" context="_375" abstract="1" mangled="N9SourceMod14IPreparedQueryE" demangled="SourceMod::IPreparedQuery" location="f15:331" file="f15" line="331" artificial="1" size="32" align="32" members="_2672 _2673 _2674 _2675 _2676 _2677 _2678 _2679 _2680 _2681 _2682 _2683 _2684 " bases="_1321 ">
    <Base type="_1321" access="public" virtual="0" offset="0"/>
  </Class>
  <Enumeration id="_1380" name="PathType" context="_375" location="f50:58" file="f50" line="58" artificial="1" size="32" align="32">
    <EnumValue name="Path_None" init="0"/>
    <EnumValue name="Path_Game" init="1"/>
    <EnumValue name="Path_SM" init="2"/>
    <EnumValue name="Path_SM_Rel" init="3"/>
  </Enumeration>
  <Class id="_1381" name="IFeatureProvider" context="_375" abstract="1" mangled="N9SourceMod16IFeatureProviderE" demangled="SourceMod::IFeatureProvider" location="f42:77" file="f42" line="77" artificial="1" size="32" align="32" members="_2685 _2686 _2687 _2688 _2689 " bases=""/>
  <Struct id="_1382" name="menu_vote_result_t" context="_375" mangled="N9SourceMod18menu_vote_result_tE" demangled="SourceMod::menu_vote_result_t" location="f28:123" file="f28" line="123" artificial="1" size="160" align="32" members="_2690 _2691 _2692 _2693 _2694 _2695 _2696 _2697 _2698 _2699 _2700 " bases=""/>
  <Enumeration id="_1383" name="ThreadFlags" context="_375" location="f33:50" file="f33" line="50" artificial="1" size="32" align="32">
    <EnumValue name="Thread_Default" init="0"/>
    <EnumValue name="Thread_AutoRelease" init="1"/>
    <EnumValue name="Thread_CreateSuspended" init="2"/>
  </Enumeration>
  <PointerType id="_1384" type="_1008" size="32" align="32"/>
  <PointerType id="_1385" type="_1009" size="32" align="32"/>
  <Field id="_1387" name="address" type="_399" offset="0" context="_403" access="public" location="f20:132" file="f20" line="132"/>
  <Field id="_1388" name="name" type="_399" offset="32" context="_403" access="public" location="f20:133" file="f20" line="133"/>
  <Destructor id="_1389" name="sp_file_publics_s" artificial="1" throw="" context="_403" access="public" mangled="_ZN17sp_file_publics_sD1Ev *INTERNAL* " demangled="sp_file_publics_s::~sp_file_publics_s()" location="f20:131" file="f20" line="131" endline="131" inline="1">
  </Destructor>
  <OperatorMethod id="_1390" name="=" returns="_2701" artificial="1" throw="" context="_403" access="public" mangled="_ZN17sp_file_publics_saSERKS_" demangled="sp_file_publics_s::operator=(sp_file_publics_s const&amp;)" location="f20:131" file="f20" line="131" endline="131" inline="1">
    <Argument type="_2702" location="f20:131" file="f20" line="131"/>
  </OperatorMethod>
  <Constructor id="_1391" name="sp_file_publics_s" artificial="1" throw="" context="_403" access="public" mangled="_ZN17sp_file_publics_sC1ERKS_ *INTERNAL* " demangled="sp_file_publics_s::sp_file_publics_s(sp_file_publics_s const&amp;)" location="f20:131" file="f20" line="131" endline="131" inline="1">
    <Argument type="_2702" location="f20:131" file="f20" line="131"/>
  </Constructor>
  <Constructor id="_1392" name="sp_file_publics_s" artificial="1" throw="" context="_403" access="public" mangled="_ZN17sp_file_publics_sC1Ev *INTERNAL* " demangled="sp_file_publics_s::sp_file_publics_s()" location="f20:131" file="f20" line="131" inline="1"/>
  <PointerType id="_1393" type="_1281" size="32" align="32"/>
  <Field id="_1394" name="tv_sec" type="_591" offset="0" context="_446" access="public" location="f0:122" file="f0" line="122"/>
  <Field id="_1395" name="tv_nsec" type="_21" offset="32" context="_446" access="public" location="f0:123" file="f0" line="123"/>
  <Destructor id="_1396" name="timespec" artificial="1" throw="" context="_446" access="public" mangled="_ZN8timespecD1Ev *INTERNAL* " demangled="timespec::~timespec()" location="f0:121" file="f0" line="121" endline="121" inline="1">
  </Destructor>
  <OperatorMethod id="_1397" name="=" returns="_2703" artificial="1" throw="" context="_446" access="public" mangled="_ZN8timespecaSERKS_" demangled="timespec::operator=(timespec const&amp;)" location="f0:121" file="f0" line="121" endline="121" inline="1">
    <Argument type="_2704" location="f0:121" file="f0" line="121"/>
  </OperatorMethod>
  <Constructor id="_1398" name="timespec" artificial="1" throw="" context="_446" access="public" mangled="_ZN8timespecC1ERKS_ *INTERNAL* " demangled="timespec::timespec(timespec const&amp;)" location="f0:121" file="f0" line="121" endline="121" inline="1">
    <Argument type="_2704" location="f0:121" file="f0" line="121"/>
  </Constructor>
  <Constructor id="_1399" name="timespec" artificial="1" throw="" context="_446" access="public" mangled="_ZN8timespecC1Ev *INTERNAL* " demangled="timespec::timespec()" location="f0:121" file="f0" line="121" inline="1"/>
  <Field id="_1400" name="__count" type="_103" offset="0" context="_454" access="public" location="f41:85" file="f41" line="85"/>
  <Field id="_1401" name="__value" type="_1402" offset="32" context="_454" access="public" location="f41:94" file="f41" line="94"/>
  <Union id="_1402" context="_454" access="public" mangled="N11__mbstate_t3._2E" demangled="__mbstate_t::._2" location="f41:87" file="f41" line="87" artificial="1" size="32" align="32" members="_2705 _2706 _2707 _2708 _2709 _2710 " bases=""/>
  <Destructor id="_1403" name="._1" artificial="1" throw="" context="_454" access="public" mangled="_ZN11__mbstate_tD1Ev *INTERNAL* " demangled="__mbstate_t::~__mbstate_t()" location="f41:95" file="f41" line="95" endline="95" inline="1">
  </Destructor>
  <OperatorMethod id="_1404" name="=" returns="_2711" artificial="1" throw="" context="_454" access="public" mangled="_ZN11__mbstate_taSERKS_" demangled="__mbstate_t::operator=(__mbstate_t const&amp;)" location="f41:95" file="f41" line="95" endline="95" inline="1">
    <Argument type="_2712" location="f41:84" file="f41" line="84"/>
  </OperatorMethod>
  <Constructor id="_1405" name="._1" artificial="1" throw="" context="_454" access="public" mangled="_ZN11__mbstate_tC1ERKS_ *INTERNAL* " demangled="__mbstate_t::__mbstate_t(__mbstate_t const&amp;)" location="f41:95" file="f41" line="95" endline="95" inline="1">
    <Argument type="_2712" location="f41:84" file="f41" line="84"/>
  </Constructor>
  <Constructor id="_1406" name="._1" artificial="1" throw="" context="_454" access="public" mangled="_ZN11__mbstate_tC1Ev *INTERNAL* " demangled="__mbstate_t::__mbstate_t()" location="f41:95" file="f41" line="95" inline="1"/>
  <Struct id="_1407" name="__vmi_class_type_info_pseudo2" context="_1" mangled="29__vmi_class_type_info_pseudo2" demangled="__vmi_class_type_info_pseudo2" location="f33:396" file="f33" line="396" size="256" align="32" members="_2713 _2714 _2715 _2716 "/>
  <CvQualifiedType id="_1407c" type="_1407" const="1"/>
  <PointerType id="_1409" type="_1254" size="32" align="32"/>
  <Field id="_1410" name="ident" type="_795" offset="0" context="_487" access="public" location="f20:257" file="f20" line="257"/>
  <Field id="_1411" name="tagid" type="_504" offset="8" context="_487" access="public" location="f20:258" file="f20" line="258"/>
  <Field id="_1412" name="dimcount" type="_758" offset="24" context="_487" access="public" location="f20:259" file="f20" line="259"/>
  <Field id="_1413" name="name" type="_399" offset="40" context="_487" access="public" location="f20:260" file="f20" line="260"/>
  <Destructor id="_1414" name="fp_fdbg_ntvarg_s" artificial="1" throw="" context="_487" access="public" mangled="_ZN16fp_fdbg_ntvarg_sD1Ev *INTERNAL* " demangled="fp_fdbg_ntvarg_s::~fp_fdbg_ntvarg_s()" location="f20:256" file="f20" line="256" endline="256" inline="1">
  </Destructor>
  <OperatorMethod id="_1415" name="=" returns="_2717" artificial="1" throw="" context="_487" access="public" mangled="_ZN16fp_fdbg_ntvarg_saSERKS_" demangled="fp_fdbg_ntvarg_s::operator=(fp_fdbg_ntvarg_s const&amp;)" location="f20:256" file="f20" line="256" endline="256" inline="1">
    <Argument type="_2718" location="f20:256" file="f20" line="256"/>
  </OperatorMethod>
  <Constructor id="_1416" name="fp_fdbg_ntvarg_s" artificial="1" throw="" context="_487" access="public" mangled="_ZN16fp_fdbg_ntvarg_sC1ERKS_ *INTERNAL* " demangled="fp_fdbg_ntvarg_s::fp_fdbg_ntvarg_s(fp_fdbg_ntvarg_s const&amp;)" location="f20:256" file="f20" line="256" endline="256" inline="1">
    <Argument type="_2718" location="f20:256" file="f20" line="256"/>
  </Constructor>
  <Constructor id="_1417" name="fp_fdbg_ntvarg_s" artificial="1" throw="" context="_487" access="public" mangled="_ZN16fp_fdbg_ntvarg_sC1Ev *INTERNAL* " demangled="fp_fdbg_ntvarg_s::fp_fdbg_ntvarg_s()" location="f20:256" file="f20" line="256" inline="1"/>
  <Field id="_1418" name="st_dev" type="_435" offset="0" context="_494" access="public" location="f43:48" file="f43" line="48"/>
  <Field id="_1419" name="__pad1" type="_210" offset="64" context="_494" access="public" location="f43:50" file="f43" line="50"/>
  <Field id="_1420" name="st_ino" type="_373" offset="96" context="_494" access="public" location="f43:53" file="f43" line="53"/>
  <Field id="_1421" name="st_mode" type="_286" offset="128" context="_494" access="public" location="f43:58" file="f43" line="58"/>
  <Field id="_1422" name="st_nlink" type="_367" offset="160" context="_494" access="public" location="f43:59" file="f43" line="59"/>
  <Field id="_1423" name="st_uid" type="_683" offset="192" context="_494" access="public" location="f43:64" file="f43" line="64"/>
  <Field id="_1424" name="st_gid" type="_700" offset="224" context="_494" access="public" location="f43:65" file="f43" line="65"/>
  <Field id="_1425" name="st_rdev" type="_435" offset="256" context="_494" access="public" location="f43:69" file="f43" line="69"/>
  <Field id="_1426" name="__pad2" type="_210" offset="320" context="_494" access="public" location="f43:71" file="f43" line="71"/>
  <Field id="_1427" name="st_size" type="_606" offset="352" context="_494" access="public" location="f43:74" file="f43" line="74"/>
  <Field id="_1428" name="st_blksize" type="_959" offset="384" context="_494" access="public" location="f43:78" file="f43" line="78"/>
  <Field id="_1429" name="st_blocks" type="_551" offset="416" context="_494" access="public" location="f43:80" file="f43" line="80"/>
  <Field id="_1430" name="st_atim" type="_446" offset="448" context="_494" access="public" location="f43:91" file="f43" line="91"/>
  <Field id="_1431" name="st_mtim" type="_446" offset="512" context="_494" access="public" location="f43:92" file="f43" line="92"/>
  <Field id="_1432" name="st_ctim" type="_446" offset="576" context="_494" access="public" location="f43:93" file="f43" line="93"/>
  <Field id="_1433" name="__unused4" type="_372" offset="640" context="_494" access="public" location="f43:109" file="f43" line="109"/>
  <Field id="_1434" name="__unused5" type="_372" offset="672" context="_494" access="public" location="f43:110" file="f43" line="110"/>
  <Destructor id="_1435" name="stat" artificial="1" throw="" context="_494" access="public" mangled="_ZN4statD1Ev *INTERNAL* " demangled="stat::~stat()" location="f43:47" file="f43" line="47" endline="47" inline="1">
  </Destructor>
  <OperatorMethod id="_1436" name="=" returns="_2719" artificial="1" throw="" context="_494" access="public" mangled="_ZN4stataSERKS_" demangled="stat::operator=(stat const&amp;)" location="f43:47" file="f43" line="47" endline="47" inline="1">
    <Argument type="_2720" location="f43:47" file="f43" line="47"/>
  </OperatorMethod>
  <Constructor id="_1437" name="stat" artificial="1" throw="" context="_494" access="public" mangled="_ZN4statC1ERKS_ *INTERNAL* " demangled="stat::stat(stat const&amp;)" location="f43:47" file="f43" line="47" endline="47" inline="1">
    <Argument type="_2720" location="f43:47" file="f43" line="47"/>
  </Constructor>
  <Constructor id="_1438" name="stat" artificial="1" throw="" context="_494" access="public" mangled="_ZN4statC1Ev *INTERNAL* " demangled="stat::stat()" location="f43:47" file="f43" line="47" inline="1"/>
  <CvQualifiedType id="_1209r" type="_1209" restrict="1"/>
  <PointerType id="_1440" type="_781c" size="32" align="32"/>
  <Field id="_1441" name="funcid" type="_257" offset="0" context="_500" access="public" location="f24:128" file="f24" line="128"/>
  <Field id="_1442" name="code_offs" type="_399" offset="32" context="_500" access="public" location="f24:129" file="f24" line="129"/>
  <Field id="_1443" name="name" type="_1006" offset="64" context="_500" access="public" location="f24:130" file="f24" line="130"/>
  <Destructor id="_1444" name="sp_public_s" artificial="1" throw="" context="_500" access="public" mangled="_ZN11sp_public_sD1Ev *INTERNAL* " demangled="sp_public_s::~sp_public_s()" location="f24:127" file="f24" line="127" endline="127" inline="1">
  </Destructor>
  <OperatorMethod id="_1445" name="=" returns="_2722" artificial="1" throw="" context="_500" access="public" mangled="_ZN11sp_public_saSERKS_" demangled="sp_public_s::operator=(sp_public_s const&amp;)" location="f24:127" file="f24" line="127" endline="127" inline="1">
    <Argument type="_2723" location="f24:127" file="f24" line="127"/>
  </OperatorMethod>
  <Constructor id="_1446" name="sp_public_s" artificial="1" throw="" context="_500" access="public" mangled="_ZN11sp_public_sC1ERKS_ *INTERNAL* " demangled="sp_public_s::sp_public_s(sp_public_s const&amp;)" location="f24:127" file="f24" line="127" endline="127" inline="1">
    <Argument type="_2723" location="f24:127" file="f24" line="127"/>
  </Constructor>
  <Constructor id="_1447" name="sp_public_s" artificial="1" throw="" context="_500" access="public" mangled="_ZN11sp_public_sC1Ev *INTERNAL* " demangled="sp_public_s::sp_public_s()" location="f24:127" file="f24" line="127" inline="1"/>
  <Field id="_1448" name="name" type="_1006" offset="0" context="_515" access="public" location="f24:166" file="f24" line="166"/>
  <Field id="_1449" name="func" type="_394" offset="32" context="_515" access="public" location="f24:167" file="f24" line="167"/>
  <Destructor id="_1450" name="sp_nativeinfo_s" artificial="1" throw="" context="_515" access="public" mangled="_ZN15sp_nativeinfo_sD1Ev *INTERNAL* " demangled="sp_nativeinfo_s::~sp_nativeinfo_s()" location="f24:165" file="f24" line="165" endline="165" inline="1">
  </Destructor>
  <OperatorMethod id="_1451" name="=" returns="_2724" artificial="1" throw="" context="_515" access="public" mangled="_ZN15sp_nativeinfo_saSERKS_" demangled="sp_nativeinfo_s::operator=(sp_nativeinfo_s const&amp;)" location="f24:165" file="f24" line="165" endline="165" inline="1">
    <Argument type="_2725" location="f24:165" file="f24" line="165"/>
  </OperatorMethod>
  <Constructor id="_1452" name="sp_nativeinfo_s" artificial="1" throw="" context="_515" access="public" mangled="_ZN15sp_nativeinfo_sC1ERKS_ *INTERNAL* " demangled="sp_nativeinfo_s::sp_nativeinfo_s(sp_nativeinfo_s const&amp;)" location="f24:165" file="f24" line="165" endline="165" inline="1">
    <Argument type="_2725" location="f24:165" file="f24" line="165"/>
  </Constructor>
  <Constructor id="_1453" name="sp_nativeinfo_s" artificial="1" throw="" context="_515" access="public" mangled="_ZN15sp_nativeinfo_sC1Ev *INTERNAL* " demangled="sp_nativeinfo_s::sp_nativeinfo_s()" location="f24:165" file="f24" line="165" inline="1"/>
  <CvQualifiedType id="_1038r" type="_1038" restrict="1"/>
  <CvQualifiedType id="_1064r" type="_1064" restrict="1"/>
  <CvQualifiedType id="_1134r" type="_1134" restrict="1"/>
  <PointerType id="_1457" type="_1134" size="32" align="32"/>
  <CvQualifiedType id="_1457r" type="_1457" restrict="1"/>
  <Field id="_1459" name="addr" type="_742" offset="0" context="_553" access="public" location="f20:203" file="f20" line="203"/>
  <Field id="_1460" name="tagid" type="_504" offset="32" context="_553" access="public" location="f20:204" file="f20" line="204"/>
  <Field id="_1461" name="codestart" type="_399" offset="48" context="_553" access="public" location="f20:205" file="f20" line="205"/>
  <Field id="_1462" name="codeend" type="_399" offset="80" context="_553" access="public" location="f20:206" file="f20" line="206"/>
  <Field id="_1463" name="ident" type="_795" offset="112" context="_553" access="public" location="f20:207" file="f20" line="207"/>
  <Field id="_1464" name="vclass" type="_795" offset="120" context="_553" access="public" location="f20:208" file="f20" line="208"/>
  <Field id="_1465" name="dimcount" type="_758" offset="128" context="_553" access="public" location="f20:209" file="f20" line="209"/>
  <Field id="_1466" name="name" type="_399" offset="144" context="_553" access="public" location="f20:210" file="f20" line="210"/>
  <Destructor id="_1467" name="sp_fdbg_symbol_s" artificial="1" throw="" context="_553" access="public" mangled="_ZN16sp_fdbg_symbol_sD1Ev *INTERNAL* " demangled="sp_fdbg_symbol_s::~sp_fdbg_symbol_s()" location="f20:202" file="f20" line="202" endline="202" inline="1">
  </Destructor>
  <OperatorMethod id="_1468" name="=" returns="_2726" artificial="1" throw="" context="_553" access="public" mangled="_ZN16sp_fdbg_symbol_saSERKS_" demangled="sp_fdbg_symbol_s::operator=(sp_fdbg_symbol_s const&amp;)" location="f20:202" file="f20" line="202" endline="202" inline="1">
    <Argument type="_2727" location="f20:202" file="f20" line="202"/>
  </OperatorMethod>
  <Constructor id="_1469" name="sp_fdbg_symbol_s" artificial="1" throw="" context="_553" access="public" mangled="_ZN16sp_fdbg_symbol_sC1ERKS_ *INTERNAL* " demangled="sp_fdbg_symbol_s::sp_fdbg_symbol_s(sp_fdbg_symbol_s const&amp;)" location="f20:202" file="f20" line="202" endline="202" inline="1">
    <Argument type="_2727" location="f20:202" file="f20" line="202"/>
  </Constructor>
  <Constructor id="_1470" name="sp_fdbg_symbol_s" artificial="1" throw="" context="_553" access="public" mangled="_ZN16sp_fdbg_symbol_sC1Ev *INTERNAL* " demangled="sp_fdbg_symbol_s::sp_fdbg_symbol_s()" location="f20:202" file="f20" line="202" inline="1"/>
  <PointerType id="_1471" type="_126" size="32" align="32"/>
  <PointerType id="_1472" type="_1272" size="32" align="32"/>
  <PointerType id="_1473" type="_364c" size="32" align="32"/>
  <PointerType id="_1474" type="_435" size="32" align="32"/>
  <PointerType id="_1475" type="_1284" size="32" align="32"/>
  <Field id="_1476" name="__val" type="_2729" offset="0" context="_595" access="public" location="f18:144" file="f18" line="144"/>
  <Destructor id="_1477" name="._0" artificial="1" throw="" context="_595" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f18:144" file="f18" line="144" endline="144" inline="1">
  </Destructor>
  <OperatorMethod id="_1478" name="=" returns="_2730" artificial="1" throw="" context="_595" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f18:144" file="f18" line="144" endline="144" inline="1">
    <Argument type="_2731" location="f18:144" file="f18" line="144"/>
  </OperatorMethod>
  <Constructor id="_1479" name="._0" artificial="1" throw="" context="_595" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f18:144" file="f18" line="144" endline="144" inline="1">
    <Argument type="_2731" location="f18:144" file="f18" line="144"/>
  </Constructor>
  <Constructor id="_1480" name="._0" artificial="1" throw="" context="_595" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f18:144" file="f18" line="144" inline="1"/>
  <Field id="_1481" name="index" type="_399" offset="0" context="_607" access="public" location="f20:244" file="f20" line="244"/>
  <Field id="_1482" name="name" type="_399" offset="32" context="_607" access="public" location="f20:245" file="f20" line="245"/>
  <Field id="_1483" name="tagid" type="_504" offset="64" context="_607" access="public" location="f20:246" file="f20" line="246"/>
  <Field id="_1484" name="nargs" type="_758" offset="80" context="_607" access="public" location="f20:247" file="f20" line="247"/>
  <Destructor id="_1485" name="sp_fdbg_native_s" artificial="1" throw="" context="_607" access="public" mangled="_ZN16sp_fdbg_native_sD1Ev *INTERNAL* " demangled="sp_fdbg_native_s::~sp_fdbg_native_s()" location="f20:243" file="f20" line="243" endline="243" inline="1">
  </Destructor>
  <OperatorMethod id="_1486" name="=" returns="_2732" artificial="1" throw="" context="_607" access="public" mangled="_ZN16sp_fdbg_native_saSERKS_" demangled="sp_fdbg_native_s::operator=(sp_fdbg_native_s const&amp;)" location="f20:243" file="f20" line="243" endline="243" inline="1">
    <Argument type="_2733" location="f20:243" file="f20" line="243"/>
  </OperatorMethod>
  <Constructor id="_1487" name="sp_fdbg_native_s" artificial="1" throw="" context="_607" access="public" mangled="_ZN16sp_fdbg_native_sC1ERKS_ *INTERNAL* " demangled="sp_fdbg_native_s::sp_fdbg_native_s(sp_fdbg_native_s const&amp;)" location="f20:243" file="f20" line="243" endline="243" inline="1">
    <Argument type="_2733" location="f20:243" file="f20" line="243"/>
  </Constructor>
  <Constructor id="_1488" name="sp_fdbg_native_s" artificial="1" throw="" context="_607" access="public" mangled="_ZN16sp_fdbg_native_sC1Ev *INTERNAL* " demangled="sp_fdbg_native_s::sp_fdbg_native_s()" location="f20:243" file="f20" line="243" inline="1"/>
  <Field id="_1489" name="_next" type="_1675" offset="0" context="_611" access="public" location="f17:187" file="f17" line="187"/>
  <Field id="_1490" name="_sbuf" type="_1038" offset="32" context="_611" access="public" location="f17:188" file="f17" line="188"/>
  <Field id="_1491" name="_pos" type="_103" offset="64" context="_611" access="public" location="f17:192" file="f17" line="192"/>
  <Destructor id="_1492" name="_IO_marker" artificial="1" throw="" context="_611" access="public" mangled="_ZN10_IO_markerD1Ev *INTERNAL* " demangled="_IO_marker::~_IO_marker()" location="f17:186" file="f17" line="186" endline="186" inline="1">
  </Destructor>
  <OperatorMethod id="_1493" name="=" returns="_2734" artificial="1" throw="" context="_611" access="public" mangled="_ZN10_IO_markeraSERKS_" demangled="_IO_marker::operator=(_IO_marker const&amp;)" location="f17:186" file="f17" line="186" endline="186" inline="1">
    <Argument type="_2735" location="f17:186" file="f17" line="186"/>
  </OperatorMethod>
  <Constructor id="_1494" name="_IO_marker" artificial="1" throw="" context="_611" access="public" mangled="_ZN10_IO_markerC1ERKS_ *INTERNAL* " demangled="_IO_marker::_IO_marker(_IO_marker const&amp;)" location="f17:186" file="f17" line="186" endline="186" inline="1">
    <Argument type="_2735" location="f17:186" file="f17" line="186"/>
  </Constructor>
  <Constructor id="_1495" name="_IO_marker" artificial="1" throw="" context="_611" access="public" mangled="_ZN10_IO_markerC1Ev *INTERNAL* " demangled="_IO_marker::_IO_marker()" location="f17:186" file="f17" line="186" inline="1"/>
  <PointerType id="_1496" type="_1310" size="32" align="32"/>
  <Field id="_1497" name="codestart" type="_399" offset="0" context="_643" access="public" location="f24:199" file="f24" line="199"/>
  <Field id="_1498" name="codeend" type="_399" offset="32" context="_643" access="public" location="f24:200" file="f24" line="200"/>
  <Field id="_1499" name="name" type="_1006" offset="64" context="_643" access="public" location="f24:201" file="f24" line="201"/>
  <Field id="_1500" name="dims" type="_2736" offset="96" context="_643" access="public" location="f24:202" file="f24" line="202"/>
  <Field id="_1501" name="sym" type="_2737" offset="128" context="_643" access="public" location="f24:203" file="f24" line="203"/>
  <Destructor id="_1502" name="sp_debug_symbol_s" artificial="1" throw="" context="_643" access="public" mangled="_ZN17sp_debug_symbol_sD1Ev *INTERNAL* " demangled="sp_debug_symbol_s::~sp_debug_symbol_s()" location="f24:198" file="f24" line="198" endline="198" inline="1">
  </Destructor>
  <OperatorMethod id="_1503" name="=" returns="_2738" artificial="1" throw="" context="_643" access="public" mangled="_ZN17sp_debug_symbol_saSERKS_" demangled="sp_debug_symbol_s::operator=(sp_debug_symbol_s const&amp;)" location="f24:198" file="f24" line="198" endline="198" inline="1">
    <Argument type="_2739" location="f24:198" file="f24" line="198"/>
  </OperatorMethod>
  <Constructor id="_1504" name="sp_debug_symbol_s" artificial="1" throw="" context="_643" access="public" mangled="_ZN17sp_debug_symbol_sC1ERKS_ *INTERNAL* " demangled="sp_debug_symbol_s::sp_debug_symbol_s(sp_debug_symbol_s const&amp;)" location="f24:198" file="f24" line="198" endline="198" inline="1">
    <Argument type="_2739" location="f24:198" file="f24" line="198"/>
  </Constructor>
  <Constructor id="_1505" name="sp_debug_symbol_s" artificial="1" throw="" context="_643" access="public" mangled="_ZN17sp_debug_symbol_sC1Ev *INTERNAL* " demangled="sp_debug_symbol_s::sp_debug_symbol_s()" location="f24:198" file="f24" line="198" inline="1"/>
  <Field id="_1506" name="addr" type="_399" offset="0" context="_647" access="public" location="f24:184" file="f24" line="184"/>
  <Field id="_1507" name="line" type="_399" offset="32" context="_647" access="public" location="f24:185" file="f24" line="185"/>
  <Destructor id="_1508" name="sp_debug_line_s" artificial="1" throw="" context="_647" access="public" mangled="_ZN15sp_debug_line_sD1Ev *INTERNAL* " demangled="sp_debug_line_s::~sp_debug_line_s()" location="f24:183" file="f24" line="183" endline="183" inline="1">
  </Destructor>
  <OperatorMethod id="_1509" name="=" returns="_2740" artificial="1" throw="" context="_647" access="public" mangled="_ZN15sp_debug_line_saSERKS_" demangled="sp_debug_line_s::operator=(sp_debug_line_s const&amp;)" location="f24:183" file="f24" line="183" endline="183" inline="1">
    <Argument type="_2741" location="f24:183" file="f24" line="183"/>
  </OperatorMethod>
  <Constructor id="_1510" name="sp_debug_line_s" artificial="1" throw="" context="_647" access="public" mangled="_ZN15sp_debug_line_sC1ERKS_ *INTERNAL* " demangled="sp_debug_line_s::sp_debug_line_s(sp_debug_line_s const&amp;)" location="f24:183" file="f24" line="183" endline="183" inline="1">
    <Argument type="_2741" location="f24:183" file="f24" line="183"/>
  </Constructor>
  <Constructor id="_1511" name="sp_debug_line_s" artificial="1" throw="" context="_647" access="public" mangled="_ZN15sp_debug_line_sC1Ev *INTERNAL* " demangled="sp_debug_line_s::sp_debug_line_s()" location="f24:183" file="f24" line="183" inline="1"/>
  <PointerType id="_1512" type="_606" size="32" align="32"/>
  <CvQualifiedType id="_1512r" type="_1512" restrict="1"/>
  <Field id="_1514" name="addr" type="_399" offset="0" context="_681" access="public" location="f20:178" file="f20" line="178"/>
  <Field id="_1515" name="name" type="_399" offset="32" context="_681" access="public" location="f20:179" file="f20" line="179"/>
  <Destructor id="_1516" name="sp_fdbg_file_s" artificial="1" throw="" context="_681" access="public" mangled="_ZN14sp_fdbg_file_sD1Ev *INTERNAL* " demangled="sp_fdbg_file_s::~sp_fdbg_file_s()" location="f20:177" file="f20" line="177" endline="177" inline="1">
  </Destructor>
  <OperatorMethod id="_1517" name="=" returns="_2742" artificial="1" throw="" context="_681" access="public" mangled="_ZN14sp_fdbg_file_saSERKS_" demangled="sp_fdbg_file_s::operator=(sp_fdbg_file_s const&amp;)" location="f20:177" file="f20" line="177" endline="177" inline="1">
    <Argument type="_2743" location="f20:177" file="f20" line="177"/>
  </OperatorMethod>
  <Constructor id="_1518" name="sp_fdbg_file_s" artificial="1" throw="" context="_681" access="public" mangled="_ZN14sp_fdbg_file_sC1ERKS_ *INTERNAL* " demangled="sp_fdbg_file_s::sp_fdbg_file_s(sp_fdbg_file_s const&amp;)" location="f20:177" file="f20" line="177" endline="177" inline="1">
    <Argument type="_2743" location="f20:177" file="f20" line="177"/>
  </Constructor>
  <Constructor id="_1519" name="sp_fdbg_file_s" artificial="1" throw="" context="_681" access="public" mangled="_ZN14sp_fdbg_file_sC1Ev *INTERNAL* " demangled="sp_fdbg_file_s::sp_fdbg_file_s()" location="f20:177" file="f20" line="177" inline="1"/>
  <Field id="_1520" name="addr" type="_742" offset="0" context="_691" access="public" location="f20:293" file="f20" line="293"/>
  <Field id="_1521" name="tagid" type="_504" offset="32" context="_691" access="public" location="f20:294" file="f20" line="294"/>
  <Field id="_1522" name="codestart" type="_399" offset="64" context="_691" access="public" location="f20:295" file="f20" line="295"/>
  <Field id="_1523" name="codeend" type="_399" offset="96" context="_691" access="public" location="f20:296" file="f20" line="296"/>
  <Field id="_1524" name="ident" type="_795" offset="128" context="_691" access="public" location="f20:297" file="f20" line="297"/>
  <Field id="_1525" name="vclass" type="_795" offset="136" context="_691" access="public" location="f20:298" file="f20" line="298"/>
  <Field id="_1526" name="dimcount" type="_758" offset="144" context="_691" access="public" location="f20:299" file="f20" line="299"/>
  <Field id="_1527" name="name" type="_399" offset="160" context="_691" access="public" location="f20:300" file="f20" line="300"/>
  <Destructor id="_1528" name="sp_u_fdbg_symbol_s" artificial="1" throw="" context="_691" access="public" mangled="_ZN18sp_u_fdbg_symbol_sD1Ev *INTERNAL* " demangled="sp_u_fdbg_symbol_s::~sp_u_fdbg_symbol_s()" location="f20:292" file="f20" line="292" endline="292" inline="1">
  </Destructor>
  <OperatorMethod id="_1529" name="=" returns="_2744" artificial="1" throw="" context="_691" access="public" mangled="_ZN18sp_u_fdbg_symbol_saSERKS_" demangled="sp_u_fdbg_symbol_s::operator=(sp_u_fdbg_symbol_s const&amp;)" location="f20:292" file="f20" line="292" endline="292" inline="1">
    <Argument type="_2745" location="f20:292" file="f20" line="292"/>
  </OperatorMethod>
  <Constructor id="_1530" name="sp_u_fdbg_symbol_s" artificial="1" throw="" context="_691" access="public" mangled="_ZN18sp_u_fdbg_symbol_sC1ERKS_ *INTERNAL* " demangled="sp_u_fdbg_symbol_s::sp_u_fdbg_symbol_s(sp_u_fdbg_symbol_s const&amp;)" location="f20:292" file="f20" line="292" endline="292" inline="1">
    <Argument type="_2745" location="f20:292" file="f20" line="292"/>
  </Constructor>
  <Constructor id="_1531" name="sp_u_fdbg_symbol_s" artificial="1" throw="" context="_691" access="public" mangled="_ZN18sp_u_fdbg_symbol_sC1Ev *INTERNAL* " demangled="sp_u_fdbg_symbol_s::sp_u_fdbg_symbol_s()" location="f20:292" file="f20" line="292" inline="1"/>
  <PointerType id="_1532" type="_1347" size="32" align="32"/>
  <Field id="_1533" name="nameoffs" type="_399" offset="0" context="_729" access="public" location="f20:78" file="f20" line="78"/>
  <Field id="_1534" name="dataoffs" type="_399" offset="32" context="_729" access="public" location="f20:79" file="f20" line="79"/>
  <Field id="_1535" name="size" type="_399" offset="64" context="_729" access="public" location="f20:80" file="f20" line="80"/>
  <Destructor id="_1536" name="sp_file_section_s" artificial="1" throw="" context="_729" access="public" mangled="_ZN17sp_file_section_sD1Ev *INTERNAL* " demangled="sp_file_section_s::~sp_file_section_s()" location="f20:77" file="f20" line="77" endline="77" inline="1">
  </Destructor>
  <OperatorMethod id="_1537" name="=" returns="_2746" artificial="1" throw="" context="_729" access="public" mangled="_ZN17sp_file_section_saSERKS_" demangled="sp_file_section_s::operator=(sp_file_section_s const&amp;)" location="f20:77" file="f20" line="77" endline="77" inline="1">
    <Argument type="_2747" location="f20:77" file="f20" line="77"/>
  </OperatorMethod>
  <Constructor id="_1538" name="sp_file_section_s" artificial="1" throw="" context="_729" access="public" mangled="_ZN17sp_file_section_sC1ERKS_ *INTERNAL* " demangled="sp_file_section_s::sp_file_section_s(sp_file_section_s const&amp;)" location="f20:77" file="f20" line="77" endline="77" inline="1">
    <Argument type="_2747" location="f20:77" file="f20" line="77"/>
  </Constructor>
  <Constructor id="_1539" name="sp_file_section_s" artificial="1" throw="" context="_729" access="public" mangled="_ZN17sp_file_section_sC1Ev *INTERNAL* " demangled="sp_file_section_s::sp_file_section_s()" location="f20:77" file="f20" line="77" inline="1"/>
  <PointerType id="_1540" type="_130" size="32" align="32"/>
  <CvQualifiedType id="_1540r" type="_1540" restrict="1"/>
  <PointerType id="_1542" type="_297" size="32" align="32"/>
  <CvQualifiedType id="_1542r" type="_1542" restrict="1"/>
  <PointerType id="_1544" type="_123" size="32" align="32"/>
  <PointerType id="_1545" type="_904" size="32" align="32"/>
  <Field id="_1546" name="dls_name" type="_82" offset="0" context="_783" access="public" location="f19:174" file="f19" line="174"/>
  <Field id="_1547" name="dls_flags" type="_92" offset="32" context="_783" access="public" location="f19:175" file="f19" line="175"/>
  <Destructor id="_1548" name="._13" artificial="1" throw="" context="_783" access="public" mangled="_ZN10Dl_serpathD1Ev *INTERNAL* " demangled="Dl_serpath::~Dl_serpath()" location="f19:176" file="f19" line="176" endline="176" inline="1">
  </Destructor>
  <OperatorMethod id="_1549" name="=" returns="_2748" artificial="1" throw="" context="_783" access="public" mangled="_ZN10Dl_serpathaSERKS_" demangled="Dl_serpath::operator=(Dl_serpath const&amp;)" location="f19:176" file="f19" line="176" endline="176" inline="1">
    <Argument type="_2749" location="f19:173" file="f19" line="173"/>
  </OperatorMethod>
  <Constructor id="_1550" name="._13" artificial="1" throw="" context="_783" access="public" mangled="_ZN10Dl_serpathC1ERKS_ *INTERNAL* " demangled="Dl_serpath::Dl_serpath(Dl_serpath const&amp;)" location="f19:176" file="f19" line="176" endline="176" inline="1">
    <Argument type="_2749" location="f19:173" file="f19" line="173"/>
  </Constructor>
  <Constructor id="_1551" name="._13" artificial="1" throw="" context="_783" access="public" mangled="_ZN10Dl_serpathC1Ev *INTERNAL* " demangled="Dl_serpath::Dl_serpath()" location="f19:176" file="f19" line="176" inline="1"/>
  <PointerType id="_1552" type="_947" size="32" align="32"/>
  <CvQualifiedType id="_1552r" type="_1552" restrict="1"/>
  <PointerType id="_1554" type="_1552" size="32" align="32"/>
  <CvQualifiedType id="_1554r" type="_1554" restrict="1"/>
  <PointerType id="_1556" type="_1311" size="32" align="32"/>
  <PointerType id="_1557" type="_3c" size="32" align="32"/>
  <CvQualifiedType id="_1557r" type="_1557" restrict="1"/>
  <PointerType id="_1559" type="_3" size="32" align="32"/>
  <CvQualifiedType id="_1559r" type="_1559" restrict="1"/>
  <Class id="_1561" name="IProfiler" context="_816" abstract="1" mangled="N10SourcePawn9IProfilerE" demangled="SourcePawn::IProfiler" location="f21:990" file="f21" line="990" artificial="1" size="32" align="32" members="_2751 _2752 _2753 _2754 _2755 _2756 _2757 _2758 _2759 _2760 " bases=""/>
  <Struct id="_1562" name="sp_plugin_s" context="_816" incomplete="1" mangled="N10SourcePawn11sp_plugin_sE" demangled="SourcePawn::sp_plugin_s" location="f21:1044" file="f21" line="1044" artificial="1" align="8"/>
  <Typedef id="_1563" name="sp_plugin_t" type="_1562" context="_816" location="f21:1045" file="f21" line="1045"/>
  <Class id="_1564" name="IPluginRuntime" context="_816" abstract="1" mangled="N10SourcePawn14IPluginRuntimeE" demangled="SourcePawn::IPluginRuntime" location="f21:328" file="f21" line="328" artificial="1" size="32" align="32" members="_2761 _2762 _2763 _2764 _2765 _2766 _2767 _2768 _2769 _2770 _2771 _2772 _2773 _2774 _2775 _2776 _2777 _2778 _2779 _2780 _2781 _2782 _2783 " bases=""/>
  <Class id="_1565" name="IDebugListener" context="_816" abstract="1" mangled="N10SourcePawn14IDebugListenerE" demangled="SourcePawn::IDebugListener" location="f21:967" file="f21" line="967" artificial="1" size="32" align="32" members="_2784 _2785 _2786 _2787 _2788 _2789 " bases=""/>
  <Class id="_1566" name="IPluginContext" context="_816" abstract="1" mangled="N10SourcePawn14IPluginContextE" demangled="SourcePawn::IPluginContext" location="f21:488" file="f21" line="488" artificial="1" size="32" align="32" members="_2790 _2791 _2792 _2793 _2794 _2795 _2796 _2797 _2798 _2799 _2800 _2801 _2802 _2803 _2804 _2805 _2806 _2807 _2808 _2809 _2810 _2811 _2812 _2813 _2814 _2815 _2816 _2817 _2818 _2819 _2820 _2821 _2822 _2823 _2824 _2825 _2826 _2827 _2828 _2829 _2830 _2831 _2832 _2833 _2834 _2835 _2836 _2837 _2838 _2839 " bases=""/>
  <Class id="_1567" name="IPluginFunction" context="_816" abstract="1" mangled="N10SourcePawn15IPluginFunctionE" demangled="SourcePawn::IPluginFunction" location="f21:185" file="f21" line="185" artificial="1" size="32" align="32" members="_2840 _2841 _2842 _2843 _2844 _2845 _2846 _2847 _2848 _2849 _2850 _2851 " bases="_1573 ">
    <Base type="_1573" access="public" virtual="0" offset="0"/>
  </Class>
  <Enumeration id="_1568" name="SP_NULL_TYPE" context="_816" location="f21:76" file="f21" line="76" artificial="1" size="32" align="32">
    <EnumValue name="SP_NULL_VECTOR" init="0"/>
    <EnumValue name="SP_NULL_STRING" init="1"/>
  </Enumeration>
  <Class id="_1569" name="ISourcePawnEngine" context="_816" abstract="1" mangled="N10SourcePawn17ISourcePawnEngineE" demangled="SourcePawn::ISourcePawnEngine" location="f21:1051" file="f21" line="1051" artificial="1" size="32" align="32" members="_2852 _2853 _2854 _2855 _2856 _2857 _2858 _2859 _2860 _2861 _2862 _2863 _2864 _2865 _2866 _2867 _2868 _2869 " bases=""/>
  <Class id="_1570" name="ISourcePawnEngine2" context="_816" abstract="1" mangled="N10SourcePawn18ISourcePawnEngine2E" demangled="SourcePawn::ISourcePawnEngine2" location="f21:1171" file="f21" line="1171" artificial="1" size="32" align="32" members="_2870 _2871 _2872 _2873 _2874 _2875 _2876 _2877 _2878 _2879 _2880 _2881 _2882 _2883 _2884 _2885 _2886 " bases=""/>
  <Struct id="_1571" name="CallStackInfo" context="_816" mangled="N10SourcePawn13CallStackInfoE" demangled="SourcePawn::CallStackInfo" location="f21:897" file="f21" line="897" artificial="1" size="96" align="32" members="_2887 _2888 _2889 _2890 _2891 _2892 _2893 " bases=""/>
  <Class id="_1572" name="IContextTrace" context="_816" abstract="1" mangled="N10SourcePawn13IContextTraceE" demangled="SourcePawn::IContextTrace" location="f21:907" file="f21" line="907" artificial="1" size="32" align="32" members="_2894 _2895 _2896 _2897 _2898 _2899 _2900 _2901 _2902 _2903 _2904 " bases=""/>
  <Class id="_1573" name="ICallable" context="_816" abstract="1" mangled="N10SourcePawn9ICallableE" demangled="SourcePawn::ICallable" location="f21:87" file="f21" line="87" artificial="1" size="32" align="32" members="_2905 _2906 _2907 _2908 _2909 _2910 _2911 _2912 _2913 _2914 _2915 _2916 " bases=""/>
  <Struct id="_1574" name="IVirtualMachine" context="_816" incomplete="1" mangled="N10SourcePawn15IVirtualMachineE" demangled="SourcePawn::IVirtualMachine" location="f24:100" file="f24" line="100" artificial="1" align="8"/>
  <Class id="_1575" name="ICompilation" context="_816" abstract="1" mangled="N10SourcePawn12ICompilationE" demangled="SourcePawn::ICompilation" location="f21:307" file="f21" line="307" artificial="1" size="32" align="32" members="_2917 _2918 _2919 _2920 _2921 _2922 " bases=""/>
  <Class id="_1576" name="IPluginDebugInfo" context="_816" abstract="1" mangled="N10SourcePawn16IPluginDebugInfoE" demangled="SourcePawn::IPluginDebugInfo" location="f21:276" file="f21" line="276" artificial="1" size="32" align="32" members="_2923 _2924 _2925 _2926 _2927 _2928 _2929 " bases=""/>
  <PointerType id="_1577" type="_1264" size="32" align="32"/>
  <PointerType id="_1578" type="_1374" size="32" align="32"/>
  <PointerType id="_1579" type="_1554" size="32" align="32"/>
  <CvQualifiedType id="_1579r" type="_1579" restrict="1"/>
  <PointerType id="_1581" type="_2930" size="32" align="32"/>
  <PointerType id="_1582" type="_2931" size="32" align="32"/>
  <Field id="_1583" name="dls_size" type="_656" offset="0" context="_837" access="public" location="f19:182" file="f19" line="182"/>
  <Field id="_1584" name="dls_cnt" type="_92" offset="32" context="_837" access="public" location="f19:183" file="f19" line="183"/>
  <Field id="_1585" name="dls_serpath" type="_2932" offset="64" context="_837" access="public" location="f19:184" file="f19" line="184"/>
  <Destructor id="_1586" name="._14" artificial="1" throw="" context="_837" access="public" mangled="_ZN10Dl_serinfoD1Ev *INTERNAL* " demangled="Dl_serinfo::~Dl_serinfo()" location="f19:185" file="f19" line="185" endline="185" inline="1">
  </Destructor>
  <OperatorMethod id="_1587" name="=" returns="_2933" artificial="1" throw="" context="_837" access="public" mangled="_ZN10Dl_serinfoaSERKS_" demangled="Dl_serinfo::operator=(Dl_serinfo const&amp;)" location="f19:185" file="f19" line="185" endline="185" inline="1">
    <Argument type="_2934" location="f19:181" file="f19" line="181"/>
  </OperatorMethod>
  <Constructor id="_1588" name="._14" artificial="1" throw="" context="_837" access="public" mangled="_ZN10Dl_serinfoC1ERKS_ *INTERNAL* " demangled="Dl_serinfo::Dl_serinfo(Dl_serinfo const&amp;)" location="f19:185" file="f19" line="185" endline="185" inline="1">
    <Argument type="_2934" location="f19:181" file="f19" line="181"/>
  </Constructor>
  <Constructor id="_1589" name="._14" artificial="1" throw="" context="_837" access="public" mangled="_ZN10Dl_serinfoC1Ev *INTERNAL* " demangled="Dl_serinfo::Dl_serinfo()" location="f19:185" file="f19" line="185" inline="1"/>
  <Field id="_1590" name="name" type="_399" offset="0" context="_840" access="public" location="f20:141" file="f20" line="141"/>
  <Destructor id="_1591" name="sp_file_natives_s" artificial="1" throw="" context="_840" access="public" mangled="_ZN17sp_file_natives_sD1Ev *INTERNAL* " demangled="sp_file_natives_s::~sp_file_natives_s()" location="f20:140" file="f20" line="140" endline="140" inline="1">
  </Destructor>
  <OperatorMethod id="_1592" name="=" returns="_2935" artificial="1" throw="" context="_840" access="public" mangled="_ZN17sp_file_natives_saSERKS_" demangled="sp_file_natives_s::operator=(sp_file_natives_s const&amp;)" location="f20:140" file="f20" line="140" endline="140" inline="1">
    <Argument type="_2936" location="f20:140" file="f20" line="140"/>
  </OperatorMethod>
  <Constructor id="_1593" name="sp_file_natives_s" artificial="1" throw="" context="_840" access="public" mangled="_ZN17sp_file_natives_sC1ERKS_ *INTERNAL* " demangled="sp_file_natives_s::sp_file_natives_s(sp_file_natives_s const&amp;)" location="f20:140" file="f20" line="140" endline="140" inline="1">
    <Argument type="_2936" location="f20:140" file="f20" line="140"/>
  </Constructor>
  <Constructor id="_1594" name="sp_file_natives_s" artificial="1" throw="" context="_840" access="public" mangled="_ZN17sp_file_natives_sC1Ev *INTERNAL* " demangled="sp_file_natives_s::sp_file_natives_s()" location="f20:140" file="f20" line="140" inline="1"/>
  <Field id="_1595" name="st_dev" type="_435" offset="0" context="_849" access="public" location="f43:121" file="f43" line="121"/>
  <Field id="_1596" name="__pad1" type="_92" offset="64" context="_849" access="public" location="f43:127" file="f43" line="127"/>
  <Field id="_1597" name="__st_ino" type="_373" offset="96" context="_849" access="public" location="f43:128" file="f43" line="128"/>
  <Field id="_1598" name="st_mode" type="_286" offset="128" context="_849" access="public" location="f43:129" file="f43" line="129"/>
  <Field id="_1599" name="st_nlink" type="_367" offset="160" context="_849" access="public" location="f43:130" file="f43" line="130"/>
  <Field id="_1600" name="st_uid" type="_683" offset="192" context="_849" access="public" location="f43:132" file="f43" line="132"/>
  <Field id="_1601" name="st_gid" type="_700" offset="224" context="_849" access="public" location="f43:133" file="f43" line="133"/>
  <Field id="_1602" name="st_rdev" type="_435" offset="256" context="_849" access="public" location="f43:139" file="f43" line="139"/>
  <Field id="_1603" name="__pad2" type="_92" offset="320" context="_849" access="public" location="f43:140" file="f43" line="140"/>
  <Field id="_1604" name="st_size" type="_813" offset="352" context="_849" access="public" location="f43:141" file="f43" line="141"/>
  <Field id="_1605" name="st_blksize" type="_959" offset="416" context="_849" access="public" location="f43:143" file="f43" line="143"/>
  <Field id="_1606" name="st_blocks" type="_447" offset="448" context="_849" access="public" location="f43:144" file="f43" line="144"/>
  <Field id="_1607" name="st_atim" type="_446" offset="512" context="_849" access="public" location="f43:152" file="f43" line="152"/>
  <Field id="_1608" name="st_mtim" type="_446" offset="576" context="_849" access="public" location="f43:153" file="f43" line="153"/>
  <Field id="_1609" name="st_ctim" type="_446" offset="640" context="_849" access="public" location="f43:154" file="f43" line="154"/>
  <Field id="_1610" name="st_ino" type="_977" offset="704" context="_849" access="public" location="f43:169" file="f43" line="169"/>
  <Destructor id="_1611" name="stat64" artificial="1" throw="" context="_849" access="public" mangled="_ZN6stat64D1Ev *INTERNAL* " demangled="stat64::~stat64()" location="f43:120" file="f43" line="120" endline="120" inline="1">
  </Destructor>
  <OperatorMethod id="_1612" name="=" returns="_2937" artificial="1" throw="" context="_849" access="public" mangled="_ZN6stat64aSERKS_" demangled="stat64::operator=(stat64 const&amp;)" location="f43:120" file="f43" line="120" endline="120" inline="1">
    <Argument type="_2938" location="f43:120" file="f43" line="120"/>
  </OperatorMethod>
  <Constructor id="_1613" name="stat64" artificial="1" throw="" context="_849" access="public" mangled="_ZN6stat64C1ERKS_ *INTERNAL* " demangled="stat64::stat64(stat64 const&amp;)" location="f43:120" file="f43" line="120" endline="120" inline="1">
    <Argument type="_2938" location="f43:120" file="f43" line="120"/>
  </Constructor>
  <Constructor id="_1614" name="stat64" artificial="1" throw="" context="_849" access="public" mangled="_ZN6stat64C1Ev *INTERNAL* " demangled="stat64::stat64()" location="f43:120" file="f43" line="120" inline="1"/>
  <PointerType id="_1615" type="_1320" size="32" align="32"/>
  <PointerType id="_1616" type="_99" size="32" align="32"/>
  <PointerType id="_1617" type="_1336" size="32" align="32"/>
  <Field id="_1618" name="datasize" type="_399" offset="0" context="_934" access="public" location="f20:122" file="f20" line="122"/>
  <Field id="_1619" name="memsize" type="_399" offset="32" context="_934" access="public" location="f20:123" file="f20" line="123"/>
  <Field id="_1620" name="data" type="_399" offset="64" context="_934" access="public" location="f20:124" file="f20" line="124"/>
  <Destructor id="_1621" name="sp_file_data_s" artificial="1" throw="" context="_934" access="public" mangled="_ZN14sp_file_data_sD1Ev *INTERNAL* " demangled="sp_file_data_s::~sp_file_data_s()" location="f20:121" file="f20" line="121" endline="121" inline="1">
  </Destructor>
  <OperatorMethod id="_1622" name="=" returns="_2939" artificial="1" throw="" context="_934" access="public" mangled="_ZN14sp_file_data_saSERKS_" demangled="sp_file_data_s::operator=(sp_file_data_s const&amp;)" location="f20:121" file="f20" line="121" endline="121" inline="1">
    <Argument type="_2940" location="f20:121" file="f20" line="121"/>
  </OperatorMethod>
  <Constructor id="_1623" name="sp_file_data_s" artificial="1" throw="" context="_934" access="public" mangled="_ZN14sp_file_data_sC1ERKS_ *INTERNAL* " demangled="sp_file_data_s::sp_file_data_s(sp_file_data_s const&amp;)" location="f20:121" file="f20" line="121" endline="121" inline="1">
    <Argument type="_2940" location="f20:121" file="f20" line="121"/>
  </Constructor>
  <Constructor id="_1624" name="sp_file_data_s" artificial="1" throw="" context="_934" access="public" mangled="_ZN14sp_file_data_sC1Ev *INTERNAL* " demangled="sp_file_data_s::sp_file_data_s()" location="f20:121" file="f20" line="121" inline="1"/>
  <PointerType id="_1625" type="_2941" size="32" align="32"/>
  <PointerType id="_1626" type="_364" size="32" align="32"/>
  <CvQualifiedType id="_1626r" type="_1626" restrict="1"/>
  <Field id="_1628" name="d_ino" type="_977" offset="0" context="_947" access="public" location="f54:40" file="f54" line="40"/>
  <Field id="_1629" name="d_off" type="_813" offset="64" context="_947" access="public" location="f54:41" file="f54" line="41"/>
  <Field id="_1630" name="d_reclen" type="_210" offset="128" context="_947" access="public" location="f54:42" file="f54" line="42"/>
  <Field id="_1631" name="d_type" type="_673" offset="144" context="_947" access="public" location="f54:43" file="f54" line="43"/>
  <Field id="_1632" name="d_name" type="_2942" offset="152" context="_947" access="public" location="f54:44" file="f54" line="44"/>
  <Destructor id="_1633" name="dirent64" artificial="1" throw="" context="_947" access="public" mangled="_ZN8dirent64D1Ev *INTERNAL* " demangled="dirent64::~dirent64()" location="f54:39" file="f54" line="39" endline="39" inline="1">
  </Destructor>
  <OperatorMethod id="_1634" name="=" returns="_2943" artificial="1" throw="" context="_947" access="public" mangled="_ZN8dirent64aSERKS_" demangled="dirent64::operator=(dirent64 const&amp;)" location="f54:39" file="f54" line="39" endline="39" inline="1">
    <Argument type="_2944" location="f54:39" file="f54" line="39"/>
  </OperatorMethod>
  <Constructor id="_1635" name="dirent64" artificial="1" throw="" context="_947" access="public" mangled="_ZN8dirent64C1ERKS_ *INTERNAL* " demangled="dirent64::dirent64(dirent64 const&amp;)" location="f54:39" file="f54" line="39" endline="39" inline="1">
    <Argument type="_2944" location="f54:39" file="f54" line="39"/>
  </Constructor>
  <Constructor id="_1636" name="dirent64" artificial="1" throw="" context="_947" access="public" mangled="_ZN8dirent64C1Ev *INTERNAL* " demangled="dirent64::dirent64()" location="f54:39" file="f54" line="39" inline="1"/>
  <Field id="_1637" name="addr" type="_399" offset="0" context="_954" access="public" location="f20:187" file="f20" line="187"/>
  <Field id="_1638" name="line" type="_399" offset="32" context="_954" access="public" location="f20:188" file="f20" line="188"/>
  <Destructor id="_1639" name="sp_fdbg_line_s" artificial="1" throw="" context="_954" access="public" mangled="_ZN14sp_fdbg_line_sD1Ev *INTERNAL* " demangled="sp_fdbg_line_s::~sp_fdbg_line_s()" location="f20:186" file="f20" line="186" endline="186" inline="1">
  </Destructor>
  <OperatorMethod id="_1640" name="=" returns="_2945" artificial="1" throw="" context="_954" access="public" mangled="_ZN14sp_fdbg_line_saSERKS_" demangled="sp_fdbg_line_s::operator=(sp_fdbg_line_s const&amp;)" location="f20:186" file="f20" line="186" endline="186" inline="1">
    <Argument type="_2946" location="f20:186" file="f20" line="186"/>
  </OperatorMethod>
  <Constructor id="_1641" name="sp_fdbg_line_s" artificial="1" throw="" context="_954" access="public" mangled="_ZN14sp_fdbg_line_sC1ERKS_ *INTERNAL* " demangled="sp_fdbg_line_s::sp_fdbg_line_s(sp_fdbg_line_s const&amp;)" location="f20:186" file="f20" line="186" endline="186" inline="1">
    <Argument type="_2946" location="f20:186" file="f20" line="186"/>
  </Constructor>
  <Constructor id="_1642" name="sp_fdbg_line_s" artificial="1" throw="" context="_954" access="public" mangled="_ZN14sp_fdbg_line_sC1Ev *INTERNAL* " demangled="sp_fdbg_line_s::sp_fdbg_line_s()" location="f20:186" file="f20" line="186" inline="1"/>
  <Field id="_1643" name="d_ino" type="_373" offset="0" context="_962" access="public" location="f54:26" file="f54" line="26"/>
  <Field id="_1644" name="d_off" type="_606" offset="32" context="_962" access="public" location="f54:27" file="f54" line="27"/>
  <Field id="_1645" name="d_reclen" type="_210" offset="64" context="_962" access="public" location="f54:32" file="f54" line="32"/>
  <Field id="_1646" name="d_type" type="_673" offset="80" context="_962" access="public" location="f54:33" file="f54" line="33"/>
  <Field id="_1647" name="d_name" type="_2942" offset="88" context="_962" access="public" location="f54:34" file="f54" line="34"/>
  <Destructor id="_1648" name="dirent" artificial="1" throw="" context="_962" access="public" mangled="_ZN6direntD1Ev *INTERNAL* " demangled="dirent::~dirent()" location="f54:24" file="f54" line="24" endline="24" inline="1">
  </Destructor>
  <OperatorMethod id="_1649" name="=" returns="_2947" artificial="1" throw="" context="_962" access="public" mangled="_ZN6direntaSERKS_" demangled="dirent::operator=(dirent const&amp;)" location="f54:24" file="f54" line="24" endline="24" inline="1">
    <Argument type="_2948" location="f54:24" file="f54" line="24"/>
  </OperatorMethod>
  <Constructor id="_1650" name="dirent" artificial="1" throw="" context="_962" access="public" mangled="_ZN6direntC1ERKS_ *INTERNAL* " demangled="dirent::dirent(dirent const&amp;)" location="f54:24" file="f54" line="24" endline="24" inline="1">
    <Argument type="_2948" location="f54:24" file="f54" line="24"/>
  </Constructor>
  <Constructor id="_1651" name="dirent" artificial="1" throw="" context="_962" access="public" mangled="_ZN6direntC1Ev *INTERNAL* " demangled="dirent::dirent()" location="f54:24" file="f54" line="24" inline="1"/>
  <PointerType id="_1652" type="_1367" size="32" align="32"/>
  <PointerType id="_1653" type="_683" size="32" align="32"/>
  <CvQualifiedType id="_1214r" type="_1214" restrict="1"/>
  <Field id="_1655" name="offs" type="_2949" offset="0" context="_996" access="public" location="f24:140" file="f24" line="140"/>
  <Field id="_1656" name="name" type="_1006" offset="32" context="_996" access="public" location="f24:141" file="f24" line="141"/>
  <Destructor id="_1657" name="sp_pubvar_s" artificial="1" throw="" context="_996" access="public" mangled="_ZN11sp_pubvar_sD1Ev *INTERNAL* " demangled="sp_pubvar_s::~sp_pubvar_s()" location="f24:139" file="f24" line="139" endline="139" inline="1">
  </Destructor>
  <OperatorMethod id="_1658" name="=" returns="_2950" artificial="1" throw="" context="_996" access="public" mangled="_ZN11sp_pubvar_saSERKS_" demangled="sp_pubvar_s::operator=(sp_pubvar_s const&amp;)" location="f24:139" file="f24" line="139" endline="139" inline="1">
    <Argument type="_2951" location="f24:139" file="f24" line="139"/>
  </OperatorMethod>
  <Constructor id="_1659" name="sp_pubvar_s" artificial="1" throw="" context="_996" access="public" mangled="_ZN11sp_pubvar_sC1ERKS_ *INTERNAL* " demangled="sp_pubvar_s::sp_pubvar_s(sp_pubvar_s const&amp;)" location="f24:139" file="f24" line="139" endline="139" inline="1">
    <Argument type="_2951" location="f24:139" file="f24" line="139"/>
  </Constructor>
  <Constructor id="_1660" name="sp_pubvar_s" artificial="1" throw="" context="_996" access="public" mangled="_ZN11sp_pubvar_sC1Ev *INTERNAL* " demangled="sp_pubvar_s::sp_pubvar_s()" location="f24:139" file="f24" line="139" inline="1"/>
  <ReferenceType id="_1661" type="_3" size="32" align="32"/>
  <ReferenceType id="_1662" type="_3c" size="32" align="32"/>
  <ReferenceType id="_1664" type="_16" size="32" align="32"/>
  <ReferenceType id="_1665" type="_16c" size="32" align="32"/>
  <PointerType id="_1667" type="_981" size="32" align="32"/>
  <PointerType id="_1668" type="_994" size="32" align="32"/>
  <PointerType id="_1669" type="_697" size="32" align="32"/>
  <PointerType id="_1670" type="_180" size="32" align="32"/>
  <ReferenceType id="_1671" type="_55" size="32" align="32"/>
  <ReferenceType id="_1672" type="_55c" size="32" align="32"/>
  <ReferenceType id="_1673" type="_71" size="32" align="32"/>
  <ReferenceType id="_1674" type="_71c" size="32" align="32"/>
  <PointerType id="_1675" type="_611" size="32" align="32"/>
  <ArrayType id="_1676" min="0" max="0u" type="_1062" size="8" align="8"/>
  <PointerType id="_1677" type="_81" size="32" align="32"/>
  <ArrayType id="_1678" min="0" max="39u" type="_1062" size="320" align="8"/>
  <ReferenceType id="_1679" type="_121" size="32" align="32"/>
  <ReferenceType id="_1680" type="_121c" size="32" align="32"/>
  <ReferenceType id="_1681" type="_123" size="32" align="32"/>
  <ReferenceType id="_1682" type="_123c" size="32" align="32"/>
  <Method id="_1683" name="OnExtensionLoad" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface15OnExtensionLoadEPNS_10IExtensionEPNS_9IShareSysEPcjb" demangled="SourceMod::IExtensionInterface::OnExtensionLoad(SourceMod::IExtension*, SourceMod::IShareSys*, char*, unsigned int, bool)" location="f35:164" file="f35" line="164" extern="1">
    <Argument name="me" type="_1556" location="f35:164" file="f35" line="164"/>
    <Argument name="sys" type="_1472" location="f35:164" file="f35" line="164"/>
    <Argument name="error" type="_82" location="f35:164" file="f35" line="164"/>
    <Argument name="maxlength" type="_656" location="f35:164" file="f35" line="164"/>
    <Argument name="late" type="_1028" location="f35:164" file="f35" line="164"/>
  </Method>
  <Method id="_1684" name="OnExtensionUnload" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface17OnExtensionUnloadEv" demangled="SourceMod::IExtensionInterface::OnExtensionUnload()" location="f35:169" file="f35" line="169" extern="1"/>
  <Method id="_1685" name="OnExtensionsAllLoaded" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface21OnExtensionsAllLoadedEv" demangled="SourceMod::IExtensionInterface::OnExtensionsAllLoaded()" location="f35:175" file="f35" line="175" extern="1"/>
  <Method id="_1686" name="IsMetamodExtension" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface18IsMetamodExtensionEv" demangled="SourceMod::IExtensionInterface::IsMetamodExtension()" location="f35:237" file="f35" line="237" extern="1"/>
  <Method id="_1687" name="OnExtensionPauseChange" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface22OnExtensionPauseChangeEb" demangled="SourceMod::IExtensionInterface::OnExtensionPauseChange(bool)" location="f35:182" file="f35" line="182" extern="1">
    <Argument name="pause" type="_1028" location="f35:182" file="f35" line="182"/>
  </Method>
  <Method id="_1688" name="GetExtensionName" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface16GetExtensionNameEv" demangled="SourceMod::IExtensionInterface::GetExtensionName()" location="f35:244" file="f35" line="244" extern="1"/>
  <Method id="_1689" name="GetExtensionURL" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface15GetExtensionURLEv" demangled="SourceMod::IExtensionInterface::GetExtensionURL()" location="f35:251" file="f35" line="251" extern="1"/>
  <Method id="_1690" name="GetExtensionTag" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface15GetExtensionTagEv" demangled="SourceMod::IExtensionInterface::GetExtensionTag()" location="f35:258" file="f35" line="258" extern="1"/>
  <Method id="_1691" name="GetExtensionAuthor" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface18GetExtensionAuthorEv" demangled="SourceMod::IExtensionInterface::GetExtensionAuthor()" location="f35:265" file="f35" line="265" extern="1"/>
  <Method id="_1692" name="GetExtensionVerString" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface21GetExtensionVerStringEv" demangled="SourceMod::IExtensionInterface::GetExtensionVerString()" location="f35:283" file="f35" line="283" extern="1"/>
  <Method id="_1693" name="GetExtensionDescription" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface23GetExtensionDescriptionEv" demangled="SourceMod::IExtensionInterface::GetExtensionDescription()" location="f35:295" file="f35" line="295" extern="1"/>
  <Method id="_1694" name="GetExtensionDateString" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface22GetExtensionDateStringEv" demangled="SourceMod::IExtensionInterface::GetExtensionDateString()" location="f35:302" file="f35" line="302" extern="1"/>
  <Destructor id="_1695" name="IExtensionInterface" artificial="1" throw="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterfaceD1Ev *INTERNAL* " demangled="SourceMod::IExtensionInterface::~IExtensionInterface()" location="f35:142" file="f35" line="142" endline="142" inline="1">
  </Destructor>
  <OperatorMethod id="_1696" name="=" returns="_2956" artificial="1" throw="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterfaceaSERKS0_" demangled="SourceMod::IExtensionInterface::operator=(SourceMod::IExtensionInterface const&amp;)" location="f35:142" file="f35" line="142" endline="142" inline="1">
    <Argument type="_2957" location="f35:142" file="f35" line="142"/>
  </OperatorMethod>
  <Constructor id="_1697" name="IExtensionInterface" artificial="1" throw="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterfaceC1ERKS0_ *INTERNAL* " demangled="SourceMod::IExtensionInterface::IExtensionInterface(SourceMod::IExtensionInterface const&amp;)" location="f35:142" file="f35" line="142" endline="142" inline="1">
    <Argument type="_2957" location="f35:142" file="f35" line="142"/>
  </Constructor>
  <Constructor id="_1698" name="IExtensionInterface" artificial="1" throw="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterfaceC1Ev *INTERNAL* " demangled="SourceMod::IExtensionInterface::IExtensionInterface()" location="f35:142" file="f35" line="142" endline="142" inline="1"/>
  <Method id="_1699" name="GetExtensionVersion" returns="_92" virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface19GetExtensionVersionEv" demangled="SourceMod::IExtensionInterface::GetExtensionVersion()" location="f35:145" file="f35" line="145" endline="147" inline="1"/>
  <Method id="_1700" name="QueryInterfaceDrop" returns="_1028" virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface18QueryInterfaceDropEPNS_11SMInterfaceE" demangled="SourceMod::IExtensionInterface::QueryInterfaceDrop(SourceMod::SMInterface*)" location="f35:200" file="f35" line="200" endline="202" inline="1">
    <Argument name="pInterface" type="_2958" location="f35:200" file="f35" line="200"/>
  </Method>
  <Method id="_1701" name="NotifyInterfaceDrop" returns="_80" virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface19NotifyInterfaceDropEPNS_11SMInterfaceE" demangled="SourceMod::IExtensionInterface::NotifyInterfaceDrop(SourceMod::SMInterface*)" location="f35:213" file="f35" line="213" inline="1">
    <Argument name="pInterface" type="_2958" location="f35:213" file="f35" line="213"/>
  </Method>
  <Method id="_1702" name="QueryRunning" returns="_1028" virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface12QueryRunningEPcj" demangled="SourceMod::IExtensionInterface::QueryRunning(char*, unsigned int)" location="f35:224" file="f35" line="224" endline="226" inline="1">
    <Argument name="error" type="_82" location="f35:224" file="f35" line="224"/>
    <Argument name="maxlength" type="_656" location="f35:224" file="f35" line="224"/>
  </Method>
  <Method id="_1703" name="OnCoreMapStart" returns="_80" virtual="1" overrides="" context="_1121" access="public" mangled="_ZN9SourceMod19IExtensionInterface14OnCoreMapStartEP7edict_tii" demangled="SourceMod::IExtensionInterface::OnCoreMapStart(edict_t*, int, int)" location="f35:311" file="f35" line="311" inline="1">
    <Argument name="pEdictList" type="_2959" location="f35:311" file="f35" line="311"/>
    <Argument name="edictCount" type="_103" location="f35:311" file="f35" line="311"/>
    <Argument name="clientMax" type="_103" location="f35:311" file="f35" line="311"/>
  </Method>
  <ReferenceType id="_1708" type="_200" size="32" align="32"/>
  <ReferenceType id="_1709" type="_200c" size="32" align="32"/>
  <ReferenceType id="_1710" type="_202" size="32" align="32"/>
  <ReferenceType id="_1711" type="_202c" size="32" align="32"/>
  <ReferenceType id="_1712" type="_207" size="32" align="32"/>
  <ReferenceType id="_1713" type="_207c" size="32" align="32"/>
  <ReferenceType id="_1714" type="_213" size="32" align="32"/>
  <ReferenceType id="_1715" type="_213c" size="32" align="32"/>
  <ArrayType id="_1717" min="0" max="12u" type="_2964" size="416" align="32"/>
  <PointerType id="_1718" type="_210c" size="32" align="32"/>
  <PointerType id="_1719" type="_103c" size="32" align="32"/>
  <ArrayType id="_1720" min="0" max="12u" type="_1006" size="416" align="32"/>
  <ReferenceType id="_1721" type="_233" size="32" align="32"/>
  <ReferenceType id="_1722" type="_233c" size="32" align="32"/>
  <ReferenceType id="_1723" type="_241" size="32" align="32"/>
  <ReferenceType id="_1724" type="_241c" size="32" align="32"/>
  <ReferenceType id="_1725" type="_259" size="32" align="32"/>
  <ReferenceType id="_1726" type="_259c" size="32" align="32"/>
  <ReferenceType id="_1727" type="_289" size="32" align="32"/>
  <ReferenceType id="_1728" type="_289c" size="32" align="32"/>
  <ReferenceType id="_1730" type="_318" size="32" align="32"/>
  <ReferenceType id="_1731" type="_318c" size="32" align="32"/>
  <ReferenceType id="_1733" type="_338" size="32" align="32"/>
  <ReferenceType id="_1734" type="_338c" size="32" align="32"/>
  <ReferenceType id="_1735" type="_358" size="32" align="32"/>
  <ReferenceType id="_1736" type="_358c" size="32" align="32"/>
  <ReferenceType id="_1737" type="_361" size="32" align="32"/>
  <ReferenceType id="_1738" type="_361c" size="32" align="32"/>
  <ReferenceType id="_1739" type="_363" size="32" align="32"/>
  <ReferenceType id="_1740" type="_363c" size="32" align="32"/>
  <Destructor id="_1742" name="ITranslator" artificial="1" throw="" context="_1254" access="public" mangled="_ZN9SourceMod11ITranslatorD1Ev *INTERNAL* " demangled="SourceMod::ITranslator::~ITranslator()" location="f22:230" file="f22" line="230" endline="230" inline="1">
  </Destructor>
  <OperatorMethod id="_1743" name="=" returns="_2976" artificial="1" throw="" context="_1254" access="public" mangled="_ZN9SourceMod11ITranslatoraSERKS0_" demangled="SourceMod::ITranslator::operator=(SourceMod::ITranslator const&amp;)" location="f22:230" file="f22" line="230" endline="230" inline="1">
    <Argument type="_2977" location="f22:230" file="f22" line="230"/>
  </OperatorMethod>
  <Constructor id="_1744" name="ITranslator" artificial="1" throw="" context="_1254" access="public" mangled="_ZN9SourceMod11ITranslatorC1ERKS0_ *INTERNAL* " demangled="SourceMod::ITranslator::ITranslator(SourceMod::ITranslator const&amp;)" location="f22:230" file="f22" line="230" endline="230" inline="1">
    <Argument type="_2977" location="f22:230" file="f22" line="230"/>
  </Constructor>
  <Constructor id="_1745" name="ITranslator" artificial="1" throw="" context="_1254" access="public" mangled="_ZN9SourceMod11ITranslatorC1Ev *INTERNAL* " demangled="SourceMod::ITranslator::ITranslator()" location="f22:230" file="f22" line="230" endline="230" inline="1"/>
  <Method id="_1746" name="GetInterfaceName" returns="_1006" virtual="1" pure_virtual="1" overrides="_2598 " context="_1254" access="public" mangled="_ZN9SourceMod11ITranslator16GetInterfaceNameEv" demangled="SourceMod::ITranslator::GetInterfaceName()" location="f22:232" file="f22" line="232" extern="1"/>
  <Method id="_1747" name="GetInterfaceVersion" returns="_92" virtual="1" pure_virtual="1" overrides="_2597 " context="_1254" access="public" mangled="_ZN9SourceMod11ITranslator19GetInterfaceVersionEv" demangled="SourceMod::ITranslator::GetInterfaceVersion()" location="f22:233" file="f22" line="233" extern="1"/>
  <Method id="_1748" name="CreatePhraseCollection" returns="_2978" virtual="1" pure_virtual="1" overrides="" context="_1254" access="public" mangled="_ZN9SourceMod11ITranslator22CreatePhraseCollectionEv" demangled="SourceMod::ITranslator::CreatePhraseCollection()" location="f22:242" file="f22" line="242" extern="1"/>
  <Method id="_1749" name="GetServerLanguage" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1254" access="public" mangled="_ZN9SourceMod11ITranslator17GetServerLanguageEv" demangled="SourceMod::ITranslator::GetServerLanguage()" location="f22:249" file="f22" line="249" extern="1"/>
  <Method id="_1750" name="GetClientLanguage" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1254" access="public" mangled="_ZN9SourceMod11ITranslator17GetClientLanguageEi" demangled="SourceMod::ITranslator::GetClientLanguage(int)" location="f22:258" file="f22" line="258" extern="1">
    <Argument name="client" type="_103" location="f22:258" file="f22" line="258"/>
  </Method>
  <Method id="_1751" name="SetGlobalTarget" returns="_103" virtual="1" pure_virtual="1" overrides="" context="_1254" access="public" mangled="_ZN9SourceMod11ITranslator15SetGlobalTargetEi" demangled="SourceMod::ITranslator::SetGlobalTarget(int)" location="f22:267" file="f22" line="267" extern="1">
    <Argument name="index" type="_103" location="f22:267" file="f22" line="267"/>
  </Method>
  <Method id="_1752" name="GetGlobalTarget" returns="_103" const="1" virtual="1" pure_virtual="1" overrides="" context="_1254" access="public" mangled="_ZNK9SourceMod11ITranslator15GetGlobalTargetEv" demangled="SourceMod::ITranslator::GetGlobalTarget() const" location="f22:275" file="f22" line="275" extern="1"/>
  <Method id="_1753" name="FormatString" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1254" access="public" mangled="_ZN9SourceMod11ITranslator12FormatStringEPcjPKcPNS_17IPhraseCollectionEPPvjPjPS3_" demangled="SourceMod::ITranslator::FormatString(char*, unsigned int, char const*, SourceMod::IPhraseCollection*, void**, unsigned int, unsigned int*, char const**)" location="f22:327" file="f22" line="327" extern="1">
    <Argument name="buffer" type="_82" location="f22:327" file="f22" line="327"/>
    <Argument name="maxlength" type="_656" location="f22:327" file="f22" line="327"/>
    <Argument name="format" type="_1006" location="f22:327" file="f22" line="327"/>
    <Argument name="pPhrases" type="_2978" location="f22:327" file="f22" line="327"/>
    <Argument name="params" type="_1124" location="f22:327" file="f22" line="327"/>
    <Argument name="numparams" type="_92" location="f22:327" file="f22" line="327"/>
    <Argument name="pOutLength" type="_1066" location="f22:327" file="f22" line="327"/>
    <Argument name="pFailPhrase" type="_2979" location="f22:327" file="f22" line="327"/>
  </Method>
  <Method id="_1754" name="GetLanguageCount" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1254" access="public" mangled="_ZN9SourceMod11ITranslator16GetLanguageCountEv" demangled="SourceMod::ITranslator::GetLanguageCount()" location="f22:334" file="f22" line="334" extern="1"/>
  <Method id="_1755" name="GetLanguageByName" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1254" access="public" mangled="_ZN9SourceMod11ITranslator17GetLanguageByNameEPKcPj" demangled="SourceMod::ITranslator::GetLanguageByName(char const*, unsigned int*)" location="f22:343" file="f22" line="343" extern="1">
    <Argument name="name" type="_1006" location="f22:343" file="f22" line="343"/>
    <Argument name="index" type="_2980" location="f22:343" file="f22" line="343"/>
  </Method>
  <Field id="_1756" name="hsVersion" type="_92" offset="0" context="_1256" access="public" location="f38:164" file="f38" line="164"/>
  <Field id="_1757" name="access" type="_2981" offset="32" context="_1256" access="public" location="f38:165" file="f38" line="165"/>
  <Destructor id="_1758" name="HandleAccess" artificial="1" throw="" context="_1256" access="public" mangled="_ZN9SourceMod12HandleAccessD1Ev *INTERNAL* " demangled="SourceMod::HandleAccess::~HandleAccess()" location="f38:158" file="f38" line="158" endline="158" inline="1">
  </Destructor>
  <OperatorMethod id="_1759" name="=" returns="_2982" artificial="1" throw="" context="_1256" access="public" mangled="_ZN9SourceMod12HandleAccessaSERKS0_" demangled="SourceMod::HandleAccess::operator=(SourceMod::HandleAccess const&amp;)" location="f38:158" file="f38" line="158" endline="158" inline="1">
    <Argument type="_2983" location="f38:158" file="f38" line="158"/>
  </OperatorMethod>
  <Constructor id="_1760" name="HandleAccess" artificial="1" throw="" context="_1256" access="public" mangled="_ZN9SourceMod12HandleAccessC1ERKS0_ *INTERNAL* " demangled="SourceMod::HandleAccess::HandleAccess(SourceMod::HandleAccess const&amp;)" location="f38:158" file="f38" line="158" endline="158" inline="1">
    <Argument type="_2983" location="f38:158" file="f38" line="158"/>
  </Constructor>
  <Constructor id="_1761" name="HandleAccess" explicit="1" context="_1256" access="public" mangled="_ZN9SourceMod12HandleAccessC1Ev *INTERNAL* " demangled="SourceMod::HandleAccess::HandleAccess()" location="f38:160" file="f38" line="160" endline="162" inline="1"/>
  <OperatorMethod id="_1762" name="=" returns="_2984" artificial="1" throw="" context="_1257" access="public" mangled="_ZN9SourceMod15IPluginIteratoraSERKS0_" demangled="SourceMod::IPluginIterator::operator=(SourceMod::IPluginIterator const&amp;)" location="f52:223" file="f52" line="223" endline="223" inline="1">
    <Argument type="_2985" location="f52:223" file="f52" line="223"/>
  </OperatorMethod>
  <Constructor id="_1763" name="IPluginIterator" artificial="1" throw="" context="_1257" access="public" mangled="_ZN9SourceMod15IPluginIteratorC1ERKS0_ *INTERNAL* " demangled="SourceMod::IPluginIterator::IPluginIterator(SourceMod::IPluginIterator const&amp;)" location="f52:223" file="f52" line="223" endline="223" inline="1">
    <Argument type="_2985" location="f52:223" file="f52" line="223"/>
  </Constructor>
  <Constructor id="_1764" name="IPluginIterator" artificial="1" throw="" context="_1257" access="public" mangled="_ZN9SourceMod15IPluginIteratorC1Ev *INTERNAL* " demangled="SourceMod::IPluginIterator::IPluginIterator()" location="f52:223" file="f52" line="223" endline="223" inline="1"/>
  <Destructor id="_1765" name="IPluginIterator" virtual="1" overrides="" context="_1257" access="public" mangled="_ZN9SourceMod15IPluginIteratorD1Ev *INTERNAL* " demangled="SourceMod::IPluginIterator::~IPluginIterator()" location="f52:226" file="f52" line="226" endline="228" inline="1">
  </Destructor>
  <Method id="_1766" name="MorePlugins" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1257" access="public" mangled="_ZN9SourceMod15IPluginIterator11MorePluginsEv" demangled="SourceMod::IPluginIterator::MorePlugins()" location="f52:233" file="f52" line="233" extern="1"/>
  <Method id="_1767" name="GetPlugin" returns="_2986" virtual="1" pure_virtual="1" overrides="" context="_1257" access="public" mangled="_ZN9SourceMod15IPluginIterator9GetPluginEv" demangled="SourceMod::IPluginIterator::GetPlugin()" location="f52:238" file="f52" line="238" extern="1"/>
  <Method id="_1768" name="NextPlugin" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1257" access="public" mangled="_ZN9SourceMod15IPluginIterator10NextPluginEv" demangled="SourceMod::IPluginIterator::NextPlugin()" location="f52:243" file="f52" line="243" extern="1"/>
  <Method id="_1769" name="Release" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1257" access="public" mangled="_ZN9SourceMod15IPluginIterator7ReleaseEv" demangled="SourceMod::IPluginIterator::Release()" location="f52:249" file="f52" line="249" extern="1"/>
  <OperatorMethod id="_1770" name="=" returns="_2987" artificial="1" throw="" context="_1258" access="public" mangled="_ZN9SourceMod13IThreadHandleaSERKS0_" demangled="SourceMod::IThreadHandle::operator=(SourceMod::IThreadHandle const&amp;)" location="f33:109" file="f33" line="109" endline="109" inline="1">
    <Argument type="_2988" location="f33:109" file="f33" line="109"/>
  </OperatorMethod>
  <Constructor id="_1771" name="IThreadHandle" artificial="1" throw="" context="_1258" access="public" mangled="_ZN9SourceMod13IThreadHandleC1ERKS0_ *INTERNAL* " demangled="SourceMod::IThreadHandle::IThreadHandle(SourceMod::IThreadHandle const&amp;)" location="f33:109" file="f33" line="109" endline="109" inline="1">
    <Argument type="_2988" location="f33:109" file="f33" line="109"/>
  </Constructor>
  <Constructor id="_1772" name="IThreadHandle" artificial="1" throw="" context="_1258" access="public" mangled="_ZN9SourceMod13IThreadHandleC1Ev *INTERNAL* " demangled="SourceMod::IThreadHandle::IThreadHandle()" location="f33:109" file="f33" line="109" endline="109" inline="1"/>
  <Destructor id="_1773" name="IThreadHandle" virtual="1" overrides="" context="_1258" access="public" mangled="_ZN9SourceMod13IThreadHandleD1Ev *INTERNAL* " demangled="SourceMod::IThreadHandle::~IThreadHandle()" location="f33:112" file="f33" line="112" endline="112" inline="1">
  </Destructor>
  <Method id="_1774" name="WaitForThread" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1258" access="public" mangled="_ZN9SourceMod13IThreadHandle13WaitForThreadEv" demangled="SourceMod::IThreadHandle::WaitForThread()" location="f33:119" file="f33" line="119" extern="1"/>
  <Method id="_1775" name="DestroyThis" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1258" access="public" mangled="_ZN9SourceMod13IThreadHandle11DestroyThisEv" demangled="SourceMod::IThreadHandle::DestroyThis()" location="f33:124" file="f33" line="124" extern="1"/>
  <Method id="_1776" name="Parent" returns="_2989" virtual="1" pure_virtual="1" overrides="" context="_1258" access="public" mangled="_ZN9SourceMod13IThreadHandle6ParentEv" demangled="SourceMod::IThreadHandle::Parent()" location="f33:131" file="f33" line="131" extern="1"/>
  <Method id="_1777" name="GetParams" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1258" access="public" mangled="_ZN9SourceMod13IThreadHandle9GetParamsEPNS_12ThreadParamsE" demangled="SourceMod::IThreadHandle::GetParams(SourceMod::ThreadParams*)" location="f33:138" file="f33" line="138" extern="1">
    <Argument name="ptparams" type="_2990" location="f33:138" file="f33" line="138"/>
  </Method>
  <Method id="_1778" name="GetPriority" returns="_1316" virtual="1" pure_virtual="1" overrides="" context="_1258" access="public" mangled="_ZN9SourceMod13IThreadHandle11GetPriorityEv" demangled="SourceMod::IThreadHandle::GetPriority()" location="f33:145" file="f33" line="145" extern="1"/>
  <Method id="_1779" name="SetPriority" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1258" access="public" mangled="_ZN9SourceMod13IThreadHandle11SetPriorityENS_14ThreadPriorityE" demangled="SourceMod::IThreadHandle::SetPriority(SourceMod::ThreadPriority)" location="f33:154" file="f33" line="154" extern="1">
    <Argument name="prio" type="_1316" location="f33:154" file="f33" line="154"/>
  </Method>
  <Method id="_1780" name="GetState" returns="_1294" virtual="1" pure_virtual="1" overrides="" context="_1258" access="public" mangled="_ZN9SourceMod13IThreadHandle8GetStateEv" demangled="SourceMod::IThreadHandle::GetState()" location="f33:161" file="f33" line="161" extern="1"/>
  <Method id="_1781" name="Unpause" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1258" access="public" mangled="_ZN9SourceMod13IThreadHandle7UnpauseEv" demangled="SourceMod::IThreadHandle::Unpause()" location="f33:168" file="f33" line="168" extern="1"/>
  <Destructor id="_1782" name="IClientListener" artificial="1" throw="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListenerD1Ev *INTERNAL* " demangled="SourceMod::IClientListener::~IClientListener()" location="f25:245" file="f25" line="245" endline="245" inline="1">
  </Destructor>
  <OperatorMethod id="_1783" name="=" returns="_2991" artificial="1" throw="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListeneraSERKS0_" demangled="SourceMod::IClientListener::operator=(SourceMod::IClientListener const&amp;)" location="f25:245" file="f25" line="245" endline="245" inline="1">
    <Argument type="_2992" location="f25:245" file="f25" line="245"/>
  </OperatorMethod>
  <Constructor id="_1784" name="IClientListener" artificial="1" throw="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListenerC1ERKS0_ *INTERNAL* " demangled="SourceMod::IClientListener::IClientListener(SourceMod::IClientListener const&amp;)" location="f25:245" file="f25" line="245" endline="245" inline="1">
    <Argument type="_2992" location="f25:245" file="f25" line="245"/>
  </Constructor>
  <Constructor id="_1785" name="IClientListener" artificial="1" throw="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListenerC1Ev *INTERNAL* " demangled="SourceMod::IClientListener::IClientListener()" location="f25:245" file="f25" line="245" endline="245" inline="1"/>
  <Method id="_1786" name="GetClientListenerVersion" returns="_92" virtual="1" overrides="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListener24GetClientListenerVersionEv" demangled="SourceMod::IClientListener::GetClientListenerVersion()" location="f25:252" file="f25" line="252" endline="254" inline="1"/>
  <Method id="_1787" name="InterceptClientConnect" returns="_1028" virtual="1" overrides="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListener22InterceptClientConnectEiPcj" demangled="SourceMod::IClientListener::InterceptClientConnect(int, char*, unsigned int)" location="f25:265" file="f25" line="265" endline="267" inline="1">
    <Argument name="client" type="_103" location="f25:265" file="f25" line="265"/>
    <Argument name="error" type="_82" location="f25:265" file="f25" line="265"/>
    <Argument name="maxlength" type="_656" location="f25:265" file="f25" line="265"/>
  </Method>
  <Method id="_1788" name="OnClientConnected" returns="_80" virtual="1" overrides="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListener17OnClientConnectedEi" demangled="SourceMod::IClientListener::OnClientConnected(int)" location="f25:275" file="f25" line="275" inline="1">
    <Argument name="client" type="_103" location="f25:275" file="f25" line="275"/>
  </Method>
  <Method id="_1789" name="OnClientPutInServer" returns="_80" virtual="1" overrides="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListener19OnClientPutInServerEi" demangled="SourceMod::IClientListener::OnClientPutInServer(int)" location="f25:284" file="f25" line="284" inline="1">
    <Argument name="client" type="_103" location="f25:284" file="f25" line="284"/>
  </Method>
  <Method id="_1790" name="OnClientDisconnecting" returns="_80" virtual="1" overrides="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListener21OnClientDisconnectingEi" demangled="SourceMod::IClientListener::OnClientDisconnecting(int)" location="f25:293" file="f25" line="293" inline="1">
    <Argument name="client" type="_103" location="f25:293" file="f25" line="293"/>
  </Method>
  <Method id="_1791" name="OnClientDisconnected" returns="_80" virtual="1" overrides="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListener20OnClientDisconnectedEi" demangled="SourceMod::IClientListener::OnClientDisconnected(int)" location="f25:302" file="f25" line="302" inline="1">
    <Argument name="client" type="_103" location="f25:302" file="f25" line="302"/>
  </Method>
  <Method id="_1792" name="OnClientAuthorized" returns="_80" virtual="1" overrides="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListener18OnClientAuthorizedEiPKc" demangled="SourceMod::IClientListener::OnClientAuthorized(int, char const*)" location="f25:312" file="f25" line="312" inline="1">
    <Argument name="client" type="_103" location="f25:312" file="f25" line="312"/>
    <Argument name="authstring" type="_1006" location="f25:312" file="f25" line="312"/>
  </Method>
  <Method id="_1793" name="OnServerActivated" returns="_80" virtual="1" overrides="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListener17OnServerActivatedEi" demangled="SourceMod::IClientListener::OnServerActivated(int)" location="f25:319" file="f25" line="319" inline="1">
    <Argument name="max_clients" type="_103" location="f25:319" file="f25" line="319"/>
  </Method>
  <Method id="_1794" name="OnClientPreAdminCheck" returns="_1028" virtual="1" overrides="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListener21OnClientPreAdminCheckEi" demangled="SourceMod::IClientListener::OnClientPreAdminCheck(int)" location="f25:340" file="f25" line="340" endline="342" inline="1">
    <Argument name="client" type="_103" location="f25:340" file="f25" line="340"/>
  </Method>
  <Method id="_1795" name="OnClientPostAdminCheck" returns="_80" virtual="1" overrides="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListener22OnClientPostAdminCheckEi" demangled="SourceMod::IClientListener::OnClientPostAdminCheck(int)" location="f25:354" file="f25" line="354" inline="1">
    <Argument name="client" type="_103" location="f25:354" file="f25" line="354"/>
  </Method>
  <Method id="_1796" name="OnMaxPlayersChanged" returns="_80" virtual="1" overrides="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListener19OnMaxPlayersChangedEi" demangled="SourceMod::IClientListener::OnMaxPlayersChanged(int)" location="f25:363" file="f25" line="363" inline="1">
    <Argument name="newvalue" type="_103" location="f25:363" file="f25" line="363"/>
  </Method>
  <Method id="_1797" name="OnClientSettingsChanged" returns="_80" virtual="1" overrides="" context="_1261" access="public" mangled="_ZN9SourceMod15IClientListener23OnClientSettingsChangedEi" demangled="SourceMod::IClientListener::OnClientSettingsChanged(int)" location="f25:372" file="f25" line="372" inline="1">
    <Argument name="client" type="_103" location="f25:372" file="f25" line="372"/>
  </Method>
  <Destructor id="_1798" name="IHandleTypeDispatch" artificial="1" throw="" context="_1262" access="public" mangled="_ZN9SourceMod19IHandleTypeDispatchD1Ev *INTERNAL* " demangled="SourceMod::IHandleTypeDispatch::~IHandleTypeDispatch()" location="f38:188" file="f38" line="188" endline="188" inline="1">
  </Destructor>
  <OperatorMethod id="_1799" name="=" returns="_2993" artificial="1" throw="" context="_1262" access="public" mangled="_ZN9SourceMod19IHandleTypeDispatchaSERKS0_" demangled="SourceMod::IHandleTypeDispatch::operator=(SourceMod::IHandleTypeDispatch const&amp;)" location="f38:188" file="f38" line="188" endline="188" inline="1">
    <Argument type="_2994" location="f38:188" file="f38" line="188"/>
  </OperatorMethod>
  <Constructor id="_1800" name="IHandleTypeDispatch" artificial="1" throw="" context="_1262" access="public" mangled="_ZN9SourceMod19IHandleTypeDispatchC1ERKS0_ *INTERNAL* " demangled="SourceMod::IHandleTypeDispatch::IHandleTypeDispatch(SourceMod::IHandleTypeDispatch const&amp;)" location="f38:188" file="f38" line="188" endline="188" inline="1">
    <Argument type="_2994" location="f38:188" file="f38" line="188"/>
  </Constructor>
  <Constructor id="_1801" name="IHandleTypeDispatch" artificial="1" throw="" context="_1262" access="public" mangled="_ZN9SourceMod19IHandleTypeDispatchC1Ev *INTERNAL* " demangled="SourceMod::IHandleTypeDispatch::IHandleTypeDispatch()" location="f38:188" file="f38" line="188" endline="188" inline="1"/>
  <Method id="_1802" name="GetDispatchVersion" returns="_92" virtual="1" overrides="" context="_1262" access="public" mangled="_ZN9SourceMod19IHandleTypeDispatch18GetDispatchVersionEv" demangled="SourceMod::IHandleTypeDispatch::GetDispatchVersion()" location="f38:191" file="f38" line="191" endline="193" inline="1"/>
  <Method id="_1803" name="OnHandleDestroy" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1262" access="public" mangled="_ZN9SourceMod19IHandleTypeDispatch15OnHandleDestroyEjPv" demangled="SourceMod::IHandleTypeDispatch::OnHandleDestroy(unsigned int, void*)" location="f38:202" file="f38" line="202" extern="1">
    <Argument name="type" type="_1354" location="f38:202" file="f38" line="202"/>
    <Argument name="object" type="_296" location="f38:202" file="f38" line="202"/>
  </Method>
  <Method id="_1804" name="GetHandleApproxSize" returns="_1028" virtual="1" overrides="" context="_1262" access="public" mangled="_ZN9SourceMod19IHandleTypeDispatch19GetHandleApproxSizeEjPvPj" demangled="SourceMod::IHandleTypeDispatch::GetHandleApproxSize(unsigned int, void*, unsigned int*)" location="f38:213" file="f38" line="213" endline="215" inline="1">
    <Argument name="type" type="_1354" location="f38:213" file="f38" line="213"/>
    <Argument name="object" type="_296" location="f38:213" file="f38" line="213"/>
    <Argument name="pSize" type="_2980" location="f38:213" file="f38" line="213"/>
  </Method>
  <Destructor id="_1805" name="IPlayerManager" artificial="1" throw="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManagerD1Ev *INTERNAL* " demangled="SourceMod::IPlayerManager::~IPlayerManager()" location="f25:432" file="f25" line="432" endline="432" inline="1">
  </Destructor>
  <OperatorMethod id="_1806" name="=" returns="_2995" artificial="1" throw="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManageraSERKS0_" demangled="SourceMod::IPlayerManager::operator=(SourceMod::IPlayerManager const&amp;)" location="f25:432" file="f25" line="432" endline="432" inline="1">
    <Argument type="_2996" location="f25:432" file="f25" line="432"/>
  </OperatorMethod>
  <Constructor id="_1807" name="IPlayerManager" artificial="1" throw="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManagerC1ERKS0_ *INTERNAL* " demangled="SourceMod::IPlayerManager::IPlayerManager(SourceMod::IPlayerManager const&amp;)" location="f25:432" file="f25" line="432" endline="432" inline="1">
    <Argument type="_2996" location="f25:432" file="f25" line="432"/>
  </Constructor>
  <Constructor id="_1808" name="IPlayerManager" artificial="1" throw="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManagerC1Ev *INTERNAL* " demangled="SourceMod::IPlayerManager::IPlayerManager()" location="f25:432" file="f25" line="432" endline="432" inline="1"/>
  <Method id="_1809" name="GetInterfaceName" returns="_1006" virtual="1" overrides="_2598 " context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager16GetInterfaceNameEv" demangled="SourceMod::IPlayerManager::GetInterfaceName()" location="f25:434" file="f25" line="434" endline="436" inline="1"/>
  <Method id="_1810" name="GetInterfaceVersion" returns="_92" virtual="1" overrides="_2597 " context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager19GetInterfaceVersionEv" demangled="SourceMod::IPlayerManager::GetInterfaceVersion()" location="f25:438" file="f25" line="438" endline="440" inline="1"/>
  <Method id="_1811" name="AddClientListener" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager17AddClientListenerEPNS_15IClientListenerE" demangled="SourceMod::IPlayerManager::AddClientListener(SourceMod::IClientListener*)" location="f25:448" file="f25" line="448" extern="1">
    <Argument name="listener" type="_2997" location="f25:448" file="f25" line="448"/>
  </Method>
  <Method id="_1812" name="RemoveClientListener" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager20RemoveClientListenerEPNS_15IClientListenerE" demangled="SourceMod::IPlayerManager::RemoveClientListener(SourceMod::IClientListener*)" location="f25:455" file="f25" line="455" extern="1">
    <Argument name="listener" type="_2997" location="f25:455" file="f25" line="455"/>
  </Method>
  <Method id="_1813" name="GetGamePlayer" returns="_2998" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager13GetGamePlayerEi" demangled="SourceMod::IPlayerManager::GetGamePlayer(int)" location="f25:466" file="f25" line="466" extern="1">
    <Argument name="client" type="_103" location="f25:466" file="f25" line="466"/>
  </Method>
  <Method id="_1814" name="GetGamePlayer" returns="_2998" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager13GetGamePlayerEP7edict_t" demangled="SourceMod::IPlayerManager::GetGamePlayer(edict_t*)" location="f25:474" file="f25" line="474" extern="1">
    <Argument name="pEdict" type="_2959" location="f25:474" file="f25" line="474"/>
  </Method>
  <Method id="_1815" name="GetMaxClients" returns="_103" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager13GetMaxClientsEv" demangled="SourceMod::IPlayerManager::GetMaxClients()" location="f25:483" file="f25" line="483" extern="1"/>
  <Method id="_1816" name="GetNumPlayers" returns="_103" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager13GetNumPlayersEv" demangled="SourceMod::IPlayerManager::GetNumPlayers()" location="f25:490" file="f25" line="490" extern="1"/>
  <Method id="_1817" name="GetClientOfUserId" returns="_103" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager17GetClientOfUserIdEi" demangled="SourceMod::IPlayerManager::GetClientOfUserId(int)" location="f25:498" file="f25" line="498" extern="1">
    <Argument name="userid" type="_103" location="f25:498" file="f25" line="498"/>
  </Method>
  <Method id="_1818" name="IsServerActivated" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager17IsServerActivatedEv" demangled="SourceMod::IPlayerManager::IsServerActivated()" location="f25:506" file="f25" line="506" extern="1"/>
  <Method id="_1819" name="GetReplyTo" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager10GetReplyToEv" demangled="SourceMod::IPlayerManager::GetReplyTo()" location="f25:513" file="f25" line="513" extern="1"/>
  <Method id="_1820" name="SetReplyTo" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager10SetReplyToEj" demangled="SourceMod::IPlayerManager::SetReplyTo(unsigned int)" location="f25:521" file="f25" line="521" extern="1">
    <Argument name="reply" type="_92" location="f25:521" file="f25" line="521"/>
  </Method>
  <Method id="_1821" name="FilterCommandTarget" returns="_103" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager19FilterCommandTargetEPNS_11IGamePlayerES2_i" demangled="SourceMod::IPlayerManager::FilterCommandTarget(SourceMod::IGamePlayer*, SourceMod::IGamePlayer*, int)" location="f25:531" file="f25" line="531" extern="1">
    <Argument name="pAdmin" type="_2998" location="f25:531" file="f25" line="531"/>
    <Argument name="pTarget" type="_2998" location="f25:531" file="f25" line="531"/>
    <Argument name="flags" type="_103" location="f25:531" file="f25" line="531"/>
  </Method>
  <Method id="_1822" name="RegisterCommandTargetProcessor" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager30RegisterCommandTargetProcessorEPNS_23ICommandTargetProcessorE" demangled="SourceMod::IPlayerManager::RegisterCommandTargetProcessor(SourceMod::ICommandTargetProcessor*)" location="f25:538" file="f25" line="538" extern="1">
    <Argument name="pHandler" type="_2999" location="f25:538" file="f25" line="538"/>
  </Method>
  <Method id="_1823" name="UnregisterCommandTargetProcessor" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager32UnregisterCommandTargetProcessorEPNS_23ICommandTargetProcessorE" demangled="SourceMod::IPlayerManager::UnregisterCommandTargetProcessor(SourceMod::ICommandTargetProcessor*)" location="f25:545" file="f25" line="545" extern="1">
    <Argument name="pHandler" type="_2999" location="f25:545" file="f25" line="545"/>
  </Method>
  <Method id="_1824" name="GetClientFromSerial" returns="_103" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager19GetClientFromSerialEj" demangled="SourceMod::IPlayerManager::GetClientFromSerial(unsigned int)" location="f25:552" file="f25" line="552" extern="1">
    <Argument name="serial" type="_92" location="f25:552" file="f25" line="552"/>
  </Method>
  <Method id="_1825" name="ProcessCommandTarget" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1263" access="public" mangled="_ZN9SourceMod14IPlayerManager20ProcessCommandTargetEPNS_17cmd_target_info_tE" demangled="SourceMod::IPlayerManager::ProcessCommandTarget(SourceMod::cmd_target_info_t*)" location="f25:560" file="f25" line="560" extern="1">
    <Argument name="info" type="_3000" location="f25:560" file="f25" line="560"/>
  </Method>
  <Destructor id="_1826" name="ITextParsers" artificial="1" throw="" context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsersD1Ev *INTERNAL* " demangled="SourceMod::ITextParsers::~ITextParsers()" location="f16:319" file="f16" line="319" endline="319" inline="1">
  </Destructor>
  <OperatorMethod id="_1827" name="=" returns="_3001" artificial="1" throw="" context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsersaSERKS0_" demangled="SourceMod::ITextParsers::operator=(SourceMod::ITextParsers const&amp;)" location="f16:319" file="f16" line="319" endline="319" inline="1">
    <Argument type="_3002" location="f16:319" file="f16" line="319"/>
  </OperatorMethod>
  <Constructor id="_1828" name="ITextParsers" artificial="1" throw="" context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsersC1ERKS0_ *INTERNAL* " demangled="SourceMod::ITextParsers::ITextParsers(SourceMod::ITextParsers const&amp;)" location="f16:319" file="f16" line="319" endline="319" inline="1">
    <Argument type="_3002" location="f16:319" file="f16" line="319"/>
  </Constructor>
  <Constructor id="_1829" name="ITextParsers" artificial="1" throw="" context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsersC1Ev *INTERNAL* " demangled="SourceMod::ITextParsers::ITextParsers()" location="f16:319" file="f16" line="319" endline="319" inline="1"/>
  <Method id="_1830" name="GetInterfaceName" returns="_1006" virtual="1" overrides="_2598 " context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsers16GetInterfaceNameEv" demangled="SourceMod::ITextParsers::GetInterfaceName()" location="f16:321" file="f16" line="321" endline="323" inline="1"/>
  <Method id="_1831" name="GetInterfaceVersion" returns="_92" virtual="1" overrides="_2597 " context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsers19GetInterfaceVersionEv" demangled="SourceMod::ITextParsers::GetInterfaceVersion()" location="f16:325" file="f16" line="325" endline="327" inline="1"/>
  <Method id="_1832" name="IsVersionCompatible" returns="_1028" virtual="1" overrides="_2599 " context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsers19IsVersionCompatibleEj" demangled="SourceMod::ITextParsers::IsVersionCompatible(unsigned int)" location="f16:329" file="f16" line="329" endline="335" inline="1">
    <Argument name="version" type="_92" location="f16:329" file="f16" line="329"/>
  </Method>
  <Method id="_1833" name="ParseFile_INI" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsers13ParseFile_INIEPKcPNS_17ITextListener_INIEPjS5_" demangled="SourceMod::ITextParsers::ParseFile_INI(char const*, SourceMod::ITextListener_INI*, unsigned int*, unsigned int*)" location="f16:350" file="f16" line="350" extern="1">
    <Argument name="file" type="_1006" location="f16:350" file="f16" line="350"/>
    <Argument name="ini_listener" type="_3003" location="f16:350" file="f16" line="350"/>
    <Argument name="line" type="_2980" location="f16:350" file="f16" line="350"/>
    <Argument name="col" type="_2980" location="f16:350" file="f16" line="350"/>
  </Method>
  <Method id="_1834" name="ParseFile_SMC" returns="_1277" virtual="1" pure_virtual="1" overrides="" context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsers13ParseFile_SMCEPKcPNS_17ITextListener_SMCEPNS_9SMCStatesE" demangled="SourceMod::ITextParsers::ParseFile_SMC(char const*, SourceMod::ITextListener_SMC*, SourceMod::SMCStates*)" location="f16:365" file="f16" line="365" extern="1">
    <Argument name="file" type="_1006" location="f16:365" file="f16" line="365"/>
    <Argument name="smc_listener" type="_3004" location="f16:365" file="f16" line="365"/>
    <Argument name="states" type="_3005" location="f16:365" file="f16" line="365"/>
  </Method>
  <Method id="_1835" name="GetSMCErrorString" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsers17GetSMCErrorStringENS_8SMCErrorE" demangled="SourceMod::ITextParsers::GetSMCErrorString(SourceMod::SMCError)" location="f16:373" file="f16" line="373" extern="1">
    <Argument name="err" type="_1277" location="f16:373" file="f16" line="373"/>
  </Method>
  <Method id="_1836" name="GetUTF8CharBytes" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsers16GetUTF8CharBytesEPKc" demangled="SourceMod::ITextParsers::GetUTF8CharBytes(char const*)" location="f16:383" file="f16" line="383" extern="1">
    <Argument name="stream" type="_1006" location="f16:383" file="f16" line="383"/>
  </Method>
  <Method id="_1837" name="IsWhitespace" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsers12IsWhitespaceEPKc" demangled="SourceMod::ITextParsers::IsWhitespace(char const*)" location="f16:392" file="f16" line="392" extern="1">
    <Argument name="stream" type="_1006" location="f16:392" file="f16" line="392"/>
  </Method>
  <Method id="_1838" name="ParseSMCFile" returns="_1277" virtual="1" pure_virtual="1" overrides="" context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsers12ParseSMCFileEPKcPNS_17ITextListener_SMCEPNS_9SMCStatesEPcj" demangled="SourceMod::ITextParsers::ParseSMCFile(char const*, SourceMod::ITextListener_SMC*, SourceMod::SMCStates*, char*, unsigned int)" location="f16:408" file="f16" line="408" extern="1">
    <Argument name="file" type="_1006" location="f16:408" file="f16" line="408"/>
    <Argument name="smc_listener" type="_3004" location="f16:408" file="f16" line="408"/>
    <Argument name="states" type="_3005" location="f16:408" file="f16" line="408"/>
    <Argument name="buffer" type="_82" location="f16:408" file="f16" line="408"/>
    <Argument name="maxsize" type="_656" location="f16:408" file="f16" line="408"/>
  </Method>
  <Method id="_1839" name="ParseSMCStream" returns="_1277" virtual="1" pure_virtual="1" overrides="" context="_1264" access="public" mangled="_ZN9SourceMod12ITextParsers14ParseSMCStreamEPKcjPNS_17ITextListener_SMCEPNS_9SMCStatesEPcj" demangled="SourceMod::ITextParsers::ParseSMCStream(char const*, unsigned int, SourceMod::ITextListener_SMC*, SourceMod::SMCStates*, char*, unsigned int)" location="f16:426" file="f16" line="426" extern="1">
    <Argument name="stream" type="_1006" location="f16:426" file="f16" line="426"/>
    <Argument name="length" type="_656" location="f16:426" file="f16" line="426"/>
    <Argument name="smc_listener" type="_3004" location="f16:426" file="f16" line="426"/>
    <Argument name="states" type="_3005" location="f16:426" file="f16" line="426"/>
    <Argument name="buffer" type="_82" location="f16:426" file="f16" line="426"/>
    <Argument name="maxsize" type="_656" location="f16:426" file="f16" line="426"/>
  </Method>
  <Field id="_1840" name="szPhrase" type="_1006" offset="0" context="_1265" access="public" location="f22:80" file="f22" line="80"/>
  <Field id="_1841" name="fmt_count" type="_92" offset="32" context="_1265" access="public" location="f22:81" file="f22" line="81"/>
  <Field id="_1842" name="fmt_order" type="_1214" offset="64" context="_1265" access="public" location="f22:82" file="f22" line="82"/>
  <Destructor id="_1843" name="Translation" artificial="1" throw="" context="_1265" access="public" mangled="_ZN9SourceMod11TranslationD1Ev *INTERNAL* " demangled="SourceMod::Translation::~Translation()" location="f22:79" file="f22" line="79" endline="79" inline="1">
  </Destructor>
  <OperatorMethod id="_1844" name="=" returns="_3006" artificial="1" throw="" context="_1265" access="public" mangled="_ZN9SourceMod11TranslationaSERKS0_" demangled="SourceMod::Translation::operator=(SourceMod::Translation const&amp;)" location="f22:79" file="f22" line="79" endline="79" inline="1">
    <Argument type="_3007" location="f22:79" file="f22" line="79"/>
  </OperatorMethod>
  <Constructor id="_1845" name="Translation" artificial="1" throw="" context="_1265" access="public" mangled="_ZN9SourceMod11TranslationC1ERKS0_ *INTERNAL* " demangled="SourceMod::Translation::Translation(SourceMod::Translation const&amp;)" location="f22:79" file="f22" line="79" endline="79" inline="1">
    <Argument type="_3007" location="f22:79" file="f22" line="79"/>
  </Constructor>
  <Constructor id="_1846" name="Translation" artificial="1" throw="" context="_1265" access="public" mangled="_ZN9SourceMod11TranslationC1Ev *INTERNAL* " demangled="SourceMod::Translation::Translation()" location="f22:79" file="f22" line="79" inline="1"/>
  <Destructor id="_1847" name="IMapTimer" artificial="1" throw="" context="_1267" access="public" mangled="_ZN9SourceMod9IMapTimerD1Ev *INTERNAL* " demangled="SourceMod::IMapTimer::~IMapTimer()" location="f46:55" file="f46" line="55" endline="55" inline="1">
  </Destructor>
  <OperatorMethod id="_1848" name="=" returns="_3008" artificial="1" throw="" context="_1267" access="public" mangled="_ZN9SourceMod9IMapTimeraSERKS0_" demangled="SourceMod::IMapTimer::operator=(SourceMod::IMapTimer const&amp;)" location="f46:55" file="f46" line="55" endline="55" inline="1">
    <Argument type="_3009" location="f46:55" file="f46" line="55"/>
  </OperatorMethod>
  <Constructor id="_1849" name="IMapTimer" artificial="1" throw="" context="_1267" access="public" mangled="_ZN9SourceMod9IMapTimerC1ERKS0_ *INTERNAL* " demangled="SourceMod::IMapTimer::IMapTimer(SourceMod::IMapTimer const&amp;)" location="f46:55" file="f46" line="55" endline="55" inline="1">
    <Argument type="_3009" location="f46:55" file="f46" line="55"/>
  </Constructor>
  <Constructor id="_1850" name="IMapTimer" artificial="1" throw="" context="_1267" access="public" mangled="_ZN9SourceMod9IMapTimerC1Ev *INTERNAL* " demangled="SourceMod::IMapTimer::IMapTimer()" location="f46:55" file="f46" line="55" endline="55" inline="1"/>
  <Method id="_1851" name="GetMapTimeLimit" returns="_103" virtual="1" pure_virtual="1" overrides="" context="_1267" access="public" mangled="_ZN9SourceMod9IMapTimer15GetMapTimeLimitEv" demangled="SourceMod::IMapTimer::GetMapTimeLimit()" location="f46:63" file="f46" line="63" extern="1"/>
  <Method id="_1852" name="ExtendMapTimeLimit" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1267" access="public" mangled="_ZN9SourceMod9IMapTimer18ExtendMapTimeLimitEi" demangled="SourceMod::IMapTimer::ExtendMapTimeLimit(int)" location="f46:71" file="f46" line="71" extern="1">
    <Argument name="extra_time" type="_103" location="f46:71" file="f46" line="71"/>
  </Method>
  <Method id="_1853" name="SetMapTimerStatus" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1267" access="public" mangled="_ZN9SourceMod9IMapTimer17SetMapTimerStatusEb" demangled="SourceMod::IMapTimer::SetMapTimerStatus(bool)" location="f46:81" file="f46" line="81" extern="1">
    <Argument name="enabled" type="_1028" location="f46:81" file="f46" line="81"/>
  </Method>
  <Destructor id="_1854" name="IPhraseCollection" artificial="1" throw="" context="_1269" access="public" mangled="_ZN9SourceMod17IPhraseCollectionD1Ev *INTERNAL* " demangled="SourceMod::IPhraseCollection::~IPhraseCollection()" location="f22:122" file="f22" line="122" endline="122" inline="1">
  </Destructor>
  <OperatorMethod id="_1855" name="=" returns="_3010" artificial="1" throw="" context="_1269" access="public" mangled="_ZN9SourceMod17IPhraseCollectionaSERKS0_" demangled="SourceMod::IPhraseCollection::operator=(SourceMod::IPhraseCollection const&amp;)" location="f22:122" file="f22" line="122" endline="122" inline="1">
    <Argument type="_3011" location="f22:122" file="f22" line="122"/>
  </OperatorMethod>
  <Constructor id="_1856" name="IPhraseCollection" artificial="1" throw="" context="_1269" access="public" mangled="_ZN9SourceMod17IPhraseCollectionC1ERKS0_ *INTERNAL* " demangled="SourceMod::IPhraseCollection::IPhraseCollection(SourceMod::IPhraseCollection const&amp;)" location="f22:122" file="f22" line="122" endline="122" inline="1">
    <Argument type="_3011" location="f22:122" file="f22" line="122"/>
  </Constructor>
  <Constructor id="_1857" name="IPhraseCollection" artificial="1" throw="" context="_1269" access="public" mangled="_ZN9SourceMod17IPhraseCollectionC1Ev *INTERNAL* " demangled="SourceMod::IPhraseCollection::IPhraseCollection()" location="f22:122" file="f22" line="122" endline="122" inline="1"/>
  <Method id="_1858" name="AddPhraseFile" returns="_3012" virtual="1" pure_virtual="1" overrides="" context="_1269" access="public" mangled="_ZN9SourceMod17IPhraseCollection13AddPhraseFileEPKc" demangled="SourceMod::IPhraseCollection::AddPhraseFile(char const*)" location="f22:138" file="f22" line="138" extern="1">
    <Argument name="filename" type="_1006" location="f22:138" file="f22" line="138"/>
  </Method>
  <Method id="_1859" name="GetFileCount" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1269" access="public" mangled="_ZN9SourceMod17IPhraseCollection12GetFileCountEv" demangled="SourceMod::IPhraseCollection::GetFileCount()" location="f22:145" file="f22" line="145" extern="1"/>
  <Method id="_1860" name="GetFile" returns="_3012" virtual="1" pure_virtual="1" overrides="" context="_1269" access="public" mangled="_ZN9SourceMod17IPhraseCollection7GetFileEj" demangled="SourceMod::IPhraseCollection::GetFile(unsigned int)" location="f22:154" file="f22" line="154" extern="1">
    <Argument name="file" type="_92" location="f22:154" file="f22" line="154"/>
  </Method>
  <Method id="_1861" name="Destroy" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1269" access="public" mangled="_ZN9SourceMod17IPhraseCollection7DestroyEv" demangled="SourceMod::IPhraseCollection::Destroy()" location="f22:160" file="f22" line="160" extern="1"/>
  <Method id="_1862" name="FindTranslation" returns="_1280" virtual="1" pure_virtual="1" overrides="" context="_1269" access="public" mangled="_ZN9SourceMod17IPhraseCollection15FindTranslationEPKcjPNS_11TranslationE" demangled="SourceMod::IPhraseCollection::FindTranslation(char const*, unsigned int, SourceMod::Translation*)" location="f22:177" file="f22" line="177" extern="1">
    <Argument name="key" type="_1006" location="f22:177" file="f22" line="177"/>
    <Argument name="langid" type="_92" location="f22:177" file="f22" line="177"/>
    <Argument name="pTrans" type="_3013" location="f22:177" file="f22" line="177"/>
  </Method>
  <Method id="_1863" name="FormatString" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1269" access="public" mangled="_ZN9SourceMod17IPhraseCollection12FormatStringEPcjPKcPPvjPjPS3_" demangled="SourceMod::IPhraseCollection::FormatString(char*, unsigned int, char const*, void**, unsigned int, unsigned int*, char const**)" location="f22:223" file="f22" line="223" extern="1">
    <Argument name="buffer" type="_82" location="f22:223" file="f22" line="223"/>
    <Argument name="maxlength" type="_656" location="f22:223" file="f22" line="223"/>
    <Argument name="format" type="_1006" location="f22:223" file="f22" line="223"/>
    <Argument name="params" type="_1124" location="f22:223" file="f22" line="223"/>
    <Argument name="numparams" type="_92" location="f22:223" file="f22" line="223"/>
    <Argument name="pOutLength" type="_1066" location="f22:223" file="f22" line="223"/>
    <Argument name="pFailPhrase" type="_2979" location="f22:223" file="f22" line="223"/>
  </Method>
  <Destructor id="_1864" name="IShareSys" artificial="1" throw="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSysD1Ev *INTERNAL* " demangled="SourceMod::IShareSys::~IShareSys()" location="f42:127" file="f42" line="127" endline="127" inline="1">
  </Destructor>
  <OperatorMethod id="_1865" name="=" returns="_3014" artificial="1" throw="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSysaSERKS0_" demangled="SourceMod::IShareSys::operator=(SourceMod::IShareSys const&amp;)" location="f42:127" file="f42" line="127" endline="127" inline="1">
    <Argument type="_3015" location="f42:127" file="f42" line="127"/>
  </OperatorMethod>
  <Constructor id="_1866" name="IShareSys" artificial="1" throw="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSysC1ERKS0_ *INTERNAL* " demangled="SourceMod::IShareSys::IShareSys(SourceMod::IShareSys const&amp;)" location="f42:127" file="f42" line="127" endline="127" inline="1">
    <Argument type="_3015" location="f42:127" file="f42" line="127"/>
  </Constructor>
  <Constructor id="_1867" name="IShareSys" artificial="1" throw="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSysC1Ev *INTERNAL* " demangled="SourceMod::IShareSys::IShareSys()" location="f42:127" file="f42" line="127" endline="127" inline="1"/>
  <Method id="_1868" name="AddInterface" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSys12AddInterfaceEPNS_10IExtensionEPNS_11SMInterfaceE" demangled="SourceMod::IShareSys::AddInterface(SourceMod::IExtension*, SourceMod::SMInterface*)" location="f42:136" file="f42" line="136" extern="1">
    <Argument name="myself" type="_1556" location="f42:136" file="f42" line="136"/>
    <Argument name="iface" type="_2958" location="f42:136" file="f42" line="136"/>
  </Method>
  <Method id="_1869" name="RequestInterface" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSys16RequestInterfaceEPKcjPNS_10IExtensionEPPNS_11SMInterfaceE" demangled="SourceMod::IShareSys::RequestInterface(char const*, unsigned int, SourceMod::IExtension*, SourceMod::SMInterface**)" location="f42:150" file="f42" line="150" extern="1">
    <Argument name="iface_name" type="_1006" location="f42:150" file="f42" line="150"/>
    <Argument name="iface_vers" type="_92" location="f42:150" file="f42" line="150"/>
    <Argument name="myself" type="_1556" location="f42:150" file="f42" line="150"/>
    <Argument name="pIface" type="_3016" location="f42:150" file="f42" line="150"/>
  </Method>
  <Method id="_1870" name="AddNatives" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSys10AddNativesEPNS_10IExtensionEPK15sp_nativeinfo_s" demangled="SourceMod::IShareSys::AddNatives(SourceMod::IExtension*, sp_nativeinfo_s const*)" location="f42:166" file="f42" line="166" extern="1">
    <Argument name="myself" type="_1556" location="f42:166" file="f42" line="166"/>
    <Argument name="natives" type="_3017" location="f42:166" file="f42" line="166"/>
  </Method>
  <Method id="_1871" name="CreateIdentType" returns="_1348" virtual="1" pure_virtual="1" overrides="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSys15CreateIdentTypeEPKc" demangled="SourceMod::IShareSys::CreateIdentType(char const*)" location="f42:176" file="f42" line="176" extern="1">
    <Argument name="name" type="_1006" location="f42:176" file="f42" line="176"/>
  </Method>
  <Method id="_1872" name="FindIdentType" returns="_1348" virtual="1" pure_virtual="1" overrides="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSys13FindIdentTypeEPKc" demangled="SourceMod::IShareSys::FindIdentType(char const*)" location="f42:188" file="f42" line="188" extern="1">
    <Argument name="name" type="_1006" location="f42:188" file="f42" line="188"/>
  </Method>
  <Method id="_1873" name="CreateIdentity" returns="_3018" virtual="1" pure_virtual="1" overrides="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSys14CreateIdentityEjPv" demangled="SourceMod::IShareSys::CreateIdentity(unsigned int, void*)" location="f42:198" file="f42" line="198" extern="1">
    <Argument name="type" type="_1348" location="f42:198" file="f42" line="198"/>
    <Argument name="ptr" type="_296" location="f42:198" file="f42" line="198"/>
  </Method>
  <Method id="_1874" name="DestroyIdentType" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSys16DestroyIdentTypeEj" demangled="SourceMod::IShareSys::DestroyIdentType(unsigned int)" location="f42:206" file="f42" line="206" extern="1">
    <Argument name="type" type="_1348" location="f42:206" file="f42" line="206"/>
  </Method>
  <Method id="_1875" name="DestroyIdentity" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSys15DestroyIdentityEPNS_15IdentityToken_tE" demangled="SourceMod::IShareSys::DestroyIdentity(SourceMod::IdentityToken_t*)" location="f42:214" file="f42" line="214" extern="1">
    <Argument name="identity" type="_3018" location="f42:214" file="f42" line="214"/>
  </Method>
  <Method id="_1876" name="AddDependency" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSys13AddDependencyEPNS_10IExtensionEPKcbb" demangled="SourceMod::IShareSys::AddDependency(SourceMod::IExtension*, char const*, bool, bool)" location="f42:226" file="f42" line="226" extern="1">
    <Argument name="myself" type="_1556" location="f42:226" file="f42" line="226"/>
    <Argument name="filename" type="_1006" location="f42:226" file="f42" line="226"/>
    <Argument name="require" type="_1028" location="f42:226" file="f42" line="226"/>
    <Argument name="autoload" type="_1028" location="f42:226" file="f42" line="226"/>
  </Method>
  <Method id="_1877" name="RegisterLibrary" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSys15RegisterLibraryEPNS_10IExtensionEPKc" demangled="SourceMod::IShareSys::RegisterLibrary(SourceMod::IExtension*, char const*)" location="f42:234" file="f42" line="234" extern="1">
    <Argument name="myself" type="_1556" location="f42:234" file="f42" line="234"/>
    <Argument name="name" type="_1006" location="f42:234" file="f42" line="234"/>
  </Method>
  <Method id="_1878" name="OverrideNatives" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSys15OverrideNativesEPNS_10IExtensionEPK15sp_nativeinfo_s" demangled="SourceMod::IShareSys::OverrideNatives(SourceMod::IExtension*, sp_nativeinfo_s const*)" location="f42:255" file="f42" line="255" extern="1">
    <Argument name="myself" type="_1556" location="f42:255" file="f42" line="255"/>
    <Argument name="natives" type="_3017" location="f42:255" file="f42" line="255"/>
  </Method>
  <Method id="_1879" name="AddCapabilityProvider" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSys21AddCapabilityProviderEPNS_10IExtensionEPNS_16IFeatureProviderEPKc" demangled="SourceMod::IShareSys::AddCapabilityProvider(SourceMod::IExtension*, SourceMod::IFeatureProvider*, char const*)" location="f42:269" file="f42" line="269" extern="1">
    <Argument name="myself" type="_1556" location="f42:269" file="f42" line="269"/>
    <Argument name="provider" type="_3019" location="f42:269" file="f42" line="269"/>
    <Argument name="name" type="_1006" location="f42:269" file="f42" line="269"/>
  </Method>
  <Method id="_1880" name="DropCapabilityProvider" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1272" access="public" mangled="_ZN9SourceMod9IShareSys22DropCapabilityProviderEPNS_10IExtensionEPNS_16IFeatureProviderEPKc" demangled="SourceMod::IShareSys::DropCapabilityProvider(SourceMod::IExtension*, SourceMod::IFeatureProvider*, char const*)" location="f42:280" file="f42" line="280" extern="1">
    <Argument name="myself" type="_1556" location="f42:280" file="f42" line="280"/>
    <Argument name="provider" type="_3019" location="f42:280" file="f42" line="280"/>
    <Argument name="name" type="_1006" location="f42:280" file="f42" line="280"/>
  </Method>
  <Destructor id="_1881" name="IHandleSys" artificial="1" throw="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSysD1Ev *INTERNAL* " demangled="SourceMod::IHandleSys::~IHandleSys()" location="f38:223" file="f38" line="223" endline="223" inline="1">
  </Destructor>
  <OperatorMethod id="_1882" name="=" returns="_3020" artificial="1" throw="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSysaSERKS0_" demangled="SourceMod::IHandleSys::operator=(SourceMod::IHandleSys const&amp;)" location="f38:223" file="f38" line="223" endline="223" inline="1">
    <Argument type="_3021" location="f38:223" file="f38" line="223"/>
  </OperatorMethod>
  <Constructor id="_1883" name="IHandleSys" artificial="1" throw="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSysC1ERKS0_ *INTERNAL* " demangled="SourceMod::IHandleSys::IHandleSys(SourceMod::IHandleSys const&amp;)" location="f38:223" file="f38" line="223" endline="223" inline="1">
    <Argument type="_3021" location="f38:223" file="f38" line="223"/>
  </Constructor>
  <Constructor id="_1884" name="IHandleSys" artificial="1" throw="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSysC1Ev *INTERNAL* " demangled="SourceMod::IHandleSys::IHandleSys()" location="f38:223" file="f38" line="223" endline="223" inline="1"/>
  <Method id="_1885" name="GetInterfaceVersion" returns="_92" virtual="1" overrides="_2597 " context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSys19GetInterfaceVersionEv" demangled="SourceMod::IHandleSys::GetInterfaceVersion()" location="f38:225" file="f38" line="225" endline="227" inline="1"/>
  <Method id="_1886" name="GetInterfaceName" returns="_1006" virtual="1" overrides="_2598 " context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSys16GetInterfaceNameEv" demangled="SourceMod::IHandleSys::GetInterfaceName()" location="f38:229" file="f38" line="229" endline="231" inline="1"/>
  <Method id="_1887" name="CreateType" returns="_1354" virtual="1" pure_virtual="1" overrides="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSys10CreateTypeEPKcPNS_19IHandleTypeDispatchEjPKNS_10TypeAccessEPKNS_12HandleAccessEPNS_15IdentityToken_tEPNS_11HandleErrorE" demangled="SourceMod::IHandleSys::CreateType(char const*, SourceMod::IHandleTypeDispatch*, unsigned int, SourceMod::TypeAccess const*, SourceMod::HandleAccess const*, SourceMod::IdentityToken_t*, SourceMod::HandleError*)" location="f38:258" file="f38" line="258" extern="1">
    <Argument name="name" type="_1006" location="f38:258" file="f38" line="258"/>
    <Argument name="dispatch" type="_3022" location="f38:258" file="f38" line="258"/>
    <Argument name="parent" type="_1354" location="f38:258" file="f38" line="258"/>
    <Argument name="typeAccess" type="_3023" location="f38:258" file="f38" line="258"/>
    <Argument name="hndlAccess" type="_3024" location="f38:258" file="f38" line="258"/>
    <Argument name="ident" type="_3018" location="f38:258" file="f38" line="258"/>
    <Argument name="err" type="_3025" location="f38:258" file="f38" line="258"/>
  </Method>
  <Method id="_1888" name="RemoveType" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSys10RemoveTypeEjPNS_15IdentityToken_tE" demangled="SourceMod::IHandleSys::RemoveType(unsigned int, SourceMod::IdentityToken_t*)" location="f38:268" file="f38" line="268" extern="1">
    <Argument name="type" type="_1354" location="f38:268" file="f38" line="268"/>
    <Argument name="ident" type="_3018" location="f38:268" file="f38" line="268"/>
  </Method>
  <Method id="_1889" name="FindHandleType" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSys14FindHandleTypeEPKcPj" demangled="SourceMod::IHandleSys::FindHandleType(char const*, unsigned int*)" location="f38:277" file="f38" line="277" extern="1">
    <Argument name="name" type="_1006" location="f38:277" file="f38" line="277"/>
    <Argument name="type" type="_3026" location="f38:277" file="f38" line="277"/>
  </Method>
  <Method id="_1890" name="CreateHandle" returns="_1270" virtual="1" pure_virtual="1" overrides="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSys12CreateHandleEjPvPNS_15IdentityToken_tES3_PNS_11HandleErrorE" demangled="SourceMod::IHandleSys::CreateHandle(unsigned int, void*, SourceMod::IdentityToken_t*, SourceMod::IdentityToken_t*, SourceMod::HandleError*)" location="f38:293" file="f38" line="293" extern="1">
    <Argument name="type" type="_1354" location="f38:293" file="f38" line="293"/>
    <Argument name="object" type="_296" location="f38:293" file="f38" line="293"/>
    <Argument name="owner" type="_3018" location="f38:293" file="f38" line="293"/>
    <Argument name="ident" type="_3018" location="f38:293" file="f38" line="293"/>
    <Argument name="err" type="_3025" location="f38:293" file="f38" line="293"/>
  </Method>
  <Method id="_1891" name="FreeHandle" returns="_1253" virtual="1" pure_virtual="1" overrides="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSys10FreeHandleEjPKNS_14HandleSecurityE" demangled="SourceMod::IHandleSys::FreeHandle(unsigned int, SourceMod::HandleSecurity const*)" location="f38:304" file="f38" line="304" extern="1">
    <Argument name="handle" type="_1270" location="f38:304" file="f38" line="304"/>
    <Argument name="pSecurity" type="_3027" location="f38:304" file="f38" line="304"/>
  </Method>
  <Method id="_1892" name="CloneHandle" returns="_1253" virtual="1" pure_virtual="1" overrides="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSys11CloneHandleEjPjPNS_15IdentityToken_tEPKNS_14HandleSecurityE" demangled="SourceMod::IHandleSys::CloneHandle(unsigned int, unsigned int*, SourceMod::IdentityToken_t*, SourceMod::HandleSecurity const*)" location="f38:319" file="f38" line="319" extern="1">
    <Argument name="handle" type="_1270" location="f38:319" file="f38" line="319"/>
    <Argument name="newhandle" type="_3028" location="f38:319" file="f38" line="319"/>
    <Argument name="newOwner" type="_3018" location="f38:319" file="f38" line="319"/>
    <Argument name="pSecurity" type="_3027" location="f38:319" file="f38" line="319"/>
  </Method>
  <Method id="_1893" name="ReadHandle" returns="_1253" virtual="1" pure_virtual="1" overrides="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSys10ReadHandleEjjPKNS_14HandleSecurityEPPv" demangled="SourceMod::IHandleSys::ReadHandle(unsigned int, unsigned int, SourceMod::HandleSecurity const*, void**)" location="f38:333" file="f38" line="333" extern="1">
    <Argument name="handle" type="_1270" location="f38:333" file="f38" line="333"/>
    <Argument name="type" type="_1354" location="f38:333" file="f38" line="333"/>
    <Argument name="pSecurity" type="_3027" location="f38:333" file="f38" line="333"/>
    <Argument name="object" type="_1124" location="f38:333" file="f38" line="333"/>
  </Method>
  <Method id="_1894" name="InitAccessDefaults" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSys18InitAccessDefaultsEPNS_10TypeAccessEPNS_12HandleAccessE" demangled="SourceMod::IHandleSys::InitAccessDefaults(SourceMod::TypeAccess*, SourceMod::HandleAccess*)" location="f38:342" file="f38" line="342" extern="1">
    <Argument name="pTypeAccess" type="_3029" location="f38:342" file="f38" line="342"/>
    <Argument name="pHandleAccess" type="_3030" location="f38:342" file="f38" line="342"/>
  </Method>
  <Method id="_1895" name="CreateHandleEx" returns="_1270" virtual="1" pure_virtual="1" overrides="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSys14CreateHandleExEjPvPKNS_14HandleSecurityEPKNS_12HandleAccessEPNS_11HandleErrorE" demangled="SourceMod::IHandleSys::CreateHandleEx(unsigned int, void*, SourceMod::HandleSecurity const*, SourceMod::HandleAccess const*, SourceMod::HandleError*)" location="f38:359" file="f38" line="359" extern="1">
    <Argument name="type" type="_1354" location="f38:359" file="f38" line="359"/>
    <Argument name="object" type="_296" location="f38:359" file="f38" line="359"/>
    <Argument name="pSec" type="_3027" location="f38:359" file="f38" line="359"/>
    <Argument name="pAccess" type="_3024" location="f38:359" file="f38" line="359"/>
    <Argument name="err" type="_3025" location="f38:359" file="f38" line="359"/>
  </Method>
  <Method id="_1896" name="FastCloneHandle" returns="_1270" virtual="1" pure_virtual="1" overrides="" context="_1273" access="public" mangled="_ZN9SourceMod10IHandleSys15FastCloneHandleEj" demangled="SourceMod::IHandleSys::FastCloneHandle(unsigned int)" location="f38:366" file="f38" line="366" extern="1">
    <Argument name="hndl" type="_1270" location="f38:366" file="f38" line="366"/>
  </Method>
  <OperatorMethod id="_1897" name="=" returns="_3031" artificial="1" throw="" context="_1275" access="public" mangled="_ZN9SourceMod7IPluginaSERKS0_" demangled="SourceMod::IPlugin::operator=(SourceMod::IPlugin const&amp;)" location="f52:102" file="f52" line="102" endline="102" inline="1">
    <Argument type="_3032" location="f52:102" file="f52" line="102"/>
  </OperatorMethod>
  <Constructor id="_1898" name="IPlugin" artificial="1" throw="" context="_1275" access="public" mangled="_ZN9SourceMod7IPluginC1ERKS0_ *INTERNAL* " demangled="SourceMod::IPlugin::IPlugin(SourceMod::IPlugin const&amp;)" location="f52:102" file="f52" line="102" endline="102" inline="1">
    <Argument type="_3032" location="f52:102" file="f52" line="102"/>
  </Constructor>
  <Constructor id="_1899" name="IPlugin" artificial="1" throw="" context="_1275" access="public" mangled="_ZN9SourceMod7IPluginC1Ev *INTERNAL* " demangled="SourceMod::IPlugin::IPlugin()" location="f52:102" file="f52" line="102" endline="102" inline="1"/>
  <Destructor id="_1900" name="IPlugin" virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPluginD1Ev *INTERNAL* " demangled="SourceMod::IPlugin::~IPlugin()" location="f52:105" file="f52" line="105" endline="107" inline="1">
  </Destructor>
  <Method id="_1901" name="GetType" returns="_1303" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin7GetTypeEv" demangled="SourceMod::IPlugin::GetType()" location="f52:112" file="f52" line="112" extern="1"/>
  <Method id="_1902" name="GetBaseContext" returns="_3033" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin14GetBaseContextEv" demangled="SourceMod::IPlugin::GetBaseContext()" location="f52:119" file="f52" line="119" extern="1"/>
  <Method id="_1903" name="GetContext" returns="_3034" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin10GetContextEv" demangled="SourceMod::IPlugin::GetContext()" location="f52:126" file="f52" line="126" extern="1"/>
  <Method id="_1904" name="GetPluginStructure" returns="_296" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin18GetPluginStructureEv" demangled="SourceMod::IPlugin::GetPluginStructure()" location="f52:133" file="f52" line="133" extern="1"/>
  <Method id="_1905" name="GetPublicInfo" returns="_3035" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin13GetPublicInfoEv" demangled="SourceMod::IPlugin::GetPublicInfo()" location="f52:140" file="f52" line="140" extern="1"/>
  <Method id="_1906" name="GetFilename" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin11GetFilenameEv" demangled="SourceMod::IPlugin::GetFilename()" location="f52:145" file="f52" line="145" extern="1"/>
  <Method id="_1907" name="IsDebugging" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin11IsDebuggingEv" demangled="SourceMod::IPlugin::IsDebugging()" location="f52:150" file="f52" line="150" extern="1"/>
  <Method id="_1908" name="GetStatus" returns="_1340" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin9GetStatusEv" demangled="SourceMod::IPlugin::GetStatus()" location="f52:155" file="f52" line="155" extern="1"/>
  <Method id="_1909" name="SetPauseState" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin13SetPauseStateEb" demangled="SourceMod::IPlugin::SetPauseState(bool)" location="f52:162" file="f52" line="162" extern="1">
    <Argument name="paused" type="_1028" location="f52:162" file="f52" line="162"/>
  </Method>
  <Method id="_1910" name="GetSerial" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin9GetSerialEv" demangled="SourceMod::IPlugin::GetSerial()" location="f52:167" file="f52" line="167" extern="1"/>
  <Method id="_1911" name="GetIdentity" returns="_3018" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin11GetIdentityEv" demangled="SourceMod::IPlugin::GetIdentity()" location="f52:172" file="f52" line="172" extern="1"/>
  <Method id="_1912" name="SetProperty" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin11SetPropertyEPKcPv" demangled="SourceMod::IPlugin::SetProperty(char const*, void*)" location="f52:183" file="f52" line="183" extern="1">
    <Argument name="prop" type="_1006" location="f52:183" file="f52" line="183"/>
    <Argument name="ptr" type="_296" location="f52:183" file="f52" line="183"/>
  </Method>
  <Method id="_1913" name="GetProperty" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin11GetPropertyEPKcPPvb" demangled="SourceMod::IPlugin::GetProperty(char const*, void**, bool)" location="f52:194" file="f52" line="194" extern="1">
    <Argument name="prop" type="_1006" location="f52:194" file="f52" line="194"/>
    <Argument name="ptr" type="_1124" location="f52:194" file="f52" line="194"/>
    <Argument name="remove" type="_1028" location="f52:194" file="f52" line="194" default="false"/>
  </Method>
  <Method id="_1914" name="GetRuntime" returns="_3036" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin10GetRuntimeEv" demangled="SourceMod::IPlugin::GetRuntime()" location="f52:201" file="f52" line="201" extern="1"/>
  <Method id="_1915" name="GetPhrases" returns="_2978" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin10GetPhrasesEv" demangled="SourceMod::IPlugin::GetPhrases()" location="f52:208" file="f52" line="208" extern="1"/>
  <Method id="_1916" name="GetMyHandle" returns="_1270" virtual="1" pure_virtual="1" overrides="" context="_1275" access="public" mangled="_ZN9SourceMod7IPlugin11GetMyHandleEv" demangled="SourceMod::IPlugin::GetMyHandle()" location="f52:215" file="f52" line="215" extern="1"/>
  <Destructor id="_1917" name="IAdminSystem" artificial="1" throw="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystemD1Ev *INTERNAL* " demangled="SourceMod::IAdminSystem::~IAdminSystem()" location="f53:221" file="f53" line="221" endline="221" inline="1">
  </Destructor>
  <OperatorMethod id="_1918" name="=" returns="_3037" artificial="1" throw="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystemaSERKS0_" demangled="SourceMod::IAdminSystem::operator=(SourceMod::IAdminSystem const&amp;)" location="f53:221" file="f53" line="221" endline="221" inline="1">
    <Argument type="_3038" location="f53:221" file="f53" line="221"/>
  </OperatorMethod>
  <Constructor id="_1919" name="IAdminSystem" artificial="1" throw="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystemC1ERKS0_ *INTERNAL* " demangled="SourceMod::IAdminSystem::IAdminSystem(SourceMod::IAdminSystem const&amp;)" location="f53:221" file="f53" line="221" endline="221" inline="1">
    <Argument type="_3038" location="f53:221" file="f53" line="221"/>
  </Constructor>
  <Constructor id="_1920" name="IAdminSystem" artificial="1" throw="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystemC1Ev *INTERNAL* " demangled="SourceMod::IAdminSystem::IAdminSystem()" location="f53:221" file="f53" line="221" endline="221" inline="1"/>
  <Method id="_1921" name="GetInterfaceName" returns="_1006" virtual="1" overrides="_2598 " context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem16GetInterfaceNameEv" demangled="SourceMod::IAdminSystem::GetInterfaceName()" location="f53:223" file="f53" line="223" endline="225" inline="1"/>
  <Method id="_1922" name="GetInterfaceVersion" returns="_92" virtual="1" overrides="_2597 " context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem19GetInterfaceVersionEv" demangled="SourceMod::IAdminSystem::GetInterfaceVersion()" location="f53:227" file="f53" line="227" endline="229" inline="1"/>
  <Method id="_1923" name="AddCommandOverride" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem18AddCommandOverrideEPKcNS_12OverrideTypeEj" demangled="SourceMod::IAdminSystem::AddCommandOverride(char const*, SourceMod::OverrideType, unsigned int)" location="f53:240" file="f53" line="240" extern="1">
    <Argument name="cmd" type="_1006" location="f53:240" file="f53" line="240"/>
    <Argument name="type" type="_1287" location="f53:240" file="f53" line="240"/>
    <Argument name="flags" type="_1323" location="f53:240" file="f53" line="240"/>
  </Method>
  <Method id="_1924" name="GetCommandOverride" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem18GetCommandOverrideEPKcNS_12OverrideTypeEPj" demangled="SourceMod::IAdminSystem::GetCommandOverride(char const*, SourceMod::OverrideType, unsigned int*)" location="f53:250" file="f53" line="250" extern="1">
    <Argument name="cmd" type="_1006" location="f53:250" file="f53" line="250"/>
    <Argument name="type" type="_1287" location="f53:250" file="f53" line="250"/>
    <Argument name="pFlags" type="_3039" location="f53:250" file="f53" line="250"/>
  </Method>
  <Method id="_1925" name="UnsetCommandOverride" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem20UnsetCommandOverrideEPKcNS_12OverrideTypeE" demangled="SourceMod::IAdminSystem::UnsetCommandOverride(char const*, SourceMod::OverrideType)" location="f53:258" file="f53" line="258" extern="1">
    <Argument name="cmd" type="_1006" location="f53:258" file="f53" line="258"/>
    <Argument name="type" type="_1287" location="f53:258" file="f53" line="258"/>
  </Method>
  <Method id="_1926" name="AddGroup" returns="_1331" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem8AddGroupEPKc" demangled="SourceMod::IAdminSystem::AddGroup(char const*)" location="f53:266" file="f53" line="266" extern="1">
    <Argument name="group_name" type="_1006" location="f53:266" file="f53" line="266"/>
  </Method>
  <Method id="_1927" name="FindGroupByName" returns="_1331" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem15FindGroupByNameEPKc" demangled="SourceMod::IAdminSystem::FindGroupByName(char const*)" location="f53:274" file="f53" line="274" extern="1">
    <Argument name="group_name" type="_1006" location="f53:274" file="f53" line="274"/>
  </Method>
  <Method id="_1928" name="SetGroupAddFlag" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem15SetGroupAddFlagEiNS_9AdminFlagEb" demangled="SourceMod::IAdminSystem::SetGroupAddFlag(int, SourceMod::AdminFlag, bool)" location="f53:284" file="f53" line="284" extern="1">
    <Argument name="id" type="_1331" location="f53:284" file="f53" line="284"/>
    <Argument name="flag" type="_1288" location="f53:284" file="f53" line="284"/>
    <Argument name="enabled" type="_1028" location="f53:284" file="f53" line="284"/>
  </Method>
  <Method id="_1929" name="GetGroupAddFlag" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem15GetGroupAddFlagEiNS_9AdminFlagE" demangled="SourceMod::IAdminSystem::GetGroupAddFlag(int, SourceMod::AdminFlag)" location="f53:293" file="f53" line="293" extern="1">
    <Argument name="id" type="_1331" location="f53:293" file="f53" line="293"/>
    <Argument name="flag" type="_1288" location="f53:293" file="f53" line="293"/>
  </Method>
  <Method id="_1930" name="GetGroupAddFlags" returns="_1323" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem16GetGroupAddFlagsEi" demangled="SourceMod::IAdminSystem::GetGroupAddFlags(int)" location="f53:302" file="f53" line="302" extern="1">
    <Argument name="id" type="_1331" location="f53:302" file="f53" line="302"/>
  </Method>
  <Method id="_1931" name="SetGroupGenericImmunity" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem23SetGroupGenericImmunityEiNS_12ImmunityTypeEb" demangled="SourceMod::IAdminSystem::SetGroupGenericImmunity(int, SourceMod::ImmunityType, bool)" location="f53:317" file="f53" line="317" extern="1">
    <Argument name="id" type="_1331" location="f53:317" file="f53" line="317"/>
    <Argument name="type" type="_1360" location="f53:317" file="f53" line="317"/>
    <Argument name="enabled" type="_1028" location="f53:317" file="f53" line="317"/>
  </Method>
  <Method id="_1932" name="GetGroupGenericImmunity" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem23GetGroupGenericImmunityEiNS_12ImmunityTypeE" demangled="SourceMod::IAdminSystem::GetGroupGenericImmunity(int, SourceMod::ImmunityType)" location="f53:331" file="f53" line="331" extern="1">
    <Argument name="id" type="_1331" location="f53:331" file="f53" line="331"/>
    <Argument name="type" type="_1360" location="f53:331" file="f53" line="331"/>
  </Method>
  <Method id="_1933" name="AddGroupImmunity" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem16AddGroupImmunityEii" demangled="SourceMod::IAdminSystem::AddGroupImmunity(int, int)" location="f53:339" file="f53" line="339" extern="1">
    <Argument name="id" type="_1331" location="f53:339" file="f53" line="339"/>
    <Argument name="other_id" type="_1331" location="f53:339" file="f53" line="339"/>
  </Method>
  <Method id="_1934" name="GetGroupImmunityCount" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem21GetGroupImmunityCountEi" demangled="SourceMod::IAdminSystem::GetGroupImmunityCount(int)" location="f53:347" file="f53" line="347" extern="1">
    <Argument name="id" type="_1331" location="f53:347" file="f53" line="347"/>
  </Method>
  <Method id="_1935" name="GetGroupImmunity" returns="_1331" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem16GetGroupImmunityEij" demangled="SourceMod::IAdminSystem::GetGroupImmunity(int, unsigned int)" location="f53:356" file="f53" line="356" extern="1">
    <Argument name="id" type="_1331" location="f53:356" file="f53" line="356"/>
    <Argument name="number" type="_92" location="f53:356" file="f53" line="356"/>
  </Method>
  <Method id="_1936" name="AddGroupCommandOverride" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem23AddGroupCommandOverrideEiPKcNS_12OverrideTypeENS_12OverrideRuleE" demangled="SourceMod::IAdminSystem::AddGroupCommandOverride(int, char const*, SourceMod::OverrideType, SourceMod::OverrideRule)" location="f53:369" file="f53" line="369" extern="1">
    <Argument name="id" type="_1331" location="f53:369" file="f53" line="369"/>
    <Argument name="name" type="_1006" location="f53:369" file="f53" line="369"/>
    <Argument name="type" type="_1287" location="f53:369" file="f53" line="369"/>
    <Argument name="rule" type="_1308" location="f53:369" file="f53" line="369"/>
  </Method>
  <Method id="_1937" name="GetGroupCommandOverride" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem23GetGroupCommandOverrideEiPKcNS_12OverrideTypeEPNS_12OverrideRuleE" demangled="SourceMod::IAdminSystem::GetGroupCommandOverride(int, char const*, SourceMod::OverrideType, SourceMod::OverrideRule*)" location="f53:383" file="f53" line="383" extern="1">
    <Argument name="id" type="_1331" location="f53:383" file="f53" line="383"/>
    <Argument name="name" type="_1006" location="f53:383" file="f53" line="383"/>
    <Argument name="type" type="_1287" location="f53:383" file="f53" line="383"/>
    <Argument name="pRule" type="_3040" location="f53:383" file="f53" line="383"/>
  </Method>
  <Method id="_1938" name="DumpAdminCache" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem14DumpAdminCacheENS_14AdminCachePartEb" demangled="SourceMod::IAdminSystem::DumpAdminCache(SourceMod::AdminCachePart, bool)" location="f53:392" file="f53" line="392" extern="1">
    <Argument name="part" type="_1319" location="f53:392" file="f53" line="392"/>
    <Argument name="rebuild" type="_1028" location="f53:392" file="f53" line="392"/>
  </Method>
  <Method id="_1939" name="AddAdminListener" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem16AddAdminListenerEPNS_14IAdminListenerE" demangled="SourceMod::IAdminSystem::AddAdminListener(SourceMod::IAdminListener*)" location="f53:399" file="f53" line="399" extern="1">
    <Argument name="pListener" type="_3041" location="f53:399" file="f53" line="399"/>
  </Method>
  <Method id="_1940" name="RemoveAdminListener" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem19RemoveAdminListenerEPNS_14IAdminListenerE" demangled="SourceMod::IAdminSystem::RemoveAdminListener(SourceMod::IAdminListener*)" location="f53:406" file="f53" line="406" extern="1">
    <Argument name="pListener" type="_3041" location="f53:406" file="f53" line="406"/>
  </Method>
  <Method id="_1941" name="RegisterAuthIdentType" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem21RegisterAuthIdentTypeEPKc" demangled="SourceMod::IAdminSystem::RegisterAuthIdentType(char const*)" location="f53:414" file="f53" line="414" extern="1">
    <Argument name="name" type="_1006" location="f53:414" file="f53" line="414"/>
  </Method>
  <Method id="_1942" name="CreateAdmin" returns="_1333" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem11CreateAdminEPKc" demangled="SourceMod::IAdminSystem::CreateAdmin(char const*)" location="f53:423" file="f53" line="423" extern="1">
    <Argument name="name" type="_1006" location="f53:423" file="f53" line="423"/>
  </Method>
  <Method id="_1943" name="GetAdminName" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem12GetAdminNameEi" demangled="SourceMod::IAdminSystem::GetAdminName(int)" location="f53:432" file="f53" line="432" extern="1">
    <Argument name="id" type="_1333" location="f53:432" file="f53" line="432"/>
  </Method>
  <Method id="_1944" name="BindAdminIdentity" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem17BindAdminIdentityEiPKcS2_" demangled="SourceMod::IAdminSystem::BindAdminIdentity(int, char const*, char const*)" location="f53:444" file="f53" line="444" extern="1">
    <Argument name="id" type="_1333" location="f53:444" file="f53" line="444"/>
    <Argument name="auth" type="_1006" location="f53:444" file="f53" line="444"/>
    <Argument name="ident" type="_1006" location="f53:444" file="f53" line="444"/>
  </Method>
  <Method id="_1945" name="SetAdminFlag" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem12SetAdminFlagEiNS_9AdminFlagEb" demangled="SourceMod::IAdminSystem::SetAdminFlag(int, SourceMod::AdminFlag, bool)" location="f53:453" file="f53" line="453" extern="1">
    <Argument name="id" type="_1333" location="f53:453" file="f53" line="453"/>
    <Argument name="flag" type="_1288" location="f53:453" file="f53" line="453"/>
    <Argument name="enabled" type="_1028" location="f53:453" file="f53" line="453"/>
  </Method>
  <Method id="_1946" name="GetAdminFlag" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem12GetAdminFlagEiNS_9AdminFlagENS_10AccessModeE" demangled="SourceMod::IAdminSystem::GetAdminFlag(int, SourceMod::AdminFlag, SourceMod::AccessMode)" location="f53:463" file="f53" line="463" extern="1">
    <Argument name="id" type="_1333" location="f53:463" file="f53" line="463"/>
    <Argument name="flag" type="_1288" location="f53:463" file="f53" line="463"/>
    <Argument name="mode" type="_1255" location="f53:463" file="f53" line="463"/>
  </Method>
  <Method id="_1947" name="GetAdminFlags" returns="_1323" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem13GetAdminFlagsEiNS_10AccessModeE" demangled="SourceMod::IAdminSystem::GetAdminFlags(int, SourceMod::AccessMode)" location="f53:472" file="f53" line="472" extern="1">
    <Argument name="id" type="_1333" location="f53:472" file="f53" line="472"/>
    <Argument name="mode" type="_1255" location="f53:472" file="f53" line="472"/>
  </Method>
  <Method id="_1948" name="SetAdminFlags" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem13SetAdminFlagsEiNS_10AccessModeEj" demangled="SourceMod::IAdminSystem::SetAdminFlags(int, SourceMod::AccessMode, unsigned int)" location="f53:481" file="f53" line="481" extern="1">
    <Argument name="id" type="_1333" location="f53:481" file="f53" line="481"/>
    <Argument name="mode" type="_1255" location="f53:481" file="f53" line="481"/>
    <Argument name="bits" type="_1323" location="f53:481" file="f53" line="481"/>
  </Method>
  <Method id="_1949" name="AdminInheritGroup" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem17AdminInheritGroupEii" demangled="SourceMod::IAdminSystem::AdminInheritGroup(int, int)" location="f53:491" file="f53" line="491" extern="1">
    <Argument name="id" type="_1333" location="f53:491" file="f53" line="491"/>
    <Argument name="gid" type="_1331" location="f53:491" file="f53" line="491"/>
  </Method>
  <Method id="_1950" name="GetAdminGroupCount" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem18GetAdminGroupCountEi" demangled="SourceMod::IAdminSystem::GetAdminGroupCount(int)" location="f53:499" file="f53" line="499" extern="1">
    <Argument name="id" type="_1333" location="f53:499" file="f53" line="499"/>
  </Method>
  <Method id="_1951" name="GetAdminGroup" returns="_1331" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem13GetAdminGroupEijPPKc" demangled="SourceMod::IAdminSystem::GetAdminGroup(int, unsigned int, char const**)" location="f53:511" file="f53" line="511" extern="1">
    <Argument name="id" type="_1333" location="f53:511" file="f53" line="511"/>
    <Argument name="index" type="_92" location="f53:511" file="f53" line="511"/>
    <Argument name="name" type="_2979" location="f53:511" file="f53" line="511"/>
  </Method>
  <Method id="_1952" name="SetAdminPassword" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem16SetAdminPasswordEiPKc" demangled="SourceMod::IAdminSystem::SetAdminPassword(int, char const*)" location="f53:519" file="f53" line="519" extern="1">
    <Argument name="id" type="_1333" location="f53:519" file="f53" line="519"/>
    <Argument name="password" type="_1006" location="f53:519" file="f53" line="519"/>
  </Method>
  <Method id="_1953" name="GetAdminPassword" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem16GetAdminPasswordEi" demangled="SourceMod::IAdminSystem::GetAdminPassword(int)" location="f53:527" file="f53" line="527" extern="1">
    <Argument name="id" type="_1333" location="f53:527" file="f53" line="527"/>
  </Method>
  <Method id="_1954" name="FindAdminByIdentity" returns="_1333" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem19FindAdminByIdentityEPKcS2_" demangled="SourceMod::IAdminSystem::FindAdminByIdentity(char const*, char const*)" location="f53:536" file="f53" line="536" extern="1">
    <Argument name="auth" type="_1006" location="f53:536" file="f53" line="536"/>
    <Argument name="identity" type="_1006" location="f53:536" file="f53" line="536"/>
  </Method>
  <Method id="_1955" name="InvalidateAdmin" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem15InvalidateAdminEi" demangled="SourceMod::IAdminSystem::InvalidateAdmin(int)" location="f53:544" file="f53" line="544" extern="1">
    <Argument name="id" type="_1333" location="f53:544" file="f53" line="544"/>
  </Method>
  <Method id="_1956" name="FlagBitsToBitArray" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem18FlagBitsToBitArrayEjPbj" demangled="SourceMod::IAdminSystem::FlagBitsToBitArray(unsigned int, bool*, unsigned int)" location="f53:554" file="f53" line="554" extern="1">
    <Argument name="bits" type="_1323" location="f53:554" file="f53" line="554"/>
    <Argument name="array" type="_3042" location="f53:554" file="f53" line="554"/>
    <Argument name="maxSize" type="_92" location="f53:554" file="f53" line="554"/>
  </Method>
  <Method id="_1957" name="FlagBitArrayToBits" returns="_1323" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem18FlagBitArrayToBitsEPKbj" demangled="SourceMod::IAdminSystem::FlagBitArrayToBits(bool const*, unsigned int)" location="f53:563" file="f53" line="563" extern="1">
    <Argument name="array" type="_3043" location="f53:563" file="f53" line="563"/>
    <Argument name="maxSize" type="_92" location="f53:563" file="f53" line="563"/>
  </Method>
  <Method id="_1958" name="FlagArrayToBits" returns="_1323" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem15FlagArrayToBitsEPKNS_9AdminFlagEj" demangled="SourceMod::IAdminSystem::FlagArrayToBits(SourceMod::AdminFlag const*, unsigned int)" location="f53:572" file="f53" line="572" extern="1">
    <Argument name="array" type="_3044" location="f53:572" file="f53" line="572"/>
    <Argument name="numFlags" type="_92" location="f53:572" file="f53" line="572"/>
  </Method>
  <Method id="_1959" name="FlagBitsToArray" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem15FlagBitsToArrayEjPNS_9AdminFlagEj" demangled="SourceMod::IAdminSystem::FlagBitsToArray(unsigned int, SourceMod::AdminFlag*, unsigned int)" location="f53:582" file="f53" line="582" extern="1">
    <Argument name="bits" type="_1323" location="f53:582" file="f53" line="582"/>
    <Argument name="array" type="_3045" location="f53:582" file="f53" line="582"/>
    <Argument name="maxSize" type="_92" location="f53:582" file="f53" line="582"/>
  </Method>
  <Method id="_1960" name="CheckAdminFlags" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem15CheckAdminFlagsEij" demangled="SourceMod::IAdminSystem::CheckAdminFlags(int, unsigned int)" location="f53:592" file="f53" line="592" extern="1">
    <Argument name="id" type="_1333" location="f53:592" file="f53" line="592"/>
    <Argument name="bits" type="_1323" location="f53:592" file="f53" line="592"/>
  </Method>
  <Method id="_1961" name="CanAdminTarget" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem14CanAdminTargetEii" demangled="SourceMod::IAdminSystem::CanAdminTarget(int, int)" location="f53:613" file="f53" line="613" extern="1">
    <Argument name="id" type="_1333" location="f53:613" file="f53" line="613"/>
    <Argument name="target" type="_1333" location="f53:613" file="f53" line="613"/>
  </Method>
  <Method id="_1962" name="FindFlag" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem8FindFlagEPKcPNS_9AdminFlagE" demangled="SourceMod::IAdminSystem::FindFlag(char const*, SourceMod::AdminFlag*)" location="f53:622" file="f53" line="622" extern="1">
    <Argument name="flagname" type="_1006" location="f53:622" file="f53" line="622"/>
    <Argument name="pAdmFlag" type="_3045" location="f53:622" file="f53" line="622"/>
  </Method>
  <Method id="_1963" name="FindFlag" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem8FindFlagEcPNS_9AdminFlagE" demangled="SourceMod::IAdminSystem::FindFlag(char, SourceMod::AdminFlag*)" location="f53:631" file="f53" line="631" extern="1">
    <Argument name="c" type="_1062" location="f53:631" file="f53" line="631"/>
    <Argument name="pAdmFlag" type="_3045" location="f53:631" file="f53" line="631"/>
  </Method>
  <Method id="_1964" name="ReadFlagString" returns="_1323" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem14ReadFlagStringEPKcPS2_" demangled="SourceMod::IAdminSystem::ReadFlagString(char const*, char const**)" location="f53:641" file="f53" line="641" extern="1">
    <Argument name="flags" type="_1006" location="f53:641" file="f53" line="641"/>
    <Argument name="end" type="_2979" location="f53:641" file="f53" line="641"/>
  </Method>
  <Method id="_1965" name="GetAdminSerialChange" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem20GetAdminSerialChangeEi" demangled="SourceMod::IAdminSystem::GetAdminSerialChange(int)" location="f53:651" file="f53" line="651" extern="1">
    <Argument name="id" type="_1333" location="f53:651" file="f53" line="651"/>
  </Method>
  <Method id="_1966" name="CanAdminUseCommand" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem18CanAdminUseCommandEiPKc" demangled="SourceMod::IAdminSystem::CanAdminUseCommand(int, char const*)" location="f53:662" file="f53" line="662" extern="1">
    <Argument name="client" type="_103" location="f53:662" file="f53" line="662"/>
    <Argument name="cmd" type="_1006" location="f53:662" file="f53" line="662"/>
  </Method>
  <Method id="_1967" name="GetGroupName" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem12GetGroupNameEi" demangled="SourceMod::IAdminSystem::GetGroupName(int)" location="f53:670" file="f53" line="670" extern="1">
    <Argument name="gid" type="_1331" location="f53:670" file="f53" line="670"/>
  </Method>
  <Method id="_1968" name="SetGroupImmunityLevel" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem21SetGroupImmunityLevelEij" demangled="SourceMod::IAdminSystem::SetGroupImmunityLevel(int, unsigned int)" location="f53:679" file="f53" line="679" extern="1">
    <Argument name="gid" type="_1331" location="f53:679" file="f53" line="679"/>
    <Argument name="level" type="_92" location="f53:679" file="f53" line="679"/>
  </Method>
  <Method id="_1969" name="GetGroupImmunityLevel" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem21GetGroupImmunityLevelEi" demangled="SourceMod::IAdminSystem::GetGroupImmunityLevel(int)" location="f53:687" file="f53" line="687" extern="1">
    <Argument name="gid" type="_1331" location="f53:687" file="f53" line="687"/>
  </Method>
  <Method id="_1970" name="SetAdminImmunityLevel" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem21SetAdminImmunityLevelEij" demangled="SourceMod::IAdminSystem::SetAdminImmunityLevel(int, unsigned int)" location="f53:696" file="f53" line="696" extern="1">
    <Argument name="id" type="_1333" location="f53:696" file="f53" line="696"/>
    <Argument name="level" type="_92" location="f53:696" file="f53" line="696"/>
  </Method>
  <Method id="_1971" name="GetAdminImmunityLevel" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem21GetAdminImmunityLevelEi" demangled="SourceMod::IAdminSystem::GetAdminImmunityLevel(int)" location="f53:704" file="f53" line="704" extern="1">
    <Argument name="id" type="_1333" location="f53:704" file="f53" line="704"/>
  </Method>
  <Method id="_1972" name="CheckAccess" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem11CheckAccessEiPKcjb" demangled="SourceMod::IAdminSystem::CheckAccess(int, char const*, unsigned int, bool)" location="f53:719" file="f53" line="719" extern="1">
    <Argument name="client" type="_103" location="f53:719" file="f53" line="719"/>
    <Argument name="cmd" type="_1006" location="f53:719" file="f53" line="719"/>
    <Argument name="flags" type="_1323" location="f53:719" file="f53" line="719"/>
    <Argument name="override_only" type="_1028" location="f53:719" file="f53" line="719"/>
  </Method>
  <Method id="_1973" name="FindFlagChar" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1276" access="public" mangled="_ZN9SourceMod12IAdminSystem12FindFlagCharENS_9AdminFlagEPc" demangled="SourceMod::IAdminSystem::FindFlagChar(SourceMod::AdminFlag, char*)" location="f53:728" file="f53" line="728" extern="1">
    <Argument name="flag" type="_1288" location="f53:728" file="f53" line="728"/>
    <Argument name="c" type="_82" location="f53:728" file="f53" line="728"/>
  </Method>
  <Destructor id="_1974" name="IDBManager" artificial="1" throw="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManagerD1Ev *INTERNAL* " demangled="SourceMod::IDBManager::~IDBManager()" location="f15:775" file="f15" line="775" endline="775" inline="1">
  </Destructor>
  <OperatorMethod id="_1975" name="=" returns="_3046" artificial="1" throw="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManageraSERKS0_" demangled="SourceMod::IDBManager::operator=(SourceMod::IDBManager const&amp;)" location="f15:775" file="f15" line="775" endline="775" inline="1">
    <Argument type="_3047" location="f15:775" file="f15" line="775"/>
  </OperatorMethod>
  <Constructor id="_1976" name="IDBManager" artificial="1" throw="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManagerC1ERKS0_ *INTERNAL* " demangled="SourceMod::IDBManager::IDBManager(SourceMod::IDBManager const&amp;)" location="f15:775" file="f15" line="775" endline="775" inline="1">
    <Argument type="_3047" location="f15:775" file="f15" line="775"/>
  </Constructor>
  <Constructor id="_1977" name="IDBManager" artificial="1" throw="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManagerC1Ev *INTERNAL* " demangled="SourceMod::IDBManager::IDBManager()" location="f15:775" file="f15" line="775" endline="775" inline="1"/>
  <Method id="_1978" name="GetInterfaceName" returns="_1006" virtual="1" pure_virtual="1" overrides="_2598 " context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager16GetInterfaceNameEv" demangled="SourceMod::IDBManager::GetInterfaceName()" location="f15:777" file="f15" line="777" extern="1"/>
  <Method id="_1979" name="GetInterfaceVersion" returns="_92" virtual="1" pure_virtual="1" overrides="_2597 " context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager19GetInterfaceVersionEv" demangled="SourceMod::IDBManager::GetInterfaceVersion()" location="f15:778" file="f15" line="778" extern="1"/>
  <Method id="_1980" name="AddDriver" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager9AddDriverEPNS_9IDBDriverE" demangled="SourceMod::IDBManager::AddDriver(SourceMod::IDBDriver*)" location="f15:785" file="f15" line="785" extern="1">
    <Argument name="pDriver" type="_3048" location="f15:785" file="f15" line="785"/>
  </Method>
  <Method id="_1981" name="RemoveDriver" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager12RemoveDriverEPNS_9IDBDriverE" demangled="SourceMod::IDBManager::RemoveDriver(SourceMod::IDBDriver*)" location="f15:792" file="f15" line="792" extern="1">
    <Argument name="pDriver" type="_3048" location="f15:792" file="f15" line="792"/>
  </Method>
  <Method id="_1982" name="FindDatabaseConf" returns="_3049" virtual="1" pure_virtual="1" overrides="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager16FindDatabaseConfEPKc" demangled="SourceMod::IDBManager::FindDatabaseConf(char const*)" location="f15:801" file="f15" line="801" extern="1">
    <Argument name="name" type="_1006" location="f15:801" file="f15" line="801"/>
  </Method>
  <Method id="_1983" name="Connect" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager7ConnectEPKcPPNS_9IDBDriverEPPNS_9IDatabaseEbPcj" demangled="SourceMod::IDBManager::Connect(char const*, SourceMod::IDBDriver**, SourceMod::IDatabase**, bool, char*, unsigned int)" location="f15:822" file="f15" line="822" extern="1">
    <Argument name="name" type="_1006" location="f15:822" file="f15" line="822"/>
    <Argument name="pdr" type="_3050" location="f15:822" file="f15" line="822"/>
    <Argument name="pdb" type="_3051" location="f15:822" file="f15" line="822"/>
    <Argument name="persistent" type="_1028" location="f15:822" file="f15" line="822"/>
    <Argument name="error" type="_82" location="f15:822" file="f15" line="822"/>
    <Argument name="maxlength" type="_656" location="f15:822" file="f15" line="822"/>
  </Method>
  <Method id="_1984" name="GetDriverCount" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager14GetDriverCountEv" demangled="SourceMod::IDBManager::GetDriverCount()" location="f15:829" file="f15" line="829" extern="1"/>
  <Method id="_1985" name="GetDriver" returns="_3048" virtual="1" pure_virtual="1" overrides="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager9GetDriverEj" demangled="SourceMod::IDBManager::GetDriver(unsigned int)" location="f15:837" file="f15" line="837" extern="1">
    <Argument name="index" type="_92" location="f15:837" file="f15" line="837"/>
  </Method>
  <Method id="_1986" name="CreateHandle" returns="_1270" virtual="1" pure_virtual="1" overrides="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager12CreateHandleENS_12DBHandleTypeEPvPNS_15IdentityToken_tE" demangled="SourceMod::IDBManager::CreateHandle(SourceMod::DBHandleType, void*, SourceMod::IdentityToken_t*)" location="f15:848" file="f15" line="848" extern="1">
    <Argument name="type" type="_1339" location="f15:848" file="f15" line="848"/>
    <Argument name="ptr" type="_296" location="f15:848" file="f15" line="848"/>
    <Argument name="pToken" type="_3018" location="f15:848" file="f15" line="848"/>
  </Method>
  <Method id="_1987" name="ReadHandle" returns="_1253" virtual="1" pure_virtual="1" overrides="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager10ReadHandleEjNS_12DBHandleTypeEPPv" demangled="SourceMod::IDBManager::ReadHandle(unsigned int, SourceMod::DBHandleType, void**)" location="f15:859" file="f15" line="859" extern="1">
    <Argument name="hndl" type="_1270" location="f15:859" file="f15" line="859"/>
    <Argument name="type" type="_1339" location="f15:859" file="f15" line="859"/>
    <Argument name="ptr" type="_1124" location="f15:859" file="f15" line="859"/>
  </Method>
  <Method id="_1988" name="ReleaseHandle" returns="_1253" virtual="1" pure_virtual="1" overrides="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager13ReleaseHandleEjNS_12DBHandleTypeEPNS_15IdentityToken_tE" demangled="SourceMod::IDBManager::ReleaseHandle(unsigned int, SourceMod::DBHandleType, SourceMod::IdentityToken_t*)" location="f15:869" file="f15" line="869" extern="1">
    <Argument name="hndl" type="_1270" location="f15:869" file="f15" line="869"/>
    <Argument name="type" type="_1339" location="f15:869" file="f15" line="869"/>
    <Argument name="token" type="_3018" location="f15:869" file="f15" line="869"/>
  </Method>
  <Method id="_1989" name="FindOrLoadDriver" returns="_3048" virtual="1" pure_virtual="1" overrides="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager16FindOrLoadDriverEPKc" demangled="SourceMod::IDBManager::FindOrLoadDriver(char const*)" location="f15:878" file="f15" line="878" extern="1">
    <Argument name="driver" type="_1006" location="f15:878" file="f15" line="878"/>
  </Method>
  <Method id="_1990" name="GetDefaultDriver" returns="_3048" virtual="1" pure_virtual="1" overrides="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager16GetDefaultDriverEv" demangled="SourceMod::IDBManager::GetDefaultDriver()" location="f15:886" file="f15" line="886" extern="1"/>
  <Method id="_1991" name="AddToThreadQueue" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager16AddToThreadQueueEPNS_18IDBThreadOperationENS_14PrioQueueLevelE" demangled="SourceMod::IDBManager::AddToThreadQueue(SourceMod::IDBThreadOperation*, SourceMod::PrioQueueLevel)" location="f15:896" file="f15" line="896" extern="1">
    <Argument name="op" type="_3052" location="f15:896" file="f15" line="896"/>
    <Argument name="prio" type="_1274" location="f15:896" file="f15" line="896"/>
  </Method>
  <Method id="_1992" name="AddDependency" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1281" access="public" mangled="_ZN9SourceMod10IDBManager13AddDependencyEPNS_10IExtensionEPNS_9IDBDriverE" demangled="SourceMod::IDBManager::AddDependency(SourceMod::IExtension*, SourceMod::IDBDriver*)" location="f15:904" file="f15" line="904" extern="1">
    <Argument name="myself" type="_1556" location="f15:904" file="f15" line="904"/>
    <Argument name="driver" type="_3048" location="f15:904" file="f15" line="904"/>
  </Method>
  <Field id="_1993" name="pOwner" type="_3018" offset="0" context="_1282" access="public" location="f38:180" file="f38" line="180"/>
  <Field id="_1994" name="pIdentity" type="_3018" offset="32" context="_1282" access="public" location="f38:181" file="f38" line="181"/>
  <Destructor id="_1995" name="HandleSecurity" artificial="1" throw="" context="_1282" access="public" mangled="_ZN9SourceMod14HandleSecurityD1Ev *INTERNAL* " demangled="SourceMod::HandleSecurity::~HandleSecurity()" location="f38:172" file="f38" line="172" endline="172" inline="1">
  </Destructor>
  <OperatorMethod id="_1996" name="=" returns="_3053" artificial="1" throw="" context="_1282" access="public" mangled="_ZN9SourceMod14HandleSecurityaSERKS0_" demangled="SourceMod::HandleSecurity::operator=(SourceMod::HandleSecurity const&amp;)" location="f38:172" file="f38" line="172" endline="172" inline="1">
    <Argument type="_3054" location="f38:172" file="f38" line="172"/>
  </OperatorMethod>
  <Constructor id="_1997" name="HandleSecurity" artificial="1" throw="" context="_1282" access="public" mangled="_ZN9SourceMod14HandleSecurityC1ERKS0_ *INTERNAL* " demangled="SourceMod::HandleSecurity::HandleSecurity(SourceMod::HandleSecurity const&amp;)" location="f38:172" file="f38" line="172" endline="172" inline="1">
    <Argument type="_3054" location="f38:172" file="f38" line="172"/>
  </Constructor>
  <Constructor id="_1998" name="HandleSecurity" explicit="1" context="_1282" access="public" mangled="_ZN9SourceMod14HandleSecurityC1Ev *INTERNAL* " demangled="SourceMod::HandleSecurity::HandleSecurity()" location="f38:173" file="f38" line="173" inline="1"/>
  <Constructor id="_1999" name="HandleSecurity" explicit="1" context="_1282" access="public" mangled="_ZN9SourceMod14HandleSecurityC1EPNS_15IdentityToken_tES2_ *INTERNAL* " demangled="SourceMod::HandleSecurity::HandleSecurity(SourceMod::IdentityToken_t*, SourceMod::IdentityToken_t*)" location="f38:176" file="f38" line="176" endline="177" inline="1">
    <Argument name="owner" type="_3018" location="f38:176" file="f38" line="176"/>
    <Argument name="identity" type="_3018" location="f38:176" file="f38" line="176"/>
  </Constructor>
  <Destructor id="_2000" name="IMenuStyle" artificial="1" throw="" context="_1283" access="public" mangled="_ZN9SourceMod10IMenuStyleD1Ev *INTERNAL* " demangled="SourceMod::IMenuStyle::~IMenuStyle()" location="f28:343" file="f28" line="343" endline="343" inline="1">
  </Destructor>
  <OperatorMethod id="_2001" name="=" returns="_3055" artificial="1" throw="" context="_1283" access="public" mangled="_ZN9SourceMod10IMenuStyleaSERKS0_" demangled="SourceMod::IMenuStyle::operator=(SourceMod::IMenuStyle const&amp;)" location="f28:343" file="f28" line="343" endline="343" inline="1">
    <Argument type="_3056" location="f28:343" file="f28" line="343"/>
  </OperatorMethod>
  <Constructor id="_2002" name="IMenuStyle" artificial="1" throw="" context="_1283" access="public" mangled="_ZN9SourceMod10IMenuStyleC1ERKS0_ *INTERNAL* " demangled="SourceMod::IMenuStyle::IMenuStyle(SourceMod::IMenuStyle const&amp;)" location="f28:343" file="f28" line="343" endline="343" inline="1">
    <Argument type="_3056" location="f28:343" file="f28" line="343"/>
  </Constructor>
  <Constructor id="_2003" name="IMenuStyle" artificial="1" throw="" context="_1283" access="public" mangled="_ZN9SourceMod10IMenuStyleC1Ev *INTERNAL* " demangled="SourceMod::IMenuStyle::IMenuStyle()" location="f28:343" file="f28" line="343" endline="343" inline="1"/>
  <Method id="_2004" name="GetStyleAPIVersion" returns="_92" virtual="1" overrides="" context="_1283" access="public" mangled="_ZN9SourceMod10IMenuStyle18GetStyleAPIVersionEv" demangled="SourceMod::IMenuStyle::GetStyleAPIVersion()" location="f28:350" file="f28" line="350" endline="352" inline="1"/>
  <Method id="_2005" name="GetStyleName" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1283" access="public" mangled="_ZN9SourceMod10IMenuStyle12GetStyleNameEv" demangled="SourceMod::IMenuStyle::GetStyleName()" location="f28:360" file="f28" line="360" extern="1"/>
  <Method id="_2006" name="CreatePanel" returns="_3057" virtual="1" pure_virtual="1" overrides="" context="_1283" access="public" mangled="_ZN9SourceMod10IMenuStyle11CreatePanelEv" demangled="SourceMod::IMenuStyle::CreatePanel()" location="f28:369" file="f28" line="369" extern="1"/>
  <Method id="_2007" name="CreateMenu" returns="_3058" virtual="1" pure_virtual="1" overrides="" context="_1283" access="public" mangled="_ZN9SourceMod10IMenuStyle10CreateMenuEPNS_12IMenuHandlerEPNS_15IdentityToken_tE" demangled="SourceMod::IMenuStyle::CreateMenu(SourceMod::IMenuHandler*, SourceMod::IdentityToken_t*)" location="f28:381" file="f28" line="381" extern="1">
    <Argument name="handler" type="_3059" location="f28:381" file="f28" line="381"/>
    <Argument name="pOwner" type="_3018" location="f28:381" file="f28" line="381" default="0"/>
  </Method>
  <Method id="_2008" name="GetMaxPageItems" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1283" access="public" mangled="_ZN9SourceMod10IMenuStyle15GetMaxPageItemsEv" demangled="SourceMod::IMenuStyle::GetMaxPageItems()" location="f28:391" file="f28" line="391" extern="1"/>
  <Method id="_2009" name="GetClientMenu" returns="_1298" virtual="1" pure_virtual="1" overrides="" context="_1283" access="public" mangled="_ZN9SourceMod10IMenuStyle13GetClientMenuEiPPv" demangled="SourceMod::IMenuStyle::GetClientMenu(int, void**)" location="f28:401" file="f28" line="401" extern="1">
    <Argument name="client" type="_103" location="f28:401" file="f28" line="401"/>
    <Argument name="object" type="_1124" location="f28:401" file="f28" line="401"/>
  </Method>
  <Method id="_2010" name="CancelClientMenu" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1283" access="public" mangled="_ZN9SourceMod10IMenuStyle16CancelClientMenuEib" demangled="SourceMod::IMenuStyle::CancelClientMenu(int, bool)" location="f28:411" file="f28" line="411" extern="1">
    <Argument name="client" type="_103" location="f28:411" file="f28" line="411"/>
    <Argument name="autoIgnore" type="_1028" location="f28:411" file="f28" line="411" default="false"/>
  </Method>
  <Method id="_2011" name="GetHandle" returns="_1270" virtual="1" pure_virtual="1" overrides="" context="_1283" access="public" mangled="_ZN9SourceMod10IMenuStyle9GetHandleEv" demangled="SourceMod::IMenuStyle::GetHandle()" location="f28:418" file="f28" line="418" extern="1"/>
  <Method id="_2012" name="GetApproxMemUsage" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1283" access="public" mangled="_ZN9SourceMod10IMenuStyle17GetApproxMemUsageEv" demangled="SourceMod::IMenuStyle::GetApproxMemUsage()" location="f28:425" file="f28" line="425" extern="1"/>
  <Destructor id="_2013" name="IForwardManager" artificial="1" throw="" context="_1284" access="public" mangled="_ZN9SourceMod15IForwardManagerD1Ev *INTERNAL* " demangled="SourceMod::IForwardManager::~IForwardManager()" location="f26:228" file="f26" line="228" endline="228" inline="1">
  </Destructor>
  <OperatorMethod id="_2014" name="=" returns="_3060" artificial="1" throw="" context="_1284" access="public" mangled="_ZN9SourceMod15IForwardManageraSERKS0_" demangled="SourceMod::IForwardManager::operator=(SourceMod::IForwardManager const&amp;)" location="f26:228" file="f26" line="228" endline="228" inline="1">
    <Argument type="_3061" location="f26:228" file="f26" line="228"/>
  </OperatorMethod>
  <Constructor id="_2015" name="IForwardManager" artificial="1" throw="" context="_1284" access="public" mangled="_ZN9SourceMod15IForwardManagerC1ERKS0_ *INTERNAL* " demangled="SourceMod::IForwardManager::IForwardManager(SourceMod::IForwardManager const&amp;)" location="f26:228" file="f26" line="228" endline="228" inline="1">
    <Argument type="_3061" location="f26:228" file="f26" line="228"/>
  </Constructor>
  <Constructor id="_2016" name="IForwardManager" artificial="1" throw="" context="_1284" access="public" mangled="_ZN9SourceMod15IForwardManagerC1Ev *INTERNAL* " demangled="SourceMod::IForwardManager::IForwardManager()" location="f26:228" file="f26" line="228" endline="228" inline="1"/>
  <Method id="_2017" name="GetInterfaceName" returns="_1006" virtual="1" overrides="_2598 " context="_1284" access="public" mangled="_ZN9SourceMod15IForwardManager16GetInterfaceNameEv" demangled="SourceMod::IForwardManager::GetInterfaceName()" location="f26:230" file="f26" line="230" endline="232" inline="1"/>
  <Method id="_2018" name="GetInterfaceVersion" returns="_92" virtual="1" overrides="_2597 " context="_1284" access="public" mangled="_ZN9SourceMod15IForwardManager19GetInterfaceVersionEv" demangled="SourceMod::IForwardManager::GetInterfaceVersion()" location="f26:234" file="f26" line="234" endline="236" inline="1"/>
  <Method id="_2019" name="IsVersionCompatible" returns="_1028" virtual="1" overrides="_2599 " context="_1284" access="public" mangled="_ZN9SourceMod15IForwardManager19IsVersionCompatibleEj" demangled="SourceMod::IForwardManager::IsVersionCompatible(unsigned int)" location="f26:238" file="f26" line="238" endline="244" inline="1">
    <Argument name="version" type="_92" location="f26:238" file="f26" line="238"/>
  </Method>
  <Method id="_2020" name="CreateForward" returns="_3062" virtual="1" pure_virtual="1" overrides="" context="_1284" access="public" mangled="_ZN9SourceMod15IForwardManager13CreateForwardEPKcNS_8ExecTypeEjPKNS_9ParamTypeEz" demangled="SourceMod::IForwardManager::CreateForward(char const*, SourceMod::ExecType, unsigned int, SourceMod::ParamType const*, ...)" location="f26:266" file="f26" line="266" extern="1">
    <Argument name="name" type="_1006" location="f26:266" file="f26" line="266"/>
    <Argument name="et" type="_1268" location="f26:266" file="f26" line="266"/>
    <Argument name="num_params" type="_92" location="f26:266" file="f26" line="266"/>
    <Argument name="types" type="_3063" location="f26:266" file="f26" line="266"/>
    <Ellipsis/>
  </Method>
  <Method id="_2021" name="CreateForwardEx" returns="_3064" virtual="1" pure_virtual="1" overrides="" context="_1284" access="public" mangled="_ZN9SourceMod15IForwardManager15CreateForwardExEPKcNS_8ExecTypeEiPKNS_9ParamTypeEz" demangled="SourceMod::IForwardManager::CreateForwardEx(char const*, SourceMod::ExecType, int, SourceMod::ParamType const*, ...)" location="f26:286" file="f26" line="286" extern="1">
    <Argument name="name" type="_1006" location="f26:286" file="f26" line="286"/>
    <Argument name="et" type="_1268" location="f26:286" file="f26" line="286"/>
    <Argument name="num_params" type="_103" location="f26:286" file="f26" line="286"/>
    <Argument name="types" type="_3063" location="f26:286" file="f26" line="286"/>
    <Ellipsis/>
  </Method>
  <Method id="_2022" name="FindForward" returns="_3062" virtual="1" pure_virtual="1" overrides="" context="_1284" access="public" mangled="_ZN9SourceMod15IForwardManager11FindForwardEPKcPPNS_18IChangeableForwardE" demangled="SourceMod::IForwardManager::FindForward(char const*, SourceMod::IChangeableForward**)" location="f26:296" file="f26" line="296" extern="1">
    <Argument name="name" type="_1006" location="f26:296" file="f26" line="296"/>
    <Argument name="ifchng" type="_3065" location="f26:296" file="f26" line="296"/>
  </Method>
  <Method id="_2023" name="ReleaseForward" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1284" access="public" mangled="_ZN9SourceMod15IForwardManager14ReleaseForwardEPNS_8IForwardE" demangled="SourceMod::IForwardManager::ReleaseForward(SourceMod::IForward*)" location="f26:303" file="f26" line="303" extern="1">
    <Argument name="forward" type="_3062" location="f26:303" file="f26" line="303"/>
  </Method>
  <OperatorMethod id="_2024" name="=" returns="_3066" artificial="1" throw="" context="_1285" access="public" mangled="_ZN9SourceMod8ILibraryaSERKS0_" demangled="SourceMod::ILibrary::operator=(SourceMod::ILibrary const&amp;)" location="f39:56" file="f39" line="56" endline="56" inline="1">
    <Argument type="_3067" location="f39:56" file="f39" line="56"/>
  </OperatorMethod>
  <Constructor id="_2025" name="ILibrary" artificial="1" throw="" context="_1285" access="public" mangled="_ZN9SourceMod8ILibraryC1ERKS0_ *INTERNAL* " demangled="SourceMod::ILibrary::ILibrary(SourceMod::ILibrary const&amp;)" location="f39:56" file="f39" line="56" endline="56" inline="1">
    <Argument type="_3067" location="f39:56" file="f39" line="56"/>
  </Constructor>
  <Constructor id="_2026" name="ILibrary" artificial="1" throw="" context="_1285" access="public" mangled="_ZN9SourceMod8ILibraryC1Ev *INTERNAL* " demangled="SourceMod::ILibrary::ILibrary()" location="f39:56" file="f39" line="56" endline="56" inline="1"/>
  <Destructor id="_2027" name="ILibrary" virtual="1" overrides="" context="_1285" access="public" mangled="_ZN9SourceMod8ILibraryD1Ev *INTERNAL* " demangled="SourceMod::ILibrary::~ILibrary()" location="f39:59" file="f39" line="59" endline="61" inline="1">
  </Destructor>
  <Method id="_2028" name="CloseLibrary" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1285" access="public" mangled="_ZN9SourceMod8ILibrary12CloseLibraryEv" demangled="SourceMod::ILibrary::CloseLibrary()" location="f39:66" file="f39" line="66" extern="1"/>
  <Method id="_2029" name="GetSymbolAddress" returns="_296" virtual="1" pure_virtual="1" overrides="" context="_1285" access="public" mangled="_ZN9SourceMod8ILibrary16GetSymbolAddressEPKc" demangled="SourceMod::ILibrary::GetSymbolAddress(char const*)" location="f39:74" file="f39" line="74" extern="1">
    <Argument name="symname" type="_1006" location="f39:74" file="f39" line="74"/>
  </Method>
  <Destructor id="_2030" name="IBaseMenu" artificial="1" throw="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenuD1Ev *INTERNAL* " demangled="SourceMod::IBaseMenu::~IBaseMenu()" location="f28:432" file="f28" line="432" endline="432" inline="1">
  </Destructor>
  <OperatorMethod id="_2031" name="=" returns="_3068" artificial="1" throw="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenuaSERKS0_" demangled="SourceMod::IBaseMenu::operator=(SourceMod::IBaseMenu const&amp;)" location="f28:432" file="f28" line="432" endline="432" inline="1">
    <Argument type="_3069" location="f28:432" file="f28" line="432"/>
  </OperatorMethod>
  <Constructor id="_2032" name="IBaseMenu" artificial="1" throw="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenuC1ERKS0_ *INTERNAL* " demangled="SourceMod::IBaseMenu::IBaseMenu(SourceMod::IBaseMenu const&amp;)" location="f28:432" file="f28" line="432" endline="432" inline="1">
    <Argument type="_3069" location="f28:432" file="f28" line="432"/>
  </Constructor>
  <Constructor id="_2033" name="IBaseMenu" artificial="1" throw="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenuC1Ev *INTERNAL* " demangled="SourceMod::IBaseMenu::IBaseMenu()" location="f28:432" file="f28" line="432" endline="432" inline="1"/>
  <Method id="_2034" name="AppendItem" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu10AppendItemEPKcRKNS_12ItemDrawInfoE" demangled="SourceMod::IBaseMenu::AppendItem(char const*, SourceMod::ItemDrawInfo const&amp;)" location="f28:441" file="f28" line="441" extern="1">
    <Argument name="info" type="_1006" location="f28:441" file="f28" line="441"/>
    <Argument name="draw" type="_3070" location="f28:441" file="f28" line="441"/>
  </Method>
  <Method id="_2035" name="InsertItem" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu10InsertItemEjPKcRKNS_12ItemDrawInfoE" demangled="SourceMod::IBaseMenu::InsertItem(unsigned int, char const*, SourceMod::ItemDrawInfo const&amp;)" location="f28:453" file="f28" line="453" extern="1">
    <Argument name="position" type="_92" location="f28:453" file="f28" line="453"/>
    <Argument name="info" type="_1006" location="f28:453" file="f28" line="453"/>
    <Argument name="draw" type="_3070" location="f28:453" file="f28" line="453"/>
  </Method>
  <Method id="_2036" name="RemoveItem" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu10RemoveItemEj" demangled="SourceMod::IBaseMenu::RemoveItem(unsigned int)" location="f28:461" file="f28" line="461" extern="1">
    <Argument name="position" type="_92" location="f28:461" file="f28" line="461"/>
  </Method>
  <Method id="_2037" name="RemoveAllItems" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu14RemoveAllItemsEv" demangled="SourceMod::IBaseMenu::RemoveAllItems()" location="f28:466" file="f28" line="466" extern="1"/>
  <Method id="_2038" name="GetItemInfo" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu11GetItemInfoEjPNS_12ItemDrawInfoE" demangled="SourceMod::IBaseMenu::GetItemInfo(unsigned int, SourceMod::ItemDrawInfo*)" location="f28:475" file="f28" line="475" extern="1">
    <Argument name="position" type="_92" location="f28:475" file="f28" line="475"/>
    <Argument name="draw" type="_3071" location="f28:475" file="f28" line="475"/>
  </Method>
  <Method id="_2039" name="GetItemCount" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu12GetItemCountEv" demangled="SourceMod::IBaseMenu::GetItemCount()" location="f28:482" file="f28" line="482" extern="1"/>
  <Method id="_2040" name="SetPagination" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu13SetPaginationEj" demangled="SourceMod::IBaseMenu::SetPagination(unsigned int)" location="f28:495" file="f28" line="495" extern="1">
    <Argument name="itemsPerPage" type="_92" location="f28:495" file="f28" line="495"/>
  </Method>
  <Method id="_2041" name="GetPagination" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu13GetPaginationEv" demangled="SourceMod::IBaseMenu::GetPagination()" location="f28:502" file="f28" line="502" extern="1"/>
  <Method id="_2042" name="GetDrawStyle" returns="_3072" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu12GetDrawStyleEv" demangled="SourceMod::IBaseMenu::GetDrawStyle()" location="f28:509" file="f28" line="509" extern="1"/>
  <Method id="_2043" name="SetDefaultTitle" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu15SetDefaultTitleEPKc" demangled="SourceMod::IBaseMenu::SetDefaultTitle(char const*)" location="f28:516" file="f28" line="516" extern="1">
    <Argument name="message" type="_1006" location="f28:516" file="f28" line="516"/>
  </Method>
  <Method id="_2044" name="GetDefaultTitle" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu15GetDefaultTitleEv" demangled="SourceMod::IBaseMenu::GetDefaultTitle()" location="f28:523" file="f28" line="523" extern="1"/>
  <Method id="_2045" name="SetExtOption" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu12SetExtOptionENS_10MenuOptionEPKv" demangled="SourceMod::IBaseMenu::SetExtOption(SourceMod::MenuOption, void const*)" location="f28:532" file="f28" line="532" extern="1">
    <Argument name="option" type="_1271" location="f28:532" file="f28" line="532"/>
    <Argument name="valuePtr" type="_1122" location="f28:532" file="f28" line="532"/>
  </Method>
  <Method id="_2046" name="CreatePanel" returns="_3057" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu11CreatePanelEv" demangled="SourceMod::IBaseMenu::CreatePanel()" location="f28:542" file="f28" line="542" extern="1"/>
  <Method id="_2047" name="Display" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu7DisplayEijPNS_12IMenuHandlerE" demangled="SourceMod::IBaseMenu::Display(int, unsigned int, SourceMod::IMenuHandler*)" location="f28:552" file="f28" line="552" extern="1">
    <Argument name="client" type="_103" location="f28:552" file="f28" line="552"/>
    <Argument name="time" type="_92" location="f28:552" file="f28" line="552"/>
    <Argument name="alt_handler" type="_3059" location="f28:552" file="f28" line="552" default="0"/>
  </Method>
  <Method id="_2048" name="Destroy" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu7DestroyEb" demangled="SourceMod::IBaseMenu::Destroy(bool)" location="f28:562" file="f28" line="562" extern="1">
    <Argument name="releaseHandle" type="_1028" location="f28:562" file="f28" line="562" default="true"/>
  </Method>
  <Method id="_2049" name="Cancel" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu6CancelEv" demangled="SourceMod::IBaseMenu::Cancel()" location="f28:571" file="f28" line="571" extern="1"/>
  <Method id="_2050" name="GetHandle" returns="_1270" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu9GetHandleEv" demangled="SourceMod::IBaseMenu::GetHandle()" location="f28:579" file="f28" line="579" extern="1"/>
  <Method id="_2051" name="GetMenuOptionFlags" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu18GetMenuOptionFlagsEv" demangled="SourceMod::IBaseMenu::GetMenuOptionFlags()" location="f28:586" file="f28" line="586" extern="1"/>
  <Method id="_2052" name="SetMenuOptionFlags" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu18SetMenuOptionFlagsEj" demangled="SourceMod::IBaseMenu::SetMenuOptionFlags(unsigned int)" location="f28:593" file="f28" line="593" extern="1">
    <Argument name="flags" type="_92" location="f28:593" file="f28" line="593"/>
  </Method>
  <Method id="_2053" name="GetHandler" returns="_3059" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu10GetHandlerEv" demangled="SourceMod::IBaseMenu::GetHandler()" location="f28:600" file="f28" line="600" extern="1"/>
  <Method id="_2054" name="DisplayAtItem" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu13DisplayAtItemEijjPNS_12IMenuHandlerE" demangled="SourceMod::IBaseMenu::DisplayAtItem(int, unsigned int, unsigned int, SourceMod::IMenuHandler*)" location="f28:616" file="f28" line="616" extern="1">
    <Argument name="client" type="_103" location="f28:616" file="f28" line="616"/>
    <Argument name="time" type="_92" location="f28:616" file="f28" line="616"/>
    <Argument name="start_item" type="_92" location="f28:616" file="f28" line="616"/>
    <Argument name="alt_handler" type="_3059" location="f28:616" file="f28" line="616" default="0"/>
  </Method>
  <Method id="_2055" name="GetApproxMemUsage" returns="_92" virtual="1" pure_virtual="1" overrides="" context="_1289" access="public" mangled="_ZN9SourceMod9IBaseMenu17GetApproxMemUsageEv" demangled="SourceMod::IBaseMenu::GetApproxMemUsage()" location="f28:623" file="f28" line="623" extern="1"/>
  <Field id="_2056" name="hsVersion" type="_92" offset="0" context="_1290" access="public" location="f38:149" file="f38" line="149"/>
  <Field id="_2057" name="ident" type="_3018" offset="32" context="_1290" access="public" location="f38:150" file="f38" line="150"/>
  <Field id="_2058" name="access" type="_3073" offset="64" context="_1290" access="public" location="f38:151" file="f38" line="151"/>
  <Destructor id="_2059" name="TypeAccess" artificial="1" throw="" context="_1290" access="public" mangled="_ZN9SourceMod10TypeAccessD1Ev *INTERNAL* " demangled="SourceMod::TypeAccess::~TypeAccess()" location="f38:143" file="f38" line="143" endline="143" inline="1">
  </Destructor>
  <OperatorMethod id="_2060" name="=" returns="_3074" artificial="1" throw="" context="_1290" access="public" mangled="_ZN9SourceMod10TypeAccessaSERKS0_" demangled="SourceMod::TypeAccess::operator=(SourceMod::TypeAccess const&amp;)" location="f38:143" file="f38" line="143" endline="143" inline="1">
    <Argument type="_3075" location="f38:143" file="f38" line="143"/>
  </OperatorMethod>
  <Constructor id="_2061" name="TypeAccess" artificial="1" throw="" context="_1290" access="public" mangled="_ZN9SourceMod10TypeAccessC1ERKS0_ *INTERNAL* " demangled="SourceMod::TypeAccess::TypeAccess(SourceMod::TypeAccess const&amp;)" location="f38:143" file="f38" line="143" endline="143" inline="1">
    <Argument type="_3075" location="f38:143" file="f38" line="143"/>
  </Constructor>
  <Constructor id="_2062" name="TypeAccess" explicit="1" context="_1290" access="public" mangled="_ZN9SourceMod10TypeAccessC1Ev *INTERNAL* " demangled="SourceMod::TypeAccess::TypeAccess()" location="f38:145" file="f38" line="145" endline="147" inline="1"/>
  <Field id="_2063" name="dbiVersion" type="_92" offset="0" context="_1291" access="public" location="f15:616" file="f15" line="616"/>
  <Field id="_2064" name="host" type="_1006" offset="32" context="_1291" access="public" location="f15:617" file="f15" line="617"/>
  <Field id="_2065" name="database" type="_1006" offset="64" context="_1291" access="public" location="f15:618" file="f15" line="618"/>
  <Field id="_2066" name="user" type="_1006" offset="96" context="_1291" access="public" location="f15:619" file="f15" line="619"/>
  <Field id="_2067" name="pass" type="_1006" offset="128" context="_1291" access="public" location="f15:620" file="f15" line="620"/>
  <Field id="_2068" name="driver" type="_1006" offset="160" context="_1291" access="public" location="f15:621" file="f15" line="621"/>
  <Field id="_2069" name="port" type="_92" offset="192" context="_1291" access="public" location="f15:622" file="f15" line="622"/>
  <Field id="_2070" name="maxTimeout" type="_92" offset="224" context="_1291" access="public" location="f15:623" file="f15" line="623"/>
  <Destructor id="_2071" name="DatabaseInfo" artificial="1" throw="" context="_1291" access="public" mangled="_ZN9SourceMod12DatabaseInfoD1Ev *INTERNAL* " demangled="SourceMod::DatabaseInfo::~DatabaseInfo()" location="f15:609" file="f15" line="609" endline="609" inline="1">
  </Destructor>
  <OperatorMethod id="_2072" name="=" returns="_3076" artificial="1" throw="" context="_1291" access="public" mangled="_ZN9SourceMod12DatabaseInfoaSERKS0_" demangled="SourceMod::DatabaseInfo::operator=(SourceMod::DatabaseInfo const&amp;)" location="f15:609" file="f15" line="609" endline="609" inline="1">
    <Argument type="_3077" location="f15:609" file="f15" line="609"/>
  </OperatorMethod>
  <Constructor id="_2073" name="DatabaseInfo" artificial="1" throw="" context="_1291" access="public" mangled="_ZN9SourceMod12DatabaseInfoC1ERKS0_ *INTERNAL* " demangled="SourceMod::DatabaseInfo::DatabaseInfo(SourceMod::DatabaseInfo const&amp;)" location="f15:609" file="f15" line="609" endline="609" inline="1">
    <Argument type="_3077" location="f15:609" file="f15" line="609"/>
  </Constructor>
  <Constructor id="_2074" name="DatabaseInfo" explicit="1" context="_1291" access="public" mangled="_ZN9SourceMod12DatabaseInfoC1Ev *INTERNAL* " demangled="SourceMod::DatabaseInfo::DatabaseInfo()" location="f15:610" file="f15" line="610" endline="614" inline="1"/>
  <OperatorMethod id="_2075" name="=" returns="_3078" artificial="1" throw="" context="_1293" access="public" mangled="_ZN9SourceMod10IDirectoryaSERKS0_" demangled="SourceMod::IDirectory::operator=(SourceMod::IDirectory const&amp;)" location="f39:81" file="f39" line="81" endline="81" inline="1">
    <Argument type="_3079" location="f39:81" file="f39" line="81"/>
  </OperatorMethod>
  <Constructor id="_2076" name="IDirectory" artificial="1" throw="" context="_1293" access="public" mangled="_ZN9SourceMod10IDirectoryC1ERKS0_ *INTERNAL* " demangled="SourceMod::IDirectory::IDirectory(SourceMod::IDirectory const&amp;)" location="f39:81" file="f39" line="81" endline="81" inline="1">
    <Argument type="_3079" location="f39:81" file="f39" line="81"/>
  </Constructor>
  <Constructor id="_2077" name="IDirectory" artificial="1" throw="" context="_1293" access="public" mangled="_ZN9SourceMod10IDirectoryC1Ev *INTERNAL* " demangled="SourceMod::IDirectory::IDirectory()" location="f39:81" file="f39" line="81" endline="81" inline="1"/>
  <Destructor id="_2078" name="IDirectory" virtual="1" overrides="" context="_1293" access="public" mangled="_ZN9SourceMod10IDirectoryD1Ev *INTERNAL* " demangled="SourceMod::IDirectory::~IDirectory()" location="f39:84" file="f39" line="84" endline="86" inline="1">
  </Destructor>
  <Method id="_2079" name="MoreFiles" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1293" access="public" mangled="_ZN9SourceMod10IDirectory9MoreFilesEv" demangled="SourceMod::IDirectory::MoreFiles()" location="f39:91" file="f39" line="91" extern="1"/>
  <Method id="_2080" name="NextEntry" returns="_80" virtual="1" pure_virtual="1" overrides="" context="_1293" access="public" mangled="_ZN9SourceMod10IDirectory9NextEntryEv" demangled="SourceMod::IDirectory::NextEntry()" location="f39:96" file="f39" line="96" extern="1"/>
  <Method id="_2081" name="GetEntryName" returns="_1006" virtual="1" pure_virtual="1" overrides="" context="_1293" access="public" mangled="_ZN9SourceMod10IDirectory12GetEntryNameEv" demangled="SourceMod::IDirectory::GetEntryName()" location="f39:101" file="f39" line="101" extern="1"/>
  <Method id="_2082" name="IsEntryDirectory" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1293" access="public" mangled="_ZN9SourceMod10IDirectory16IsEntryDirectoryEv" demangled="SourceMod::IDirectory::IsEntryDirectory()" location="f39:106" file="f39" line="106" extern="1"/>
  <Method id="_2083" name="IsEntryFile" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1293" access="public" mangled="_ZN9SourceMod10IDirectory11IsEntryFileEv" demangled="SourceMod::IDirectory::IsEntryFile()" location="f39:111" file="f39" line="111" extern="1"/>
  <Method id="_2084" name="IsEntryValid" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1293" access="public" mangled="_ZN9SourceMod10IDirectory12IsEntryValidEv" demangled="SourceMod::IDirectory::IsEntryValid()" location="f39:117" file="f39" line="117" extern="1"/>
  <Destructor id="_2085" name="IDatabase" artificial="1" throw="" context="_1295" access="public" mangled="_ZN9SourceMod9IDatabaseD1Ev *INTERNAL* " demangled="SourceMod::IDatabase::~IDatabase()" location="f15:426" file="f15" line="426" endline="426" inline="1">
  </Destructor>
  <OperatorMethod id="_2086" name="=" returns="_3080" artificial="1" throw="" context="_1295" access="public" mangled="_ZN9SourceMod9IDatabaseaSERKS0_" demangled="SourceMod::IDatabase::operator=(SourceMod::IDatabase const&amp;)" location="f15:426" file="f15" line="426" endline="426" inline="1">
    <Argument type="_3081" location="f15:426" file="f15" line="426"/>
  </OperatorMethod>
  <Constructor id="_2087" name="IDatabase" artificial="1" throw="" context="_1295" access="public" mangled="_ZN9SourceMod9IDatabaseC1ERKS0_ *INTERNAL* " demangled="SourceMod::IDatabase::IDatabase(SourceMod::IDatabase const&amp;)" location="f15:426" file="f15" line="426" endline="426" inline="1">
    <Argument type="_3081" location="f15:426" file="f15" line="426"/>
  </Constructor>
  <Constructor id="_2088" name="IDatabase" artificial="1" throw="" context="_1295" access="public" mangled="_ZN9SourceMod9IDatabaseC1Ev *INTERNAL* " demangled="SourceMod::IDatabase::IDatabase()" location="f15:426" file="f15" line="426" endline="426" inline="1"/>
  <Method id="_2089" name="Close" returns="_1028" virtual="1" pure_virtual="1" overrides="" context="_1295" access="public" mangled="_ZN9SourceMod9IDatabase5CloseEv" demangled="SourceMod::IDatabase::Close()" location="f15:441" file="f15" line="441" extern="1"/>
